Repository: veyon/docs
Catalog: locale/*/LC_MESSAGES/addons.po
Languages: sv, tr

source: Depending on the mode, discovered computers are shown in the *Discovered computers* location or in locations named like the configured network ranges groups. However it's possible to use other information to model locations and map discovered computers to them. For this several alternative data sources are available:
sv: Beroende på läge visas upptäckta datorer på platsen *Discovered computers* eller på platser som har samma namn som de konfigurerade nätverksintervallgrupperna. Det är dock möjligt att använda annan information för att modellera platser och mappa upptäckta datorer till dem. För detta finns flera alternativa datakällor tillgängliga:
tr: Moda bağlı olarak, keşfedilen bilgisayarlar *Taranan bilgisayarlar* konumunda veya yapılandırılmış ağ aralığı grupları gibi adlandırılan konumlarda gösterilir. Ancak konumları modellemek ve keşfedilen bilgisayarları bunlara eşlemek için başka bilgiler kullanmak mümkündür. Bunun için çeşitli alternatif veri kaynakları mevcuttur:

source: Extract from computer names
sv: Extrahera från datornamn
tr: Bilgisayar adlarından çıkar

source: See section :ref:`ExtractNamesViaRegEx` for details.
sv: Se avsnitt :ref:`ExtractNamesViaRegEx` för detaljer.
tr: Ayrıntılar için :ref:`ExtractNamesViaRegEx` bölümüne bakın.

source: Groups of logged-in users
sv: Grupper av inloggade användare
tr: Oturum açmış kullanıcı grupları

source: Select this option if users are organized in classes/courses and are members of corresponding class/course groups. Then these class/course groups will be used as locations. To only use these specific user groups (and filter out unrelated user groups), you can configure a filter expression. Only groups matching this filter expressions will be displayed as locations.
sv: Välj det här alternativet om användarna är organiserade i klasser/kurser och är medlemmar i motsvarande klass-/kursgrupper. Då kommer dessa klass-/kursgrupper att användas som platser. Om du bara vill använda dessa specifika användargrupper (och filtrera bort orelaterade användargrupper) kan du konfigurera ett filteruttryck. Endast grupper som matchar detta filteruttryck kommer att visas som platser.
tr: Kullanıcılar sınıflar/dersler halinde organize edilmişse ve ilgili sınıf/ders gruplarının üyeleriyse bu seçeneği seçin. Daha sonra bu sınıf/ders grupları konum olarak kullanılacaktır. Yalnızca bu belirli kullanıcı gruplarını kullanmak (ve ilgisiz kullanıcı gruplarını filtrelemek) için bir filtre ifadesi yapılandırabilirsiniz. Yalnızca bu filtre ifadeleriyle eşleşen gruplar konum olarak gösterilecektir.

source: Select this option to use the value of a certain environment variable in the user session as location name. The name of the environment variable has to be specified.
sv: Välj det här alternativet om du vill använda värdet för en viss miljövariabel i användarsessionen som platsnamn. Namnet på miljövariabeln måste anges.
tr: Kullanıcı oturumunda belirli bir ortam değişkeninin değerini konum adı olarak kullanmak için bu seçeneği belirleyin. Ortam değişkeninin adı belirtilmelidir.

source: Select this option to use the value of a registry key as location name. The registry is read in the context of the logged in user so either a key in ``HKEY_CURRENT_USER`` or any other globally readable key can be read from.
sv: Välj detta alternativ om du vill använda värdet på en registernyckel som platsnamn. Registret läses i kontexten för den inloggade användaren, så antingen en nyckel i ``HKEY_CURRENT_USER`` eller någon annan globalt läsbar nyckel kan läsas från.
tr: Bir kayıt defteri anahtarının değerini konum adı olarak kullanmak için bu seçeneği seçin. Kayıt defteri, oturum açmış kullanıcının bağlamında okunur, bu nedenle ``HKEY_CURRENT_USER`` içindeki bir anahtardan veya küresel olarak okunabilen herhangi bir anahtardan okunabilir.

source: Extracting computer and location names via regular expressions
sv: Extrahera dator- och platsnamn med hjälp av reguljära uttryck
tr: Düzenli ifadeler aracılığıyla bilgisayar ve konum adlarını çıkarma

source: Depending on the mode, discovered computers are shown in the *Discovered computers* location or in locations named like the configured network ranges groups. However if the hostnames also contain the room or location name, you can let Network Discovery extract the location name and optionally also the displayed computer name from the hostname. This is done by applying a regular expression on the hostnames. The first capture group of the regular expression is then used as location/computer name.
sv: Beroende på läge visas upptäckta datorer på platsen *Discovered computers* eller på platser som har samma namn som de konfigurerade nätverksintervallgrupperna. Men om värdnamnen också innehåller rummets eller platsens namn kan du låta Network Discovery extrahera platsnamnet och eventuellt också det visade datornamnet från värdnamnet. Detta görs genom att tillämpa ett reguljärt uttryck på värdnamnen. Den första fångstgruppen i det reguljära uttrycket används sedan som plats-/datornamn.
tr: Moda bağlı olarak, keşfedilen bilgisayarlar *Keşfedilen bilgisayarlar* konumunda veya yapılandırılmış ağ aralığı grupları gibi adlandırılan konumlarda gösterilir. Ancak ana bilgisayar adları oda veya konum adını da içeriyorsa, Ağ Tarama'nın konum adını ve isteğe bağlı olarak görüntülenen bilgisayar adını da ana bilgisayar adından çıkarmasına izin verebilirsiniz. Bu, ana bilgisayar adlarına düzenli bir ifade uygulanarak yapılır. Düzenli ifadenin ilk yakalama grubu daha sonra konum/bilgisayar adı olarak kullanılır.

source: For example, if the hostnames have the format ``r<ROOM-NUMBER>-c<COMPUTER-NUMBER>`` (e.g. ``r101-c01.example.org``), you can change the location data source to :guilabel:`Extract from computer names` and use the following regular expression to extract the location name:
sv: Om värdnamnen t.ex. har formatet ``r<ROOM-NUMBER>-c<COMPUTER-NUMBER>`` (t.ex. ``r101-c01.example.org``) kan du ändra platsdatakällan till :guilabel:`Extrahera från datornamn` och använda följande reguljära uttryck för att extrahera platsnamnet:
tr: Örneğin, ana bilgisayar adları ``r<ROOM-NUMBER>-c<COMPUTER-NUMBER>`` biçimindeyse (ör. ``r101-c01.example.org``), konum verisi kaynağını :guilabel:`Bilgisayar adlarından ayıkla` olarak değiştirebilir ve konum adını ayıklamak için aşağıdaki normal ifadeyi kullanabilirsiniz:

source: The same substring extraction is possible for computer names as well (except for :guilabel:`Data source` is set to :guilabel:`IP address`). For the example hostname scheme, a regular expression to extract the computer name (i.e. strip location and domain name) would be:
sv: Samma extrahering av delsträngar är möjlig även för datornamn (förutom när :guilabel:`Data source` är inställd på :guilabel:`IP address`). För värdnamnsschemat i exemplet skulle ett reguljärt uttryck för att extrahera datornamnet (dvs. strip-plats och domännamn) vara:
tr: Aynı alt dize çıkarma işlemi bilgisayar adları için de mümkündür (:guilabel:`Veri kaynağı` :guilabel:`IP adresi` olarak ayarlandığı durumlar hariç). Örnek ana bilgisayar adı şeması için, bilgisayar adını çıkarmak için (yani konum ve etki alanı adını çıkarmak için) düzenli bir ifade şöyle olurdu:

source: Advanced settings
sv: Avancerade inställningar
tr: Gelişmiş ayarlar

source: In the :guilabel:`Advanced` view mode several options for fine-tuning the behavior are available:
sv: I visningsläget :guilabel:`Advanced` finns flera alternativ för att finjustera beteendet:
tr: :guilabel:`Gelişmiş` görünüm modunda, davranışı ince ayarlamak için çeşitli seçenekler mevcuttur:

source: Property for generating persistent network object IDs
sv: Egenskap för att generera beständiga ID:n för nätverksobjekt
tr: Kalıcı ağ nesnesi kimlikleri üretme özelliği

source: Per default Veyon calculates unique internal IDs for each network object based on multiple information such as hostname, computer name etc. These IDs are used when saving and loading custom computer positions in Veyon Master. In order to use fixed positions for computers based on their host or computer name (especially if the computer name is configured to equal e.g. the user name), you can choose the corresponding option.
sv: Som standard beräknar Veyon unika interna ID:n för varje nätverksobjekt baserat på flera olika uppgifter, t.ex. värdnamn, datornamn osv. Dessa ID:n används när du sparar och laddar anpassade datorpositioner i Veyon Master. Om du vill använda fasta positioner för datorer baserat på deras värd- eller datornamn (särskilt om datornamnet är konfigurerat att vara lika med t.ex. användarnamnet) kan du välja motsvarande alternativ.
tr: Varsayılan olarak Veyon, ana bilgisayar adı, bilgisayar adı vb. gibi birden fazla bilgiye dayanarak her ağ nesnesi için benzersiz dahili kimlikler hesaplar. Bu kimlikler, Veyon Master'da özel bilgisayar konumlarını kaydederken ve yüklerken kullanılır. Bilgisayarlar için ana bilgisayar veya bilgisayar adına göre sabit konumlar kullanmak için (özellikle bilgisayar adı örneğin kullanıcı adına eşit olacak şekilde yapılandırılmışsa), karşılık gelen seçeneği seçebilirsiniz.

source: Data retrieval timeout
sv: Timeout för hämtning av data
tr: Veri alma zaman aşımı

source: This setting influences the maximum time Network Discovery waits to obtain the computer name via DNS or to query certain session-related characteristics from a remote computer.
sv: Den här inställningen påverkar den maximala tid som Network Discovery väntar på att få datornamnet via DNS eller på att fråga efter vissa sessionsrelaterade egenskaper från en fjärrdator.
tr: Bu ayar, Ağ Tarama DNS aracılığıyla bilgisayar adını almak veya uzak bir bilgisayardan belirli oturumla ilgili özellikleri sorgulamak için beklediği maksimum süreyi etkiler.

source: **Default:** *5000 ms*
sv: **Standard:** *5000 ms*
tr: **Varsayılan:** *5000 ms*

source: The CLI module ``networkdiscovery`` allows scanning for computers at the command line:
sv: Med CLI-modulen ``networkdiscovery`` kan du söka efter datorer på kommandoraden:
tr: ``networkdiscovery`` CLI modülü komut satırında bilgisayarların taranmasına olanak tanır:

source: This command scans either the subnets of the local host or the specified subnets for computers running the Veyon Server.
sv: Detta kommando söker igenom antingen den lokala värdens undernät eller de angivna undernäten efter datorer som kör Veyon Server.
tr: Bu komut, Veyon Sunucusunu çalıştıran bilgisayarları bulmak için yerel ana bilgisayarın alt ağlarını veya belirtilen alt ağları tarar.

source: Veyon Add-ons Integration Manual
tr: Veyon Eklentileri Entegrasyon Kılavuzu

source: Backends
tr: Arka uçlar
