Repository: veyon/docs
Catalog: locale/*/LC_MESSAGES/addons.po
Languages: sv, tr

source: Deployment
sv: Utplacering
tr: Dağıtım

source: Initial steps
sv: Inledande steg
tr: İlk adımlar

source: Install Veyon on the reference/teacher computer
sv: Installera Veyon på datorn för referens/lärare
tr: Veyon'u referans/öğretmen bilgisayarına yükleyin

source: Install Veyon Add-ons on the reference/teacher computer
sv: Installera Veyon Add-ons på referens/lärarens dator
tr: Referans/öğretmen bilgisayarına Veyon Eklentilerini yükleyin

source: Import the purchased license file(s)
sv: Importera den köpta licensfilen (-erna)
tr: Satın alınan lisans dosya(larını) içe aktarın

source: Make changes to the configuration as desired
sv: Gör ändringar i konfigurationen efter önskemål
tr: Yapılandırmada istediğiniz değişiklikleri yapın

source: Export the configuration
sv: Exportera konfigurationen
tr: Yapılandırmayı dışa aktar

source: Automated/silent installation
sv: Automatiserad/tyst installation
tr: Otomatik/sessiz kurulum

source: Like Veyon itself the add-ons can also be installed in *silent mode* by passing the ``/S`` parameter and optionally ``/D=...``. Please refer to chapter :ref:`AutoInstall` in the administrator manual for details.
sv: Precis som Veyon självt kan tilläggsprogrammen också installeras i *tyst läge* genom att ange parametern ``/S`` och eventuellt ``/D=...``. Se kapitel :ref:`AutoInstall` i administratörshandboken för mer information.
tr: Veyon'un kendisi gibi eklentiler de ``/S`` parametresini ve isteğe bağlı olarak ``/D=...`` parametresini geçerek *sessiz modda* kurulabilir. Ayrıntılar için lütfen yönetici kılavuzundaki :ref:`AutoInstall` bölümüne bakın.

source: Deploying licenses
sv: Distribuera licenser
tr: Lisansların dağıtımı

source: Since all licenses are part of a Veyon configuration they can be deployed easily using the well-known mechanisms for :ref:`importing the configuration during installation <InstallationConfigurationImport>`. A configuration containing the licenses can already be imported/applied when the add-ons are not yet installed. This will make the add-ons work instantly whenever they get installed later.
sv: Eftersom alla licenser är en del av en Veyon-konfiguration kan de enkelt distribueras med hjälp av de välkända mekanismerna för :ref:`import av konfigurationen under installationen <InstallationConfigurationImport>`. En konfiguration som innehåller licenserna kan redan importeras/tillämpas när tilläggsprogrammen ännu inte är installerade. Detta kommer att göra att tilläggen fungerar direkt när de installeras senare.
tr: Tüm lisanslar bir Veyon yapılandırmasının parçası olduğundan, :ref:`kurulum sırasında yapılandırmayı içe aktarma<InstallationConfigurationImport>` için bilinen mekanizmalar kullanılarak kolayca dağıtılabilirler. Lisansları içeren bir yapılandırma, eklentiler henüz yüklenmemişken içe aktarılabilir/uygulanabilir. Bu, eklentilerin daha sonra yüklendiklerinde anında çalışmasını sağlayacaktır.

source: Entra ID Connector
sv: Entra ID-kontakt
tr: Entra ID Bağlantısı

source: General
sv: Allmänt
tr: Genel

source: The Veyon Entra ID Connector add-on extends Veyon Master to read devices and their location from an Entra ID instance. Once set up, computers and locations no longer have to be maintained in the builtin network object directory. A previously configured LDAP/ActiveDirectory integration can be replaced with the Entra ID connector after migrating an On Premise ActiveDirectory to Entra ID in the Azure cloud.
sv: Tilläggsprogrammet Veyon Entra ID Connector utökar Veyon Master så att det kan läsa enheter och deras plats från en Entra ID-instans. När det har konfigurerats behöver datorer och platser inte längre underhållas i den inbyggda nätverksobjektkatalogen. En tidigare konfigurerad LDAP/ActiveDirectory-integration kan ersättas med Entra ID Connector efter migrering av en On Premise ActiveDirectory till Entra ID i Azure-molnet.
tr: Veyon Entra ID Connector eklentisi, Veyon Master'ı cihazları ve konumlarını bir Entra ID örneğinden okuyacak şekilde genişletir. Kurulduktan sonra, bilgisayarlar ve konumlar artık yerleşik ağ nesnesi dizininde tutulmak zorunda değildir. Önceden yapılandırılmış bir LDAP/ActiveDirectory entegrasyonu, bir On Premise ActiveDirectory'yi Azure bulutundaki Entra ID'ye taşıdıktan sonra Entra ID bağlayıcısıyla değiştirilebilir.

source: Initial setup
sv: Initial inställning
tr: İlk kurulum

source: First of all the Veyon Add-ons package needs to be installed. Make sure to download and install the version corresponding to your Veyon installation, i.e. Veyon 4.9.1 requires Veyon Add-ons 4.9.1 while for Veyon 4.8.3 you need to install version 4.8.3 of the add-ons. Please refer to :ref:`DeployingAddons` for further information.
sv: Först och främst måste Veyon Add-ons-paketet installeras. Se till att du laddar ner och installerar den version som motsvarar din Veyon-installation, dvs. Veyon 4.9.1 kräver Veyon Add-ons 4.9.1 medan du för Veyon 4.8.3 behöver installera version 4.8.3 av add-ons. Se :ref:`DeployingAddons` för ytterligare information.
tr: Öncelikle Veyon Eklentileri paketinin kurulması gerekiyor. Veyon kurulumunuza karşılık gelen sürümü indirip kurduğunuzdan emin olun, yani Veyon 4.9.1, Veyon Eklentileri 4.9.1 gerektirirken Veyon 4.8.3 için eklentilerin 4.8.3 sürümünü kurmanız gerekir. Daha fazla bilgi için lütfen :ref:`DeployingAddons`'a bakın.

source: After the installation has completed, you'll see some new configuration pages in the Veyon Configurator program. One of them is called :guilabel:`Entra ID Connector` and allows to set up the add-on:
sv: När installationen har slutförts kommer du att se några nya konfigurationssidor i Veyon Configurator-programmet. En av dem heter :guilabel:`Entra ID Connector` och gör det möjligt att konfigurera tillägget:
tr: Kurulum tamamlandıktan sonra, Veyon Configurator programında bazı yeni yapılandırma sayfaları göreceksiniz. Bunlardan biri :guilabel:`Entra ID Connector` olarak adlandırılır ve eklentiyi kurmanıza olanak tanır:

source: Entra ID Connector configuration page
sv: Konfigurationssida för Entra ID Connector
tr: Entra ID Bağlayıcı yapılandırma sayfası

source: App registration
sv: Registrering av app
tr: Uygulama kaydı

source: In order to fill the required fields, the connector has to be registered in your Entra ID instance first. For doing so open a web browser and nagivate to the Entra ID management area in the Azure Portal. Here you can register the Veyon Entra ID Connector as an application:
sv: För att kunna fylla i de obligatoriska fälten måste connectorn först registreras i din Entra ID-instans. För att göra detta öppnar du en webbläsare och går till Entra ID-hanteringsområdet i Azure Portal. Här kan du registrera Veyon Entra ID Connector som en applikation:
tr: Gerekli alanları doldurmak için, bağlayıcının önce Entra ID örneğinize kaydedilmesi gerekir. Bunu yapmak için bir web tarayıcısı açın ve Azure Portal'daki Entra ID yönetim alanına gidin. Burada Veyon Entra ID Bağlayıcısını bir uygulama olarak kaydedebilirsiniz:

source: App registration of the Veyon Entra ID Connector – Step 1
sv: App-registrering av Veyon Entra ID Connector - Steg 1
tr: Veyon Entra ID Connector'ın uygulama kaydı – Adım 1

source: Clicking :guilabel:`New registration` opens a new dialog where you have to enter a suitable name, e.g. *Veyon Entra ID Connector* and click on :guilabel:`Register`:
sv: Om du klickar på :guilabel:`Ny registrering` öppnas en ny dialogruta där du måste ange ett lämpligt namn, t.ex. *Veyon Entra ID Connector* och klicka på :guilabel:`Register`:
tr: :guilabel:`Yeni kayıt`a tıkladığınızda, uygun bir isim girmeniz gereken yeni bir iletişim kutusu açılır, örneğin *Veyon Entra ID Bağlayıcısı* ve :guilabel:`Kayıt Ol`a tıklayın:

source: App registration of the Veyon Entra ID Connector – Step 2
sv: App-registrering av Veyon Entra ID Connector - Steg 2
tr: Veyon Entra ID Connector'ın uygulama kaydı – Adım 2

source: After the app has been registered, you can already see the required IDs in the :guilabel:`Overview` page. Copy the *Application (client) ID* and *Directory (tenant) ID* to the corresponding fields in the Veyon Configurator:
sv: När appen har registrerats kan du redan se de ID:n som krävs på sidan :guilabel:`Overview`. Kopiera *Application (client) ID* och *Directory (tenant) ID* till motsvarande fält i Veyon Configurator:
tr: Uygulama kaydedildikten sonra, :guilabel:`Genel Bakış` sayfasında gerekli kimlikleri görebilirsiniz. *Uygulama (istemci) Kimliği* ve *Dizin (kiracı) Kimliği*'ni Veyon Yapılandırıcı'daki ilgili alanlara kopyalayın:

source: App registration of the Veyon Entra ID Connector – Step 3
sv: App-registrering av Veyon Entra ID Connector - Steg 3
tr: Veyon Entra ID Connector'ın uygulama kaydı – Adım 3

source: Client secrets
sv: Klienthemligheter
tr: İstemci gizemleri

source: Next, the client secret or certificate must be configured with which the Entra ID Connector can authenticate itself to the Azure cloud. Open the :guilabel:`Certificates & secrets` page and click on :guilabel:`New client secret`. Give the secret a name and specify when it will expire. Do not choose a too short period as you have to create a new secret and reconfigure Veyon everytime a client secret has expired:
sv: Därefter måste klienthemligheten eller certifikatet konfigureras med vilket Entra ID Connector kan autentisera sig mot Azure-molnet. Öppna sidan :guilabel:`Certificates & secrets` och klicka på :guilabel:`New client secret`. Ge hemligheten ett namn och ange när den ska upphöra att gälla. Välj inte en för kort period eftersom du då måste skapa en ny hemlighet och konfigurera om Veyon varje gång en klienthemlighet har löpt ut:
tr: Sonra, Entra ID Connector'ın Azure bulutunda kendini doğrulayabileceği istemci sırrı veya sertifikası yapılandırılmalıdır. :guilabel:`Sertifikalar ve sırlar` sayfasını açın ve :guilabel:`Yeni istemci sırrı`na tıklayın. Sırra bir ad verin ve ne zaman sona ereceğini belirtin. Çok kısa bir süre seçmeyin çünkü yeni bir sır oluşturmanız ve bir istemci sırrı her sona erdiğinde Veyon'u yeniden yapılandırmanız gerekir:

source: Create client secret for the Veyon Entra ID Connector – Step 1
sv: Skapa klienthemlighet för Veyon Entra ID Connector - Steg 1
tr: Veyon Entra ID Bağlayıcısı için istemci gizemi oluşturun – Adım 1

source: After the client secret has been created, you have to copy its value to the :guilabel:`Client secret` field in the Veyon Configurator.
sv: När klienthemligheten har skapats måste du kopiera dess värde till fältet :guilabel:`Client secret` i Veyon Configurator.
tr: İstemci sırrı oluşturulduktan sonra, değerini Veyon Yapılandırıcısı'ndaki :guilabel:`İstemci gizemi` alanına kopyalamanız gerekir.

source: Create client secret for the Veyon Entra ID Connector – Step 2
sv: Skapa klienthemlighet för Veyon Entra ID Connector - Steg 2
tr: Veyon Entra ID Bağlayıcısı için istemci gizemi oluşturun – Adım 2

source: The client secret value has to be copied immediately since it is only shown once directly after creating the client secret. If you forgot to copy it, you have to delete the secret and create a new one.
sv: Värdet för klienthemligheten måste kopieras omedelbart eftersom det bara visas en gång direkt efter att klienthemligheten har skapats. Om du har glömt att kopiera det måste du ta bort hemligheten och skapa en ny.
tr: İstemci gizemi değeri, istemci sırrı oluşturulduktan hemen sonra yalnızca bir kez gösterildiği için hemen kopyalanmalıdır. Kopyalamayı unuttuysanız, sırrı silmeniz ve yeni bir tane oluşturmanız gerekir.

source: You can now verify that the tenant ID, application ID and client secret are correct by clicking on the :guilabel:`Test access` button.
sv: Du kan nu verifiera att tenant ID, application ID och client secret är korrekta genom att klicka på knappen :guilabel:`Test access`.
tr: Artık tenant ID, uygulama kimliğinin ve istemci sırrının doğru olduğunu :guilabel:`Erişimi test et` butonuna tıklayarak doğrulayabilirsiniz.

source: A good alternative to client secrets are client certificates. This allows storing the secret at a specific location where you can set access permissions as desired. Otherwise the client secret is stored (encrypted) as part of the Veyon Configuration.
sv: Ett bra alternativ till klienthemligheter är klientcertifikat. Detta gör det möjligt att lagra hemligheten på en specifik plats där du kan ställa in åtkomstbehörigheter efter önskemål. Annars lagras klienthemligheten (krypterad) som en del av Veyon-konfigurationen.
tr: İstemci sırlarına iyi bir alternatif istemci sertifikalarıdır. Bu, sırrı istediğiniz gibi erişim izinlerini ayarlayabileceğiniz belirli bir konumda depolamanıza olanak tanır. Aksi takdirde istemci sırrı Veyon Yapılandırmasının bir parçası olarak depolanır (şifrelenir).

source: API permissions
sv: API-behörigheter
tr: API izinleri

source: The last important task is to set up the permissions for the registered app so that the Entra ID Connector can read the required information from Entra ID. Navigate to the :guilabel:`API permissions` page, click on the :guilabel:`Add a permission` button and select :guilabel:`Microsoft Graph`:
sv: Den sista viktiga uppgiften är att ställa in behörigheterna för den registrerade appen så att Entra ID Connector kan läsa den information som krävs från Entra ID. Navigera till sidan :guilabel:`API-behörigheter`, klicka på knappen :guilabel:`Lägg till en behörighet` och välj :guilabel:`Microsoft Graph`:
tr: Son önemli görev, Entra ID Bağlayıcısının Entra ID'den gerekli bilgileri okuyabilmesi için kayıtlı uygulama için izinleri ayarlamak. :guilabel:`API izinleri` sayfasına gidin, :guilabel:`İzin ekle` düğmesine tıklayın ve :guilabel:`Microsoft Graph`'ı seçin:

source: Set up permissions for the Veyon Entra ID Connector – Step 1
sv: Konfigurera behörigheter för Veyon Entra ID Connector - Steg 1
tr: Veyon Entra ID Bağlayıcısı için izinleri ayarlayın – Adım 1

source: Now the actual permissions have to be selected. Select :guilabel:`Application permissions`, search for the *Device.Read.All* permission and check it:
sv: Nu måste de faktiska behörigheterna väljas. Välj :guilabel:`Application permissions`, sök efter behörigheten *Device.Read.All* och markera den:
tr: Şimdi gerçek izinlerin seçilmesi gerekiyor. :guilabel:`Uygulama izinleri`ni seçin, *Device.Read.All* iznini arayın ve kontrol edin:

source: Set up permissions for the Veyon Entra ID Connector – Step 2
sv: Konfigurera behörigheter för Veyon Entra ID Connector - Steg 2
tr: Veyon Entra ID Bağlayıcısı için izinleri ayarlayın – Adım 2

source: Repeat this step for the permissions *Group.Read.All*, *GroupMember.Read.All* and *User.Read.All*. After checking all required permissions, click on :guilabel:`Add permissions`.
sv: Upprepa detta steg för behörigheterna *Group.Read.All*, *GroupMember.Read.All* och *User.Read.All*. När du har kontrollerat alla nödvändiga behörigheter klickar du på :guilabel:`Add permissions`.

source: The last step is to grant admin consent for these permissions. This can easily be done by clicking on :guilabel:`Grant admin consent for <YOUR-ORGANIZATION>`:
sv: Det sista steget är att ge administratörens samtycke till dessa behörigheter. Detta kan enkelt göras genom att klicka på :guilabel:`Grant admin consent for <YOUR-ORGANIZATION>`:
tr: Son adım bu izinler için yönetici onayı vermektir. Bu, :guilabel:`Grant admin permission for `:'<YOUR-ORGANIZATION>a tıklanarak kolayca yapılabilir.

source: Set up permissions for the Veyon Entra ID Connector – Step 3
sv: Konfigurera behörigheter för Veyon Entra ID Connector - Steg 3
tr: Veyon Entra ID Bağlayıcısı için izinleri ayarlayın – Adım 3

source: Filters
sv: Filter
tr: Filtreler

source: Filters make it possible to read out only certain objects (devices, users and groups) and make them available for Veyon. This depends largely on how the objects are structured in your Entra ID instance and which of them are required for Veyon. If, for example, security groups are used as locations (rooms), the :guilabel:`Device groups filter` can be adjusted accordingly so that only groups starting with ``Room`` are used as locations. In that case a suitable filter would be ``startsWith(displayName, 'Room')``.
sv: Filter gör det möjligt att bara läsa ut vissa objekt (enheter, användare och grupper) och göra dem tillgängliga för Veyon. Detta beror till stor del på hur objekten är strukturerade i din Entra ID-instans och vilka av dem som krävs för Veyon. Om till exempel säkerhetsgrupper används som platser (rum) kan filtret :guilabel:`Device groups filter` justeras så att endast grupper som börjar med ``Room`` används som platser. I så fall skulle ett lämpligt filter vara ``startsWith(displayName, 'Room')``.
tr: Filtreler yalnızca belirli nesneleri (cihazlar, kullanıcılar ve gruplar) okumayı ve bunları Veyon için kullanılabilir hale getirmeyi mümkün kılar. Bu büyük ölçüde nesnelerin Entra ID örneğinizde nasıl yapılandırıldığına ve bunlardan hangilerinin Veyon için gerekli olduğuna bağlıdır. Örneğin, güvenlik grupları konum (odalar) olarak kullanılıyorsa, :guilabel:`Cihaz grupları filtresi` yalnızca ``Oda`` ile başlayan grupların konum olarak kullanılması için buna göre ayarlanabilir. Bu durumda uygun bir filtre ``startsWith(displayName, 'Oda')`` olacaktır.

source: See `Operators and functions supported in filter expressions <https://learn.microsoft.com/en-US/graph/filter-query-parameter?tabs=http#operators-and-functions-supported-in-filter-expressions>`_ for further information.
sv: Se `Operatorer och funktioner som stöds i filteruttryck <https://learn.microsoft.com/en-US/graph/filter-query-parameter?tabs=http#operators-and-functions-supported-in-filter-expressions>`_ för mer information.
tr: Daha fazla bilgi için `Filtre ifadelerinde desteklenen operatörler ve işlevler <https://learn.microsoft.com/en-US/graph/filter-query-parameter?tabs=http#operators-and-functions-supported-in-filter-expressions>`_ bölümüne bakın.

source: Devices
sv: Enheter
tr: Cihazlar

source: In this section you can configure how certain device properties are retrieved. While the display name is always used as computer name, both hostname and the MAC address can be determined in different ways.
sv: I det här avsnittet kan du konfigurera hur vissa enhetsegenskaper ska hämtas. Displaynamnet används alltid som datornamn, men både värdnamnet och MAC-adressen kan bestämmas på olika sätt.
tr: Bu bölümde belirli aygıt özelliklerinin nasıl alınacağını yapılandırabilirsiniz. Görüntü adı her zaman bilgisayar adı olarak kullanılsa da, hem ana bilgisayar adı hem de MAC adresi farklı şekillerde belirlenebilir.

source: Hostname source
sv: Källa för värdnamn
tr: Ana bilgisayar adı kaynağı

source: If all device names match the hostnames and can be resolved to IP addresses using an internal DNS server (BIND, AD DS etc.) you can keep the default option :guilabel:`Device name`. You should not rely on legacy name resolution protocols such as NetBIOS. You can easily verify this by running ``nslookup <HOSTNAME>``. If the device names can't be resolved by a DNS server in your network, it's recommended to either resolve them via `multicast DNS <https://en.wikipedia.org/wiki/Multicast_DNS>`_ or store the actual hostname or host address in a custom :guilabel:`Hostname attribute`.
sv: Om alla enhetsnamn matchar värdnamnen och kan lösas till IP-adresser med hjälp av en intern DNS-server (BIND, AD DS etc.) kan du behålla standardalternativet :guilabel:`Device name`. Du bör inte förlita dig på äldre protokoll för namnupplösning, t.ex. NetBIOS. Du kan enkelt verifiera detta genom att köra ``nslookup <HOSTNAME>``. Om enhetsnamnen inte kan lösas av en DNS-server i ditt nätverk rekommenderas att du antingen löser dem via `multicast DNS &lt;https://en.wikipedia.org/wiki/Multicast_DNS&gt;`_ eller lagrar det faktiska värdnamnet eller värdadressen i ett anpassat :guilabel:`Hostname-attribut`.
tr: Tüm cihaz adları ana bilgisayar adlarıyla eşleşiyorsa ve dahili bir DNS sunucusu (BIND, AD DS vb.) kullanılarak IP adreslerine çözülebiliyorsa varsayılan seçeneği :guilabel:`Cihaz adı` olarak tutabilirsiniz. NetBIOS gibi eski ad çözümleme protokollerine güvenmemelisiniz. Bunu ``nslookup <HOSTNAME>`` çalıştırarak kolayca doğrulayabilirsiniz. Cihaz adları ağınızdaki bir DNS sunucusu tarafından çözülemiyorsa, bunları `çoklu yayın DNS <https://en.wikipedia.org/wiki/Multicast_DNS>`_ aracılığıyla çözmeniz veya gerçek ana bilgisayar adını veya ana bilgisayar adresini özel bir :guilabel:`Ana Bilgisayar adı özniteliğinde` depolamanız önerilir.

source: MAC address source
sv: MAC-adress källa
tr: MAC adresi kaynağı

source: Veyon uses MAC addresses for powering on computers via `Wake-on-LAN <https://en.wikipedia.org/wiki/Wake-on-LAN>`_. If you want to take advantage of this feature you can populate each device's MAC addresses in a certain (extension) attribute and enter the name of this attribute in the :guilabel:`MAC address attribute` field. If your devices are managed via Microsoft Intune you can also change the setting to use the Ethernet or Wi-Fi MAC addresses stored in Intune. Depending on the selected option, only the Ethernet or Wi-Fi MAC addresses are read or one of them while the first one is prioritized (i.e. the 2nd address only used if the 1st address is empty).
sv: Veyon använder MAC-adresser för att slå på datorer via `Wake-on-LAN <https://en.wikipedia.org/wiki/Wake-on-LAN>`_. Om du vill dra nytta av den här funktionen kan du fylla i varje enhets MAC-adresser i ett visst attribut (tilläggsattribut) och ange namnet på attributet i fältet :guilabel:`MAC address attribute`. Om dina enheter hanteras via Microsoft Intune kan du också ändra inställningen så att MAC-adresserna för Ethernet eller Wi-Fi som lagras i Intune används. Beroende på det valda alternativet läses endast Ethernet- eller Wi-Fi MAC-adresserna eller en av dem medan den första prioriteras (dvs. den andra adressen används endast om den första adressen är tom).

source: Locations
sv: Platser
tr: Konumlar

source: In Veyon all computers are grouped into locations (rooms). To properly group the devices read from Entra ID, a suitable mapping mode needs to be chosen:
sv: I Veyon är alla datorer grupperade i platser (rum). För att korrekt gruppera de enheter som läses från Entra ID måste ett lämpligt mappningsläge väljas:
tr: Veyon'da tüm bilgisayarlar konumlara (odalara) gruplandırılmıştır. Entra ID'den okunan cihazları düzgün bir şekilde gruplandırmak için uygun bir eşleme modu seçilmelidir:

source: Use device groups
sv: Använd enhetsgrupper
tr: Cihaz gruplarını kullan
