Repository: veyon/docs
Catalog: locale/*/LC_MESSAGES/addons.po
Languages: sv, tr

source: All commercial addons for Veyon require a valid license. A license is valid for a specific addon and a certain installation ID. The unique installation ID is created upon the first installation of Veyon and is part of the program configuration. You should never change the installation ID e.g. by editing the configuration JSON file since this will make your licensed addons not work any longer.
sv: Alla kommersiella tillägg för Veyon kräver en giltig licens. En licens är giltig för ett visst tillägg och ett visst installations-ID. Det unika installations-ID:t skapas vid den första installationen av Veyon och är en del av programkonfigurationen. Du bör aldrig ändra installations-ID:t, t.ex. genom att redigera JSON-filen för konfigurationen, eftersom det gör att dina licensierade tillägg inte fungerar längre.
tr: Veyon için tüm ticari eklentiler geçerli bir lisans gerektirir. Bir lisans belirli bir eklenti ve belirli bir kurulum kimliği için geçerlidir. Benzersiz kurulum kimliği, Veyon'un ilk kurulumunda oluşturulur ve program yapılandırmasının bir parçasıdır. Kurulum kimliğini asla değiştirmemelisiniz, örneğin yapılandırma JSON dosyasını düzenleyerek, çünkü bu lisanslı eklentilerinizin artık çalışmamasına neden olur.

source: Installing a license
sv: Installera en licens
tr: Lisans kurulumu

source: After having received one or multiple license files they can be installed through the :guilabel:`Licensing` configuration page in the Veyon Configurator. Click on the :guilabel:`+` button to select the license file and import it. After a successful import the licenses and additional information show up in the table. Click on the :guilabel:`Apply` button to save the imported licenses permanently.
sv: När du har fått en eller flera licensfiler kan de installeras via konfigurationssidan :guilabel:`Licensing` i Veyon Configurator. Klicka på knappen :guilabel:`+` för att välja licensfilen och importera den. Efter en lyckad import visas licenserna och ytterligare information i tabellen. Klicka på knappen :guilabel:`Apply` för att spara de importerade licenserna permanent.
tr: Bir veya birden fazla lisans dosyası aldıktan sonra, Veyon Configurator'daki :guilabel:`Licensing` yapılandırma sayfası aracılığıyla kurulabilirler. Lisans dosyasını seçmek ve içe aktarmak için :guilabel:`+` düğmesine tıklayın. Başarılı bir içe aktarmadan sonra lisanslar ve ek bilgiler tabloda gösterilir. İçe aktarılan lisansları kalıcı olarak kaydetmek için :guilabel:`Apply` düğmesine tıklayın.

source: In order to access the licensed addons you have to restart all Veyon-related program components. Usually restarting the Veyon Configurator is sufficient since you'll first have to configure the new addons anyway.
sv: För att få tillgång till de licensierade tilläggen måste du starta om alla Veyon-relaterade programkomponenter. Vanligtvis räcker det med att starta om Veyon Configurator eftersom du ändå först måste konfigurera de nya tilläggen.
tr: Lisanslı eklentilere erişmek için Veyon ile ilgili tüm program bileşenlerini yeniden başlatmanız gerekir. Genellikle Veyon Configurator'ı yeniden başlatmak yeterlidir çünkü önce yeni eklentileri yapılandırmanız gerekecektir.

source: Transferring installed licenses to other computers
sv: Överföring av installerade licenser till andra datorer
tr: Yüklü lisansların diğer bilgisayarlara aktarılması

source: If you want to use Veyon Master with the addons on other computers, you have to transfer the licenses to them. You can easily do this by exporting the configuration on the computer on which you imported the licenses. The exported configuration then contains both the installation ID and the imported licenses. It can be imported on all client computers as desired. See chapter :ref:`ConfImportExport` in the administrator manual for details.
sv: Om du vill använda Veyon Master med tillägg på andra datorer måste du överföra licenserna till dem. Det gör du enkelt genom att exportera konfigurationen på den dator som du importerade licenserna till. Den exporterade konfigurationen innehåller då både installations-ID och de importerade licenserna. Den kan importeras på alla klientdatorer om så önskas. Se kapitel :ref:`ConfImportExport` i administratörshandboken för mer information.
tr: Veyon Master'ı eklentilerle diğer bilgisayarlarda kullanmak istiyorsanız, lisansları onlara aktarmanız gerekir. Bunu, lisansları içe aktardığınız bilgisayardaki yapılandırmayı dışa aktararak kolayca yapabilirsiniz. Dışa aktarılan yapılandırma daha sonra hem kurulum kimliğini hem de içe aktarılan lisansları içerir. İstenildiği takdirde tüm istemci bilgisayarlara içe aktarılabilir. Ayrıntılar için yönetici kılavuzundaki :ref:`ConfImportExport` bölümüne bakın.

source: Command line interface
sv: Kommandoradsgränssnitt
tr: Komut satırı arayüzü

source: There's a CLI module ``licensing`` which allows managing licenses at the command line:
sv: Det finns en CLI-modul ``licensing`` som gör det möjligt att hantera licenser på kommandoraden:
tr: Lisansları komut satırından yönetmeye olanak sağlayan ``licensing`` adında bir CLI modülü var:

source: This command imports the license in the given file into the local configuration.
sv: Detta kommando importerar licensen i den angivna filen till den lokala konfigurationen.
tr: Bu komut belirtilen dosyadaki lisansı yerel yapılandırmaya aktarır.

source: This command shows details on all installed licenses.
sv: Detta kommando visar detaljer om alla installerade licenser.
tr: Bu komut yüklü tüm lisansların ayrıntılarını gösterir.

source: This command removes the license with the specified ID.
sv: Detta kommando tar bort licensen med det angivna ID:t.
tr: Bu komut belirtilen kimliğe sahip lisansı kaldırır.

source: Network Discovery
sv: Upptäckt av nätverk
tr: Ağ Tarama

source: The Veyon Network Discovery add-on extends Veyon Master to scan configured networks for computers running one or multiple Veyon Server instances. All discovered computers and RDP sessions show up instantly in the Locations & computers panel. Once set up, computers and locations no longer have to be maintained in the builtin network object directory nor does the LDAP/ActiveDirectory integration have to be configured. Last but not least, the add-on is perfectly suited for DHCP-based networks where the IP addresses of the computers are constantly changing.
sv: Tilläggsprogrammet Veyon Network Discovery utökar Veyon Master så att det kan skanna konfigurerade nätverk efter datorer som kör en eller flera Veyon Server-instanser. Alla upptäckta datorer och RDP-sessioner visas direkt i panelen Platser och datorer. När de väl har konfigurerats behöver datorer och platser inte längre underhållas i den inbyggda nätverksobjektkatalogen och inte heller behöver LDAP/ActiveDirectory-integrationen konfigureras. Sist men inte minst är tillägget perfekt lämpat för DHCP-baserade nätverk där datorernas IP-adresser ständigt ändras.
tr: Veyon Network Discovery eklentisi, Veyon Master'ı, bir veya birden fazla Veyon Server örneği çalıştıran bilgisayarlar için yapılandırılmış ağları tarayacak şekilde genişletir. Keşfedilen tüm bilgisayarlar ve RDP oturumları, Konumlar ve bilgisayarlar panelinde anında gösterilir. Kurulduktan sonra, bilgisayarlar ve konumlar artık yerleşik ağ nesnesi dizininde tutulmak zorunda değildir ve LDAP/ActiveDirectory entegrasyonunun yapılandırılması gerekmez. Son olarak, eklenti, bilgisayarların IP adreslerinin sürekli değiştiği DHCP tabanlı ağlar için mükemmel şekilde uygundur.

source: After the installation has completed, you'll see some new configuration pages in the Veyon Configurator program. One of them is called :guilabel:`Network discovery` and allows to set up the add-on:
sv: När installationen har slutförts kommer du att se några nya konfigurationssidor i Veyon Configurator-programmet. En av dem heter :guilabel:`Network discovery` och gör det möjligt att konfigurera tillägget:
tr: Kurulum tamamlandıktan sonra, Veyon Configurator programında bazı yeni yapılandırma sayfaları göreceksiniz. Bunlardan biri :guilabel:`Ağ tarama` olarak adlandırılır ve eklentinin kurulmasına izin verir:

source: Network Discovery configuration page
sv: Konfigurationssida för Network Discovery
tr: Ağ Tarama yapılandırma sayfası

source: You can start with the default settings if the subnet of the computer is small enough, i.e. the IPv4 prefix is ``/24`` or the subnet mask is ``255.255.255.0``. For larger subnets it's recommended to change the mode to :guilabel:`Scan network ranges` and add a group with a network range for testing (adopt the IP addresses to your environment):
sv: Du kan börja med standardinställningarna om datorns subnät är tillräckligt litet, dvs. om IPv4-prefixet är ``/24`` eller subnätmasken är ``255.255.255.0``. För större subnät rekommenderas att du ändrar läget till :guilabel:`Scan network ranges` och lägger till en grupp med ett nätverksintervall för testning (anpassa IP-adresserna till din miljö):
tr: Bilgisayarın alt ağı yeterince küçükse, yani IPv4 öneki ``/24`` veya alt ağ maskesi ``255.255.255.0`` ise, varsayılan ayarlarla başlayabilirsiniz. Daha büyük alt ağlar için modu :guilabel:`Ağ aralıklarını tara` olarak değiştirmeniz ve test için bir ağ aralığına sahip bir grup eklemeniz önerilir (IP adreslerini ortamınıza uyarlayın):

source: Only scan subnet of larger network
sv: Skanna bara delnät i ett större nätverk
tr: Yalnızca daha büyük ağın alt ağını tara

source: Finally, the network object directory backend needs to be changed to *Network discovery* so that Veyon Master actually uses the Network Discovery add-on.
sv: Slutligen måste backend för Network Object Directory ändras till *Network discovery* så att Veyon Master faktiskt använder tillägget Network Discovery.
tr: Son olarak, Veyon Master'ın Ağ Keşfi eklentisini kullanabilmesi için ağ nesnesi dizini arka ucunun *Ağ tarama* olarak değiştirilmesi gerekiyor.

source: Change network object directory backend to Network Discovery
sv: Ändra backend för nätverksobjektkatalog till Network Discovery
tr: Ağ nesnesi dizini arka ucunu Ağ Tarama olarak değiştirin

source: Now you can start Veyon Master and should see the computers in your network running a Veyon Server. Depending on the size of the subnet or network range(s), the initial scan process might take a while (up to 1-2 minutes in the worst case).
sv: Nu kan du starta Veyon Master och bör se de datorer i ditt nätverk som kör en Veyon Server. Beroende på storleken på subnätet eller nätverksområdet kan den inledande skanningsprocessen ta en stund (upp till 1-2 minuter i värsta fall).
tr: Şimdi Veyon Master'ı başlatabilir ve ağınızdaki bilgisayarların Veyon Server çalıştırdığını görmelisiniz. Alt ağın veya ağ aralığının boyutuna bağlı olarak, ilk tarama işlemi biraz zaman alabilir (en kötü durumda 1-2 dakikaya kadar).

source: Options
sv: Alternativ
tr: Seçenekler

source: After you have configured the desired subnets or network ranges, you can start tweaking the options for scanning computers to decrease the initial scan duration.
sv: När du har konfigurerat de önskade undernäten eller nätverksintervallen kan du börja justera alternativen för att skanna datorer för att minska den inledande skanningstiden.
tr: İstediğiniz alt ağları veya ağ aralıklarını yapılandırdıktan sonra, ilk tarama süresini azaltmak için bilgisayarları tarama seçeneklerini ayarlamaya başlayabilirsiniz.

source: In most cases you can increase the number of :guilabel:`parallel scans` to 100–300. Veyon Master opens the specified number of TCP connections in parallel so make sure to not exhaust the resources of the computer or per-process resource limits set by the operating system.
sv: I de flesta fall kan du öka antalet :guilabel:`parallella skanningar` till 100-300. Veyon Master öppnar det angivna antalet TCP-anslutningar parallellt, så se till att inte överskrida datorns resurser eller de resursgränser per process som operativsystemet har ställt in.
tr: Çoğu durumda :guilabel:`paralel taramaların` sayısını 100–300'e çıkarabilirsiniz. Veyon Master belirtilen sayıda TCP bağlantısını paralel olarak açar, bu nedenle bilgisayarın kaynaklarını veya işletim sistemi tarafından ayarlanan işlem başına kaynak sınırlarını tüketmediğinizden emin olun.

source: If all computers are on the same LAN (i.e. ping times of usually less than 1 ms) you can also decrease the :guilabel:`scan timeout` to 25–100 ms. Each computer responding within that timeout is shown in Veyon Master.
sv: Om alla datorer är på samma LAN (dvs. pingtiderna är vanligtvis mindre än 1 ms) kan du också minska :guilabel:`scan timeout` till 25-100 ms. Varje dator som svarar inom den tidsgränsen visas i Veyon Master.
tr: Tüm bilgisayarlar aynıYerel ağ üzerindeyse (yani ping süreleri genellikle 1 ms'den azsa) :guilabel:`tarama zaman aşımını` 25–100 ms'ye düşürebilirsiniz. Bu zaman aşımı süresi içinde yanıt veren her bilgisayar Veyon Master'da gösterilir.

source: With a scan timeout of 25 ms and 250 parallel scans Veyon is able to scan ``25*250=6250`` computers per second. Using this formula you can easily calculate the ideal settings for your environment such that Veyon Master does not require too long for scanning while still detecting all computers reliably.
sv: Med en timeout på 25 ms och 250 parallella skanningar kan Veyon skanna ``25*250=6250`` datorer per sekund. Med hjälp av denna formel kan du enkelt beräkna de perfekta inställningarna för din miljö så att Veyon Master inte behöver för lång tid för att skanna samtidigt som alla datorer upptäcks på ett tillförlitligt sätt.
tr: 25 ms tarama zaman aşımı ve 250 paralel tarama ile Veyon saniyede ``25*250=6250`` bilgisayarı tarayabilir. Bu formülü kullanarak, Veyon Master'ın tüm bilgisayarları güvenilir bir şekilde algılarken tarama için çok uzun süre gerektirmemesi için ortamınız için ideal ayarları kolayca hesaplayabilirsiniz.

source: Sessions
sv: Sessioner
tr: Oturumlar

source: One typical use case of the Network Discovery add-on are environments with remote desktop servers running sessions which should be monitored using Veyon. Since these sessions are dynamic, it's hard to use statically configured hosts (even though optional port numbers can be specified). Instead you can simply enable the option :guilabel:`Scan sessions on all computers` and specify a limit – typically the maximum number of concurrent sessions on the server. Optionally it's possible to exclude the first session since often it's the local console session of the server at which only administrators log in or the primary login screen is visible.
sv: Ett typiskt användningsområde för tillägget Network Discovery är miljöer med fjärrskrivbordsservrar som kör sessioner som bör övervakas med Veyon. Eftersom dessa sessioner är dynamiska är det svårt att använda statiskt konfigurerade värdar (även om valfria portnummer kan anges). Istället kan du helt enkelt aktivera alternativet :guilabel:`Skanna sessioner på alla datorer` och ange en gräns - vanligtvis det maximala antalet samtidiga sessioner på servern. Det går också att utesluta den första sessionen eftersom det ofta är den lokala konsolsessionen på servern där endast administratörer loggar in eller den primära inloggningsskärmen är synlig.
tr: Ağ Tarama eklentisinin tipik bir kullanım örneği, Veyon kullanılarak izlenmesi gereken oturumları çalıştıran uzak masaüstü sunucularının bulunduğu ortamlardır. Bu oturumlar dinamik olduğundan, statik olarak yapılandırılmış ana bilgisayarları kullanmak zordur (isteğe bağlı bağlantı noktası numaraları belirtilebilmesine rağmen). Bunun yerine, basitçe :guilabel:`Tüm bilgisayarlarda oturumları tara` seçeneğini etkinleştirebilir ve bir sınır belirleyebilirsiniz - genellikle sunucudaki maksimum eşzamanlı oturum sayısı. İsteğe bağlı olarak, genellikle yalnızca yöneticilerin oturum açtığı veya birincil oturum ekranının göründüğü sunucunun yerel konsol oturumu olduğundan ilk oturumu hariç tutmak mümkündür.

source: Computer names
sv: Namn på datorer
tr: Bilgisayar isimleri

source: On Windows, legacy WINS resolution via NetBIOS should be disabled to prevent issues where the NetBIOS hostname does not exactly match the DNS hostname (especially since NetBIOS hostnames always consist of uppercase letters only while the actual DNS hostnames usually do not). If NetBIOS is enabled, Network Discovery may obtain randomly changing hostname types (for a certain IP address) from the operating system on each scan/update. This causes constant reconnects to the computers since from the view of Veyon, a different computer has been discovered each time.
sv: I Windows bör äldre WINS-upplösning via NetBIOS inaktiveras för att förhindra problem där NetBIOS-värdnamnet inte exakt matchar DNS-värdnamnet (särskilt eftersom NetBIOS-värdnamn alltid bara består av versaler medan de faktiska DNS-värdnamnen vanligtvis inte gör det). Om NetBIOS är aktiverat kan Network Discovery få slumpmässigt ändrade värdnamnstyper (för en viss IP-adress) från operativsystemet vid varje skanning/uppdatering. Detta orsakar ständiga återanslutningar till datorerna eftersom Veyon ser det som att en ny dator har upptäckts varje gång.
tr: Windows'ta, NetBIOS ana bilgisayar adının DNS ana bilgisayar adıyla tam olarak eşleşmediği sorunları önlemek için NetBIOS üzerinden eski WINS çözümlemesi devre dışı bırakılmalıdır (özellikle NetBIOS ana bilgisayar adları her zaman yalnızca büyük harflerden oluşurken gerçek DNS ana bilgisayar adları genellikle büyük harflerden oluşmadığından). NetBIOS etkinleştirilirse, Ağ Tarama her tarama/güncellemede işletim sisteminden rastgele değişen ana bilgisayar adı türlerini (belirli bir IP adresi için) alabilir. Bu, Veyon'un bakış açısından her seferinde farklı bir bilgisayar keşfedildiği için bilgisayarlara sürekli yeniden bağlanmalara neden olur.

source: Per default Network Discovery tries to perform DNS reverse lookups to determine the hostnames corresponding to the discovered IP addresses. If computers are not known to your DNS servers there are several other ways to achieve human-readable computer names, especially in remote desktop scenarios:
sv: Som standard försöker Network Discovery utföra omvända DNS-uppslagningar för att fastställa vilka värdnamn som motsvarar de upptäckta IP-adresserna. Om DNS-servrarna inte känner till datorerna finns det flera andra sätt att få fram läsbara datornamn, särskilt i fjärrskrivbordsscenarier:
tr: Varsayılan olarak Ağ Tarama, taranan IP adreslerine karşılık gelen ana bilgisayar adlarını belirlemek için DNS ters aramaları gerçekleştirmeye çalışır. Bilgisayarlar DNS sunucularınız tarafından bilinmiyorsa, özellikle uzak masaüstü senaryolarında, insan tarafından okunabilir bilgisayar adlarına ulaşmanın birkaç başka yolu daha vardır:

source: User login name / Full name of user
sv: Användarens inloggningsnamn / Användarens fullständiga namn
tr: Kullanıcı oturum açma adı / Kullanıcının tam adı

source: Select one of these options to use the login or full name of the logged in user as computer name.
sv: Välj ett av dessa alternativ för att använda inloggningen eller det fullständiga namnet på den inloggade användaren som datornamn.
tr: Oturum açan kullanıcının oturum açma adını veya tam adını bilgisayar adı olarak kullanmak için bu seçeneklerden birini seçin.

source: Session client name / Session client address
sv: Sessionsklientens namn / Sessionsklientens adress
tr: Oturum istemcisi adı / Oturum istemcisi adresi

source: Select one of these options to use the name or address of the client (i.e. the workstation or thin client connected to the discovered remote desktop session) as computer name.
sv: Välj ett av dessa alternativ om du vill använda klientens namn eller adress (dvs. den arbetsstation eller tunna klient som är ansluten till den upptäckta fjärrskrivbordssessionen) som datornamn.
tr: Bilgisayar adı olarak istemcinin adını veya adresini (yani keşfedilen uzak masaüstü oturumuna bağlı iş istasyonunu veya ince istemciyi) kullanmak için bu seçeneklerden birini seçin.

source: Hostname of session host
sv: Värdnamn för sessionens värd
tr: Oturum ana bilgisayarının ana bilgisayar adı

source: Select this option to use the hostname of the remote desktop server (which is hosting the discovered remote desktop session) as computer name.
sv: Välj det här alternativet om du vill använda värdnamnet på fjärrskrivbordsservern (som är värd för den upptäckta fjärrskrivbordssessionen) som datornamn.
tr: Uzak masaüstü sunucusunun (taranan uzak masaüstü oturumunu barındıran) ana bilgisayar adını bilgisayar adı olarak kullanmak için bu seçeneği seçin.

source: Environment variable
sv: Miljövariabel
tr: Ortam değişkeni

source: Select this option to use the value of a certain environment variable in the user session as computer name. The name of the environment variable has to be specified.
sv: Välj det här alternativet om du vill använda värdet för en viss miljövariabel i användarsessionen som datornamn. Namnet på miljövariabeln måste anges.
tr: Kullanıcı oturumunda belirli bir ortam değişkeninin değerini bilgisayar adı olarak kullanmak için bu seçeneği belirleyin. Ortam değişkeninin adı belirtilmelidir.

source: Registry key
sv: Registernyckel
tr: Kayıt anahtarı

source: Select this option to use the value of a registry key as computer name. The registry is read in the context of the logged in user so either a key in ``HKEY_CURRENT_USER`` or any other globally readable key can be read from.
sv: Välj detta alternativ om du vill använda värdet på en registernyckel som datornamn. Registret läses i kontexten för den inloggade användaren, så antingen en nyckel i ``HKEY_CURRENT_USER`` eller någon annan globalt läsbar nyckel kan läsas från.
tr: Bir kayıt defteri anahtarının değerini bilgisayar adı olarak kullanmak için bu seçeneği seçin. Kayıt defteri, oturum açmış kullanıcının bağlamında okunur, bu nedenle ``HKEY_CURRENT_USER`` içindeki bir anahtardan veya küresel olarak okunabilen herhangi bir anahtardan okunabilir.

source: For all data sources except for :guilabel:`IP address` and :guilabel:`DNS name` Network Discovery establishes temporary connections to all discovered computers to obtain the configured property. This slows down the scanning process and sligtly increases CPU load on the hosts while being scanned.
sv: För alla datakällor utom :guilabel:`IP-adress` och :guilabel:`DNS-namn` upprättar Network Discovery tillfälliga anslutningar till alla upptäckta datorer för att hämta den konfigurerade egenskapen. Detta saktar ned genomsökningsprocessen och ökar något CPU-belastningen på de värddatorer som genomsöks.
tr: :guilabel:`IP adresi` ve :guilabel:`DNS adı` hariç tüm veri kaynakları için Ağ Tarama, yapılandırılmış özelliği elde etmek için keşfedilen tüm bilgisayarlara geçici bağlantılar kurar. Bu, tarama sürecini yavaşlatır ve taranırken ana bilgisayarlardaki CPU yükünü hafifçe artırır.

source: Optionally computers whose names can't be resolved can be excluded from being shown in Veyon Master.
sv: Som tillval kan datorer vars namn inte kan lösas uteslutas från att visas i Veyon Master.
tr: İsteğe bağlı olarak isimleri çözülemeyen bilgisayarlar Veyon Master'da gösterilmekten hariç tutulabilir.
