Repository: veyon/docs
Catalog: locale/*/LC_MESSAGES/addons.po
Languages: sv, tr

source: Select this mode if your devices belong to (security) groups which correspond to locations. This is the most preferred way since in Entra ID it's quite easy to create groups for each room and add the devices to the corresponding groups. Most likely you will have to configure a suitable :guilabel:`Device groups filter` in the :guilabel:`Filters` section such that only these groups (e.g. starting with name ``Room``) are displayed as locations. Optionally you can configure the name of the group attribute which to use as location name. Per default the group's display name is used.
sv: Välj det här läget om dina enheter tillhör (säkerhets)grupper som motsvarar platser. Detta är det mest föredragna sättet eftersom det i Entra ID är ganska enkelt att skapa grupper för varje rum och lägga till enheterna i motsvarande grupper. Troligtvis måste du konfigurera ett lämpligt :guilabel:`Device groups filter` i avsnittet :guilabel:`Filters` så att endast dessa grupper (t.ex. som börjar med namnet ``Room``) visas som platser. Alternativt kan du konfigurera namnet på gruppattributet som ska användas som platsnamn. Som standard används gruppens visningsnamn.
tr: Cihazlarınız konumlara karşılık gelen (güvenlik) gruplarına aitse bu modu seçin. Bu en çok tercih edilen yoldur çünkü Entra ID'de her oda için grup oluşturmak ve cihazları ilgili gruplara eklemek oldukça kolaydır. Büyük olasılıkla :guilabel:`Filtreler` bölümünde uygun bir :guilabel:`Cihaz grupları filtresi` yapılandırmanız gerekecektir, böylece yalnızca bu gruplar (örneğin ``Oda`` adıyla başlayanlar) konum olarak görüntülenir. İsteğe bağlı olarak konum adı olarak kullanılacak grup niteliğinin adını yapılandırabilirsiniz. Varsayılan olarak grubun görüntü adı kullanılır.

source: Use location attribute of device
sv: Använd enhetens platsattribut
tr: Cihazın konum özelliğini kullan

source: As an alternative to location-based groups, the location of each computer can also be stored in an (extension) attribute. In this case, the name of this attribute must be specified.
sv: Som ett alternativ till platsbaserade grupper kan platsen för varje dator också lagras i ett attribut (extension). I så fall måste namnet på detta attribut anges.
tr: Konum tabanlı gruplara alternatif olarak, her bilgisayarın konumu bir (uzantı) özniteliğinde de saklanabilir. Bu durumda, bu özniteliğin adı belirtilmelidir.

source: Extract from hostname via regular expression
sv: Extrahera från värdnamn via reguljärt uttryck
tr: Düzenli ifade yoluyla ana bilgisayar adından çıkar

source: If the hostnames contain the room or location name, you can let Entra ID Connector extract the location name. This is done by applying a regular expression on the hostnames. The first capture group of the regular expression is then used as location / computer name.
sv: Om värdnamnen innehåller rummets eller platsens namn kan du låta Entra ID Connector extrahera platsnamnet. Detta görs genom att tillämpa ett reguljärt uttryck på värdnamnen. Den första fångstgruppen i det reguljära uttrycket används sedan som plats-/datornamn.
tr: Ana bilgisayar adları oda veya konum adını içeriyorsa, Entra ID Connector'ın konum adını çıkarmasına izin verebilirsiniz. Bu, ana bilgisayar adlarına düzenli bir ifade uygulanarak yapılır. Düzenli ifadenin ilk yakalama grubu daha sonra konum / bilgisayar adı olarak kullanılır.

source: For example, if the hostnames have the format ``r<ROOM-NUMBER>-c<COMPUTER-NUMBER>`` (e.g. ``r101-c01.example.org``), you can use the following regular expression to extract the location name:
sv: Om värdnamnen t.ex. har formatet ``r<ROOM-NUMBER>-c<COMPUTER-NUMBER>`` (t.ex. ``r101-c01.example.org``) kan du använda följande reguljära uttryck för att extrahera platsnamnet:
tr: Örneğin, ana bilgisayar adları ``r<ROOM-NUMBER>-c<COMPUTER-NUMBER>`` biçimindeyse (ör. ``r101-c01.example.org``), konum adını çıkarmak için aşağıdaki normal ifadeyi kullanabilirsiniz:

source: The first capture (in braces) captures everything until the first minus sign, so the location displayed in Veyon Master will be ``r101``.
sv: Den första fångsten (inom parentes) fångar allt fram till det första minustecknet, så platsen som visas i Veyon Master kommer att vara ``r101``.
tr: İlk yakalama (parantez içinde) ilk eksi işaretine kadar her şeyi yakalar, dolayısıyla Veyon Master'da gösterilen konum ``r101`` olacaktır.

source: Please refer to the `Wikipedia article on regular expressions <https://en.wikipedia.org/wiki/Regular_expression>`_ for more information on the concept, syntax and available pattern options.
sv: Se Wikipediaartikeln om reguljära uttryck <https://en.wikipedia.org/wiki/Regular_expression>`_ för mer information om konceptet, syntaxen och tillgängliga mönsteralternativ.
tr: Kavram, söz dizimi ve kullanılabilir desen seçenekleri hakkında daha fazla bilgi için lütfen `Düzenli ifadeler hakkındaki Vikipedia makalesine <https://tr.wikipedia.org/wiki/Düzenli_ifade>`_ bakın.

source: Completion
sv: Slutfört
tr: Tamamlama

source: Finally, the network object directory backend needs to be changed to *Entra ID Connector* so that Veyon Master actually uses the Entra ID Connector add-on.
sv: Slutligen måste backend för Network Object Directory ändras till *Entra ID Connector* så att Veyon Master faktiskt använder Entra ID Connector-tillägget.
tr: Son olarak, Veyon Master'ın Entra ID Connector eklentisini kullanabilmesi için ağ nesnesi dizini arka ucunun *Entra ID Connector* olarak değiştirilmesi gerekiyor.

source: Change network object directory backend to Entra ID Connector
sv: Ändra backend för nätverksobjektkatalog till Entra ID Connector
tr: Ağ nesnesi dizini arka ucunu Entra ID Bağlayıcısına değiştirin

source: Now you can start Veyon Master and should see the locations and computers from your Entra ID directory.
sv: Nu kan du starta Veyon Master och bör se platserna och datorerna från din Entra ID-katalog.
tr: Artık Veyon Master'ı başlatabilir ve Entra ID dizininizdeki konumları ve bilgisayarları görmelisiniz.

source: Due to limitations in the Windows SSP authentication API, it's **not** possible to use Veyon's *logon authentication* with cloud-only Entra ID accounts. Please use *key file authentication* instead or make sure the accounts including password hashes are synced to an On Premise Active Directory.
sv: På grund av begränsningar i Windows SSP-autentiserings-API är det **inte** möjligt att använda Veyons *logon-autentisering* med Entra ID-konton som endast finns i molnet. Använd *nyckelfilautentisering* istället eller se till att kontona inklusive lösenordshashar synkroniseras med en lokal Active Directory.
tr: Windows SSP kimlik doğrulama API'sindeki sınırlamalar nedeniyle, Veyon'un *oturum açma kimlik doğrulamasını* yalnızca bulut Entra ID hesaplarıyla kullanmak **mümkün** değildir. Lütfen bunun yerine *anahtar dosyası kimlik doğrulamasını* kullanın veya parola karmaları içeren hesapların bir On Premise Active Directory ile senkronize edildiğinden emin olun.

source: Internet Access Control
sv: Kontroll av internetåtkomst
tr: İnternet Erişim Kontrolü

source: The Veyon Internet Access Control add-on allows blocking the access to the Internet for the whole class or individual computers in situations such as exams. The Internet access is blocked client-side by using mechanisms provided by the different backends.
sv: Veyons tilläggsprogram Internet Access Control gör det möjligt att blockera åtkomsten till Internet för hela klassen eller enskilda datorer i situationer som t.ex. tentor. Internetåtkomsten blockeras på klientsidan med hjälp av mekanismer som tillhandahålls av olika backends.
tr: Veyon İnternet Erişim Kontrolü eklentisi, sınavlar gibi durumlarda tüm sınıfın veya bireysel bilgisayarların İnternet erişimini engellemeye olanak tanır. İnternet erişimi, farklı arka uçlar tarafından sağlanan mekanizmalar kullanılarak istemci tarafında engellenir.

source: After the installation has completed, you'll see some new configuration pages in the Veyon Configurator program. One of them is called :guilabel:`Internet access control` and allows to set up the add-on:
sv: Efter att installationen har slutförts kommer du att se några nya konfigurationssidor i Veyon Configurator-programmet. En av dem heter :guilabel:`Internet access control` och gör det möjligt att konfigurera tillägget:
tr: Kurulum tamamlandıktan sonra, Veyon Configurator programında bazı yeni yapılandırma sayfaları göreceksiniz. Bunlardan biri :guilabel:`İnternet erişim kontrolü` olarak adlandırılır ve eklentiyi kurmanıza olanak tanır:

source: Internet Access Control configuration page
sv: Konfigurationssida för Internet Access Control
tr: İnternet Erişim Kontrolü yapılandırma sayfası

source: In most cases you can leave the default settings and continue with deploying the add-on to the student computers.
sv: I de flesta fall kan du behålla standardinställningarna och fortsätta med att distribuera tillägget till studentdatorerna.
tr: Çoğu durumda varsayılan ayarları bırakıp eklentiyi öğrenci bilgisayarlarına dağıtmaya devam edebilirsiniz.

source: If you make changes to the configuration, remember to always deploy the updated configuration to the student computers! Only the client-side settings affect the way the Internet access is blocked on the clients.
sv: Om du gör ändringar i konfigurationen, kom ihåg att alltid distribuera den uppdaterade konfigurationen till studentdatorerna! Det är bara inställningarna på klientsidan som påverkar hur internetåtkomsten blockeras på klienterna.
tr: Yapılandırmada değişiklik yaparsanız, güncellenen yapılandırmayı her zaman öğrenci bilgisayarlarına dağıtmayı unutmayın! Yalnızca istemci tarafı ayarları, istemcilerde İnternet erişiminin engellenme biçimini etkiler.

source: Now you can start Veyon Master and can click the :guilabel:`Internet access` button to open the menu with the :guilabel:`Block Internet access` and :guilabel:`Unblock Internet access` items. After activating the :guilabel:`Block Internet access` item, the users on the selected computer(s) no longer should be able to open a website on the Internet. If they still are, please check the settings and possibly try another blocking mode or backend.
sv: Nu kan du starta Veyon Master och klicka på knappen :guilabel:`Internetåtkomst` för att öppna menyn med posterna :guilabel:`Blockera Internetåtkomst` och :guilabel:`Avblockera Internetåtkomst`. När du har aktiverat alternativet :guilabel:`Block Internet access` ska användarna på den eller de valda datorerna inte längre kunna öppna en webbplats på Internet. Om de fortfarande gör det, kontrollera inställningarna och prova eventuellt ett annat blockeringsläge eller backend.
tr: Şimdi Veyon Master'ı başlatabilir ve :guilabel:`İnternet erişimi` düğmesine tıklayarak :guilabel:`İnternet erişimini engelle` ve :guilabel:`İnternet erişimini engelle` öğelerinin bulunduğu menüyü açabilirsiniz. :guilabel:`İnternet erişimini engelle` öğesini etkinleştirdikten sonra, seçili bilgisayar(lar)daki kullanıcılar artık İnternet'te bir web sitesi açamazlar. Hala açabiliyorlarsa lütfen ayarları kontrol edin ve muhtemelen başka bir engelleme modu veya arka uç deneyin.

source: There are currently two backends providing different mechanisms to block the Internet access. Both backends are described in the following subsections.
sv: Det finns för närvarande två backends som tillhandahåller olika mekanismer för att blockera Internetåtkomst. Båda backends beskrivs i följande underavsnitt.
tr: Şu anda İnternet erişimini engellemek için farklı mekanizmalar sağlayan iki arka uç bulunmaktadır. Her iki arka uç da aşağıdaki alt bölümlerde açıklanmıştır.

source: Block internet access via system firewall
sv: Blockera internetåtkomst via systemets brandvägg
tr: Sistem güvenlik duvarı ile internet erişimini engelle

source: This is the standard backend that should preferably be used, as it offers the most flexibility and works most reliably. When this backend is used, the Veyon Service makes changes to the system firewall to block Internet access. There are platform-specific differences here:
sv: Detta är den standardbackend som helst ska användas, eftersom den erbjuder mest flexibilitet och fungerar mest tillförlitligt. När denna backend används gör Veyon-tjänsten ändringar i systemets brandvägg för att blockera internetåtkomst. Det finns plattformsspecifika skillnader här:
tr: Bu, en fazla esnekliği sunduğu ve en güvenilir şekilde çalıştığı için tercihen kullanılması gereken standart arka uçtur. Bu arka uç kullanıldığında, Veyon Hizmeti İnternet erişimini engellemek için sistem güvenlik duvarında değişiklikler yapar. Burada platforma özgü farklılıklar vardır:

source: Windows
sv: Fönster

source: Veyon controls the integrated Windows firewall and makes temporary changes to its configuration. This means that the Windows firewall must be activated. In addition, changes to the configuration of the Windows firewall must not be prevented by group policies.
sv: Veyon kontrollerar den integrerade Windows-brandväggen och gör tillfälliga ändringar i dess konfiguration. Detta innebär att Windows-brandväggen måste vara aktiverad. Dessutom får ändringar av konfigurationen av Windows-brandväggen inte förhindras av grupprinciper.
tr: Veyon, entegre Windows güvenlik duvarını kontrol eder ve yapılandırmasında geçici değişiklikler yapar. Bu, Windows güvenlik duvarının etkinleştirilmesi gerektiği anlamına gelir. Ayrıca, Windows güvenlik duvarının yapılandırmasındaki değişiklikler grup politikaları tarafından engellenmemelidir.

source: Veyon works on the basis of *nftables* and calls the related command line tool ``nft``. This is used to temporarily add additional rules to block Internet access.
sv: Veyon arbetar med *nftables* och anropar det relaterade kommandoradsverktyget ``nft``. Detta används för att tillfälligt lägga till ytterligare regler för att blockera Internetåtkomst.
tr: Veyon, *nftables* temelinde çalışır ve ilgili komut satırı aracını ``nft`` olarak çağırır. Bu, İnternet erişimini engellemek için geçici olarak ek kurallar eklemek için kullanılır.

source: For both operating systems, the backend configuration is identical. In general different modes are available. The mode selection depends on the network environment and the desired blocking behavior.
sv: För båda operativsystemen är backend-konfigurationen identisk. I allmänhet finns olika lägen tillgängliga. Valet av läge beror på nätverksmiljön och önskat blockeringsbeteende.
tr: Her iki işletim sistemi için de arka uç yapılandırması aynıdır. Genel olarak farklı modlar mevcuttur. Mod seçimi ağ ortamına ve istenen engelleme davranışına bağlıdır.

source: Block all outbound traffic for TCP and UDP ports
sv: Blockera all utgående trafik för TCP- och UDP-portar
tr: TCP ve UDP bağlantı noktaları için tüm giden trafiği engelle

source: This is the default mode and should work in most environments. In this mode the Veyon Service adds special rules to the firewall which block any traffic to the configured ports. Use this mode if blocking the TCP and UDP ports 80/443 and one or multiple custom ports (separated by space) is sufficient. To block all traffic use the second mode.
sv: Detta är standardläget och bör fungera i de flesta miljöer. I det här läget lägger Veyon-tjänsten till särskilda regler i brandväggen som blockerar all trafik till de konfigurerade portarna. Använd det här läget om det räcker att blockera TCP- och UDP-portarna 80/443 och en eller flera anpassade portar (separerade med mellanslag). Om du vill blockera all trafik använder du det andra läget.
tr: Bu varsayılan moddur ve çoğu ortamda çalışmalıdır. Bu modda Veyon Hizmeti, yapılandırılmış portlara giden tüm trafiği engelleyen güvenlik duvarına özel kurallar ekler. TCP ve UDP portları 80/443'ü ve bir veya birden fazla özel portu (boşlukla ayrılmış) engellemek yeterliyse bu modu kullanın. Tüm trafiği engellemek için ikinci modu kullanın.

source: Block all outbound traffic to non-local subnets
sv: Blockera all utgående trafik till icke-lokala subnät
tr: Alt ağlara giden tüm trafiği engelle

source: In this mode, all network traffic directed to networks outside the local subnets is blocked. On Windows, the Veyon service temporarily changes the configuration of all firewall profiles (domain, private, public) to “ Outbound connections that do not match a rule are blocked”. If :guilabel:`Exceptions` are configured, appropriate rules are added to allow access to these networks, hosts or ports. This can be used, for example, to preserve access to the intranet and other internally hosted platforms. External websites can also be defined as exceptions here under certain circumstances, but the addresses of all servers/CDNs from which the website loads resources must then also be specified.
sv: I det här läget blockeras all nätverkstrafik som riktas till nätverk utanför de lokala subnäten. I Windows ändrar Veyon-tjänsten tillfälligt konfigurationen för alla brandväggsprofiler (domän, privat, offentlig) till "Utgående anslutningar som inte matchar en regel blockeras". Om :guilabel:`Undantag` är konfigurerade läggs lämpliga regler till för att tillåta åtkomst till dessa nätverk, värdar eller portar. Detta kan t.ex. användas för att bevara åtkomsten till intranätet och andra internt hostade plattformar. Även externa webbplatser kan under vissa omständigheter definieras som undantag här, men då måste även adresserna till alla servrar/CDN:er från vilka webbplatsen laddar resurser anges.
tr: Bu modda, yerel alt ağların dışındaki ağlara yönlendirilen tüm ağ trafiği engellenir. Windows'ta, Veyon hizmeti tüm güvenlik duvarı profillerinin (etki alanı, özel, genel) yapılandırmasını geçici olarak "Bir kuralla eşleşmeyen giden bağlantılar engellenir" olarak değiştirir. :guilabel:`İstisnalar` yapılandırılırsa, bu ağlara, ana bilgisayarlara veya bağlantı noktalarına erişime izin vermek için uygun kurallar eklenir. Bu, örneğin, intranet ve diğer dahili olarak barındırılan platformlara erişimi korumak için kullanılabilir. Harici web siteleri de belirli koşullar altında burada istisna olarak tanımlanabilir, ancak web sitesinin kaynakları yüklediği tüm sunucuların/CDN'lerin adresleri de belirtilmelidir.

source: Block traffic to (e.g. proxy or DNS) servers
sv: Blockera trafik till servrar (t.ex. proxy- eller DNS-servrar)
tr: (ör. proxy veya DNS) sunucularına giden trafiği engelle

source: If the student computers access the Internet via a proxy server, you can select this option. A firewall rule is then added that simply blocks all traffic to the proxy address. Alternatively, access to certain DNS servers can also be blocked, although in most cases this leads to problems when accessing internal resources such as network drives etc.
sv: Om studentdatorerna har tillgång till Internet via en proxyserver kan du välja det här alternativet. Då läggs en brandväggsregel till som helt enkelt blockerar all trafik till proxyadressen. Alternativt kan även åtkomst till vissa DNS-servrar blockeras, men i de flesta fall leder detta till problem vid åtkomst till interna resurser som nätverksenheter etc.
tr: Öğrenci bilgisayarları bir proxy sunucusu üzerinden İnternet'e erişiyorsa, bu seçeneği seçebilirsiniz. Daha sonra proxy adresine giden tüm trafiği engelleyen bir güvenlik duvarı kuralı eklenir. Alternatif olarak, belirli DNS sunucularına erişim de engellenebilir, ancak çoğu durumda bu, ağ sürücüleri vb. gibi dahili kaynaklara erişirken sorunlara yol açar.

source: Enable preconfigured firewall rule
sv: Aktivera förkonfigurerad brandväggsregel
tr: Önceden yapılandırılmış güvenlik duvarı kurallarını etkinleştir

source: If the three modes above are not suitable for your network you can also configure an own custom rule in the Windows Firewall. This rule should be disabled by default. The Veyon Service will enable this rule while the Internet access is to be blocked. On Linux the Veyon Service calls ``nft`` to load the nftables rules from the file ``/etc/veyon/iac/firewall/rules.d/<RULENAME>``. You can define any nftables rules in this file.
sv: Om de tre lägena ovan inte är lämpliga för ditt nätverk kan du också konfigurera en egen anpassad regel i Windows-brandväggen. Den här regeln ska vara inaktiverad som standard. Veyon-tjänsten aktiverar den här regeln när internetåtkomsten ska blockeras. På Linux anropar Veyon-tjänsten ``nft`` för att ladda nftables-reglerna från filen ``/etc/veyon/iac/firewall/rules.d/<RULENAME>``. Du kan definiera valfria nftables-regler i den här filen.
tr: Yukarıdaki üç mod ağınız için uygun değilse Windows Güvenlik Duvarı'nda kendi özel kuralınızı da yapılandırabilirsiniz. Bu kural varsayılan olarak devre dışı bırakılmalıdır. Veyon Hizmeti, İnternet erişimi engellenirken bu kuralı etkinleştirecektir. Linux'ta Veyon Hizmeti, nftables kurallarını ``/etc/veyon/iac/firewall/rules.d/<RULENAME>`` dosyasından yüklemek için ``nft``'yi çağırır. Bu dosyada herhangi bir nftables kuralı tanımlayabilirsiniz.

source: Block internet access by modifying routing table
sv: Blockera internetåtkomst genom att ändra routingtabellen
tr: Yönlendirme tablosunu değiştirerek internet erişimini engelleyin

source: If the firewall backend cannot be used (e.g. if a 3rdparty firewall software is used instead of the Windows Firewall), you can use this backend as a fallback. It works in a very simple way by temporarily removing the default route from the routing table and/or adding a user-defined (possibly deliberately invalid) route to block Internet access. In any case, the settings should be made carefully so that access to the internal network continues to function properly. Especially in larger segmented networks, both options should be combined by removing the default route on the one hand and adding a route to the internal network on the other.
sv: Om brandväggsbackend inte kan användas (t.ex. om ett brandväggsprogram från tredje part används i stället för Windows-brandväggen) kan du använda den här backend som reservlösning. Den fungerar på ett mycket enkelt sätt genom att tillfälligt ta bort standardrutten från routingtabellen och/eller lägga till en användardefinierad (eventuellt avsiktligt ogiltig) rutt för att blockera Internetåtkomst. I vilket fall som helst bör inställningarna göras noggrant så att åtkomsten till det interna nätverket fortsätter att fungera korrekt. I synnerhet i större segmenterade nätverk bör båda alternativen kombineras genom att ta bort standardrutten å ena sidan och lägga till en rutt till det interna nätverket å andra sidan.
tr: Güvenlik duvarı arka ucu kullanılamıyorsa (örneğin, Windows Güvenlik Duvarı yerine üçüncü taraf bir güvenlik duvarı yazılımı kullanılıyorsa), bu arka ucu bir geri dönüş olarak kullanabilirsiniz. Varsayılan rotayı yönlendirme tablosundan geçici olarak kaldırarak ve/veya İnternet erişimini engellemek için kullanıcı tanımlı (muhtemelen kasıtlı olarak geçersiz) bir rota ekleyerek çok basit bir şekilde çalışır. Her durumda, dahili ağa erişimin düzgün bir şekilde çalışmaya devam etmesi için ayarlar dikkatlice yapılmalıdır. Özellikle daha büyük segmentli ağlarda, bir yandan varsayılan rotayı kaldırarak ve diğer yandan dahili ağa bir rota ekleyerek her iki seçenek birleştirilmelidir.

source: Licensing
sv: Licens
tr: Lisans
