Repository: veyon/docs
Catalog: locale/*/LC_MESSAGES/admin.po
Languages: tr

source: Veyon 4.9 comes with the new commercial Entra ID Connector add-on, allowing to work with devices, users and groups from the Entra ID cloud platform. The Windows version of Veyon is now based on the latest Qt 6.7 framework and OpenSSL 3.3.
tr: Veyon 4.9, Entra ID bulut platformundan cihazlar, kullanıcılar ve gruplarla çalışmaya olanak tanıyan yeni ticari Entra ID Connector eklentisiyle birlikte gelir. Veyon'un Windows sürümü artık en son Qt 6.7 framework ve OpenSSL 3.3'e dayanmaktadır.

source: Structural changes
tr: Yapısal değişiklikler

source: The user groups backend is no longer specific to the access control feature but used in other scopes as well. This allows e.g. changing the access group of authentication keys to Entra ID groups. While this has no effect on existing features, the relevant configuration keys have been renamed to match the new scope. See the next subsection for details.
tr: Kullanıcı grupları arka ucu artık erişim kontrol özelliğine özgü değil, diğer kapsamlarda da kullanılıyor. Bu, örneğin kimlik doğrulama anahtarlarının erişim grubunun Entra ID gruplarına değiştirilmesine olanak tanır. Bunun mevcut özellikler üzerinde bir etkisi olmasa da, ilgili yapılandırma anahtarları yeni kapsamla eşleşecek şekilde yeniden adlandırılmıştır. Ayrıntılar için bir sonraki alt bölüme bakın.

source: Configuration changes
tr: Yapılandırma değişiklikleri

source: Two configuration keys have been renamed in Veyon 4.9. When upgrading to Veyon 4.9 or newer the new configuration keys will be populated with the values of the old keys automatically.
tr: Veyon 4.9'da iki yapılandırma anahtarı yeniden adlandırıldı. Veyon 4.9 veya daha yeni bir sürüme yükseltme yaparken yeni yapılandırma anahtarları otomatik olarak eski anahtarların değerleriyle doldurulacak.

source: Old name
tr: Eski isim

source: New name
tr: Yeni isim

source: Veyon 4.8 introduces image quality control mechanisms to better meet bandwidth contraints, especially in Wi-Fi networks. A static image quality can now be configured for monitoring mode and remote access views. The demo server controls the image quality dynamically based on the used bandwidth between two key frames and the configured bandwidth limit.
tr: Veyon 4.8, özellikle Wi-Fi ağlarında bant genişliği kısıtlamalarını daha iyi karşılamak için görüntü kalitesi kontrol mekanizmaları sunar. Artık izleme modu ve uzaktan erişim görünümleri için statik bir görüntü kalitesi yapılandırılabilir. Demo sunucusu, iki anahtar kare arasındaki kullanılan bant genişliğine ve yapılandırılmış bant genişliği sınırına göre görüntü kalitesini dinamik olarak kontrol eder.

source: The Windows version of Veyon is now based on the latest Qt 6.5 framework as well as OpenSSL 3 and UltraVNC 1.4.2.0. Also the build environment has been updated to Debian 11 (i.e. GCC 10 and MinGW runtime 8). This allowed us to enable Link Time Optimization (LTO) resulting in better overall performance.
tr: Veyon'un Windows sürümü artık en son Qt 6.5 framework'ünün yanı sıra OpenSSL 3 ve UltraVNC 1.4.2.0'a dayanıyor. Ayrıca yapı ortamı Debian 11'e (yani GCC 10 ve MinGW çalışma zamanı 8) güncellendi. Bu, Bağlantı Zamanı Optimizasyonu'nu (LTO) etkinleştirmemize olanak tanıyarak genel performansın daha iyi olmasını sağladı.

source: The WebAPI has been changed such that the ``/api/v1/user`` endpoint does not return the session ID any longer. Instead the new ``/api/v1/session`` endpoint should be used which also provides additional information about the session.
tr: WebAPI, ``/api/v1/user`` uç noktasının artık oturum kimliğini döndürmemesi için değiştirildi. Bunun yerine, oturum hakkında ek bilgi de sağlayan yeni ``/api/v1/session`` uç noktası kullanılmalıdır.

source: No configuration keys have been changed or renamed in Veyon 4.8.
tr: Veyon 4.8'de hiçbir yapılandırma anahtarı değiştirilmedi veya yeniden adlandırılmadı.

source: Veyon 4.7 is the last minor release series of Veyon 4. One of the most long-awaited features is certainly the new screen selection menu in the remote access window. Also the overall performance and responsiveness has been improved thanks to a revised mechanism for sending and receiving control messages. Besides that, several issues from previous versions have been resolved.
tr: Veyon 4.7, Veyon 4'ün son küçük sürüm serisidir. En uzun zamandır beklenen özelliklerden biri kesinlikle uzaktan erişim penceresindeki yeni ekran seçimi menüsüdür. Ayrıca, kontrol mesajlarını gönderme ve alma mekanizmasının gözden geçirilmesi sayesinde genel performans ve yanıt verme yeteneği iyileştirildi. Bunun dışında, önceki sürümlerden gelen birkaç sorun çözüldü.

source: Core
tr: Çekirdek

source: Fixed binary compatibility issues between different versions of LibVNCServer/LibVNCClient.
tr: LibVNCServer/LibVNCClient'ın farklı sürümleri arasındaki ikili uyumluluk sorunları düzeltildi.

source: Messages in log files (especially debug messages) are now much more human readable.
tr: Günlük dosyalarındaki mesajlar (özellikle hata ayıklama mesajları) artık çok daha fazla insan tarafından okunabilir.

source: Plugins
tr: Eklentiler

source: Demo: Screens in the Demo menu are now displayed with their actual hardware name and connector type/index.
tr: Demo: Gösteri menüsündeki ekranlar artık gerçek donanım adı ve bağlayıcı türü/indeksiyle görüntüleniyor.

source: LDAP: Fixed querying members of a group when the nested groups option is enabled.
tr: LDAP: İç içe gruplar seçeneği etkinleştirildiğinde bir grubun üyelerine yapılan sorgu düzeltildi.

source: TextMessage: Students can now select and copy the text message or parts of it.
tr: TextMessage: Öğrenciler artık metin mesajını veya bir kısmını seçip kopyalayabilir.

source: TextMessage: Rich text (i.e. formatted text including hyperlinks) can now be entered and sent to students.
tr: TextMessage: Zengin metin (yani köprü metinleri içeren biçimlendirilmiş metin) artık girilebilir ve öğrencilere gönderilebilir.

source: RemoteAccess: For remote computers with multiple screens, a button with a screen selection menu has been added.
tr: RemoteAccess: Birden fazla ekranı olan uzak bilgisayarlar için ekran seçimi menüsü olan bir buton eklendi.

source: RemoteAccess: The login name of the remote user is shown in the window title, if the full name is not available.
tr: RemoteAccess: Tam adı mevcut değilse, uzak kullanıcının oturum açma adı pencere başlığında gösterilir.

source: WebAPI: The header field lookup (e.g. for the connection UID) is now case insensitive.
tr: WebAPI: Başlık alanı araması (örneğin bağlantı UID'si için) artık büyük/küçük harfe duyarlı değil.

source: The parameter order for the ``ping`` utility has been improved.
tr: ``Ping`` yardımcı programının parametre sıralaması iyileştirildi.

source: Issues regarding the session identification have been fixed, solving various issues when running ``veyon-server`` manually e.g. via autostart entries.
tr: Oturum tanımlamasıyla ilgili sorunlar düzeltildi ve ``veyon-server``'ı manuel olarak örneğin otomatik başlatma girdileri aracılığıyla çalıştırırken oluşan çeşitli sorunlar çözüldü.

source: A regression in Veyon 4.6.0 has been fixed to make the computer and user search case insensitive again.
tr: Veyon 4.6.0'daki bir gerileme, bilgisayar ve kullanıcı aramalarının tekrar büyük/küçük harfe duyarlı olmamasını sağlayacak şekilde düzeltildi.

source: Control messages between computers are now sent asynchronously which improves performance and responsiveness while reducing the CPU load.
tr: Bilgisayarlar arasındaki kontrol mesajları artık asenkron olarak gönderiliyor, bu da performansı ve tepki süresini artırırken CPU yükünü azaltıyor.

source: When closing the program, it now stops all features on the student computers and waits until all corresponding control messages have been sent.
tr: Program kapatıldığında artık öğrenci bilgisayarlarındaki tüm özellikler durduruluyor ve ilgili tüm kontrol mesajları gönderilene kadar bekleniyor.

source: A new filter button has been added to show computers with logged on users only.
tr: Yalnızca oturum açmış kullanıcıların bulunduğu bilgisayarları göstermek için yeni bir filtre düğmesi eklendi.

source: The dialog for confirming actions such as powering off computers only emphasizes *ALL* computers if all computers are selected.
tr: Bilgisayarları kapatma gibi eylemleri onaylama iletişim kutusu, tüm bilgisayarlar seçiliyse yalnızca *TÜM* bilgisayarları vurgular.

source: If available, the full name of the user is now preferred in the tooltip.
tr: Mümkünse, araç ipucunda artık kullanıcının tam adı tercih ediliyor.

source: Server
tr: Sunucu

source: Server-side framebuffer update rate control has been added which improves performance and responsive.
tr: Performansı ve tepki süresini artıran sunucu taraflı çerçeve arabelleği güncelleme hızı denetimi eklendi.

source: Added an explicit initialization of the WinSock layer to prevent networking issues.
tr: Ağ sorunlarını önlemek için WinSock katmanının açık bir şekilde başlatılması eklendi.

source: The service control has been made more resilient.
tr: Hizmet denetimi daha esnek hale getirildi.

source: The Windows ICMP API is now used to ping computers in favor of calling the external ``ping`` utility.
tr: Bilgisayarlara ping atmak için artık harici ``ping`` yardımcı programını çağırmak yerine Windows ICMP API kullanılıyor.

source: Several 3rdparty libraries have been updated (Qt 5.12.12 snapshot, TurboJPEG 2.1.2, OpenLDAP 2.5.10 snapshot)
tr: Birkaç 3. parti kütüphane güncellendi (Qt 5.12.12 anlık görüntüsü, TurboJPEG 2.1.2, OpenLDAP 2.5.10 anlık görüntüsü)

source: Even though there have been changes to the core and networking layer, there's only a small to medium risk for regressions, since most of the features haven't been touched. To benefit from the performance improvements, both teacher and student computers should be upgraded to Veyon 4.7.
tr: Çekirdek ve ağ katmanında değişiklikler yapılmış olsa da, özelliklerin çoğuna dokunulmadığından, gerilemeler için yalnızca küçük ila orta düzeyde bir risk bulunmaktadır. Performans iyileştirmelerinden faydalanmak için, hem öğretmen hem de öğrenci bilgisayarları Veyon 4.7'ye yükseltilmelidir.

source: Since the underlying LDAP library has been updated, users of Veyon's LDAP backend should test if Veyon 4.7 is able to retrieve all relevant information from your LDAP/AD server as usual.
tr: Altta yatan LDAP kütüphanesi güncellendiğinden, Veyon'un LDAP arka ucunu kullananlar, Veyon 4.7'nin her zamanki gibi LDAP/AD sunucularından tüm ilgili bilgileri alıp alamadığını test etmelidir.

source: There are no structural changes in Veyon 4.7.
tr: Veyon 4.7’de yapısal bir değişiklik bulunmuyor.

source: No configuration keys have been changed or renamed in Veyon 4.7.
tr: Veyon 4.7'de hiçbir yapılandırma anahtarı değiştirilmedi veya yeniden adlandırılmadı.

source: Most notably in Veyon 4.6 the remote access module has been redesigned to reuse the computer connection of the main window. This way users get instant access to computers when starting the remote control or view feature and no longer have to wait until the connection has been established (which could take up to several seconds). Also users can now press and hold the left mouse button on a computer. This shows the computer's screen in fullscreen and realtime until the mouse button is released again. Veyon CLI gained two new modules for managing plugins and features. This allows starting and stopping Veyon features remotely on the command line, e.g. for scripting and automation tasks. On Linux the Veyon Service component has been greatly improved to start and stop Veyon Server instances more reliably on session changes (user logon/logoff etc.). In addition to the existing *single and multi session modes*, there's now a new *active session mode* on Windows which starts a single Veyon Server instance for the currently active local or remote session. This is very useful for environments in which some students are logged in locally while others access unoccupied computers via RDP from home.
tr: Özellikle Veyon 4.6'da uzaktan erişim modülü ana pencerenin bilgisayar bağlantısını yeniden kullanmak üzere yeniden tasarlandı. Bu şekilde kullanıcılar uzaktan kumanda veya görüntüleme özelliğini başlatırken anında bilgisayarlara erişebiliyor ve artık bağlantı kurulana kadar beklemek zorunda kalmıyor (bu birkaç saniye sürebilir). Ayrıca kullanıcılar artık bir bilgisayarda sol fare düğmesini basılı tutabiliyor. Bu, fare düğmesi tekrar bırakılana kadar bilgisayarın ekranını tam ekran ve gerçek zamanlı olarak gösteriyor. Veyon CLI eklentileri ve özellikleri yönetmek için iki yeni modül kazandı. Bu, komut satırında Veyon özelliklerinin uzaktan başlatılmasına ve durdurulmasına olanak tanıyor, örneğin komut dosyası yazma ve otomasyon görevleri için. Linux'ta Veyon Service bileşeni, oturum değişiklikleri (kullanıcı oturum açma/kapatma vb.) sırasında Veyon Server örneklerini daha güvenilir bir şekilde başlatmak ve durdurmak için büyük ölçüde iyileştirildi. Mevcut *tek ve çoklu oturum modlarına* ek olarak, Windows'ta şu anda etkin yerel veya uzak oturum için tek bir Veyon Server örneği başlatan yeni bir *etkin oturum modu* var. Bu, bazı öğrencilerin yerel olarak oturum açtığı, diğerlerinin ise evden RDP aracılığıyla boş bilgisayarlara eriştiği ortamlar için oldukça faydalıdır.

source: Since mostly only a few specific modules have been changed or enhanced, there's a rather low risk for regressions in general. Especially Linux users are advised to upgrade soon to solve problems with the Veyon Service.
tr: Çoğunlukla sadece birkaç belirli modül değiştirildiği veya geliştirildiği için, genel olarak gerileme riski oldukça düşüktür. Özellikle Linux kullanıcılarının Veyon Hizmetiyle ilgili sorunları çözmek için yakında yükseltme yapmaları önerilir.

source: Protocol errors during the initial authentication phase are handled more reliably. This fixes problems when connecting to incompatible servers accidentally.
tr: İlk kimlik doğrulama aşamasındaki protokol hataları daha güvenilir bir şekilde işlenir. Bu, uyumsuz sunuculara yanlışlıkla bağlanıldığında sorunları düzeltir.

source: The ``plugin`` and ``feature`` modules have been added.
tr: ``Eklenti`` ve ``Özellik`` modülleri eklendi.

source: The ``config`` and ``shell`` plugins have been integrated as static modules.
tr: ``config`` ve ``shell`` eklentileri statik modüller olarak entegre edildi.

source: Demo: The visual feedback when (re-)connecting has been redesigned.
tr: Demo: (Yeniden) bağlanırken görsel geri bildirim yeniden tasarlandı.

source: DesktopServices: The *Run program* feature has been renamed to *Start application*.
tr: DesktopServices: *Programı çalıştır* özelliğinin adı *Uygulamayı başlat* olarak değiştirildi.

source: RemoteAccess: The visual feedback when (re-)connecting has been redesigned.
tr: RemoteAccess: (Yeniden) bağlanma sırasında görsel geri bildirim yeniden tasarlandı.

source: RemoteAccess: The computer connection of the main window is reused if available resulting in immediate access to the remote computer.
tr: RemoteAccess: Ana pencerenin bilgisayar bağlantısı mümkünse tekrar kullanılır ve böylece uzak bilgisayara anında erişim sağlanır.

source: RemoteAccess: The remote cursor is no longer used in view only mode to prevent occasionally observed render artifacts.
tr: RemoteAccess: Bazen gözlemlenen render eserlerini önlemek için yalnızca görüntüleme modunda uzak imleç artık kullanılmıyor.

source: UserSessionControl: Non-user sessions (such as display manager/login screen sessions) are no longer terminated by the user logoff feature.
tr: UserSessionControl: Kullanıcı olmayan oturumlar (ekran yöneticisi/oturum açma ekranı oturumları gibi) artık kullanıcı oturum kapatma özelliğiyle sonlandırılmıyor.

source: WebAPI: An error code has been added to report protocol errors occuring while connecting to the Veyon Server.
tr: WebAPI: Veyon Sunucusuna bağlanırken oluşan protokol hatalarını bildirmek için bir hata kodu eklendi.

source: WebAPI: The connection limit is enforced at the HTTP server level already to properly report the connection limit reached error instead of timing out.
tr: WebAPI: Bağlantı sınırı, zaman aşımı yerine bağlantı sınırına ulaşıldığını düzgün bir şekilde bildirmek için zaten HTTP sunucusu düzeyinde uygulanmaktadır.

source: WebAPI: Skip ping for hosts which no connection could be established to. This allows using a higher connection limit on Linux when the number of open file descriptors is limited.
tr: WebAPI: Bağlantı kurulamayan ana bilgisayarlar için ping atlanır. Bu, açık dosya tanımlayıcılarının sayısı sınırlı olduğunda Linux'ta daha yüksek bir bağlantı sınırının kullanılmasına olanak tanır.

source: SHM support is being detected more reliably.
tr: SHM desteği daha güvenilir şekilde tespit ediliyor.

source: Logging off users is now initiated properly through the environment-specific session manager while ``systemd-logind`` is used as fallback only. This fixes the display manager (especially GDM3) not being shown again after logoff.
tr: Kullanıcıların oturumlarının kapatılması artık ortama özgü oturum yöneticisi aracılığıyla düzgün bir şekilde başlatılırken ``systemd-logind`` yalnızca geri dönüş olarak kullanılıyor. Bu, görüntü yöneticisinin (özellikle GDM3) oturum kapatıldıktan sonra tekrar gösterilmemesini düzeltir.

source: Reboot and power down via ``systemd-logind`` has been improved while the environment-specific session manager is used as fallback only. The reboot and poweroff binaries are not used any longer.
tr: ``systemd-logind`` üzerinden yeniden başlatma ve güç kapatma iyileştirildi, ortama özgü oturum yöneticisi ise yalnızca geri dönüş olarak kullanılıyor. Yeniden başlatma ve güç kapatma ikili dosyaları artık kullanılmıyor.

source: In addition to the hostname, the computer display name is shown in the tooltip of a computer.
tr: Bilgisayarın araç ipucunda, ana bilgisayar adına ek olarak bilgisayarın görüntü adı da gösterilir.

source: A computer's screen is shown in fullscreen and realtime while pressing and holding the left mouse button on a computer.
tr: Bilgisayarda sol fare tuşuna basılı tutulduğunda bilgisayar ekranı tam ekran ve gerçek zamanlı olarak gösterilir.

source: For Linux clients, *[no user]* is displayed as the user name instead of the name of the display manager user.
tr: Linux istemcileri için, görüntü yöneticisi kullanıcısının adı yerine kullanıcı adı olarak *[kullanıcı yok]* görüntülenir.

source: Hostnames of connected computers (shown in the tooltip of the tray icon) are now reverse resolved in background to keep connections responsive.
tr: Bağlantılı bilgisayarların ana bilgisayar adları (tepsi simgesinin araç ipucunda gösterilir) artık bağlantıların yanıt vermesini sağlamak için arka planda ters çözümleniyor.

source: The 3rdparty component UltraVNC has been updated to the latest version.
tr: Üçüncü taraf bileşeni UltraVNC en son sürüme güncellendi.

source: The new *Active session mode* has been implemented.
tr: Yeni *Aktif oturum modu* uygulandı.

source: Querying local and domain user groups has been improved to share more code in common and log more details in case of errors.
tr: Yerel ve etki alanı kullanıcı gruplarına yapılan sorgulamalar, ortak kod paylaşımının artırılması ve hata durumunda daha fazla ayrıntının günlüğe kaydedilmesi amacıyla iyileştirildi.

source: The Veyon Service additionally depends on the LanmanWorkstation and LSM services to improve reliability on start.
tr: Veyon Servisi ayrıca başlangıçta güvenilirliği artırmak için LanmanWorkstation ve LSM servislerine de güvenir.

source: Several 3rdparty libraries have been updated (Qt 5.12.11 snapshot, OpenSSL 1.1.1l, TurboJPEG 2.1.1)
tr: Birkaç 3. parti kütüphane güncellendi (Qt 5.12.11 anlık görüntüsü, OpenSSL 1.1.1l, TurboJPEG 2.1.1)

source: In Veyon 4.6 the *Run program* feature has been renamed to *Start application* but works identically.
tr: Veyon 4.6'da *Programı çalıştır* özelliğinin adı *Uygulamayı başlat* olarak değiştirildi ancak aynı şekilde çalışıyor.

source: One configuration key has been renamed in Veyon 4.6. When upgrading to Veyon 4.6 or newer this new configuration key will be populated with the value of the old key automatically.
tr: Veyon 4.6'da bir yapılandırma anahtarı yeniden adlandırıldı. Veyon 4.6 veya daha yenisine yükseltme yaparken bu yeni yapılandırma anahtarı otomatik olarak eski anahtarın değeriyle doldurulacak.

source: Veyon 4.5 is the release series with the most changes since Veyon 4.0. Most notably, Veyon 4.5 includes a new WebAPI plugin which allows accessing computers by 3rdparty products via HTTP. Veyon Master introduces the new monitoring panels *Slideshow* and *Spotlight*. The demo mode has been greatly extended and improved. It's now possible to share a student's screen instead of the own screen easily. In environments where multiple monitors are connected to the computer running Veyon Master, the user can now choose to share a specific monitor only. Moreover, the performance and responsiveness of the demo mode is much better thanks to the demo server now being multithreaded. At the same time Veyon 4.5 focuses on application and desktop virtualization environments by delivering extended and improved multi session support. Additionally various compatibility issues on Linux have been fixed and the file transfer plugin received a configuration page.
tr: Veyon 4.5, Veyon 4.0'dan bu yana en çok değişikliğe sahip olan yayın serisidir. En dikkat çekeni, Veyon 4.5'in HTTP üzerinden üçüncü taraf ürünlerle bilgisayarlara erişime izin veren yeni bir WebAPI eklentisi içermesidir. Veyon Master, yeni izleme panelleri *Slideshow* ve *Spotlight*'ı sunar. Demo modu büyük ölçüde genişletilmiş ve iyileştirilmiştir. Artık kendi ekranı yerine bir öğrencinin ekranını kolayca paylaşmak mümkündür. Veyon Master'ı çalıştıran bilgisayara birden fazla monitörün bağlı olduğu ortamlarda, kullanıcı artık yalnızca belirli bir monitörü paylaşmayı seçebilir. Dahası, demo sunucusunun artık çok iş parçacıklı olması sayesinde demo modunun performansı ve tepkisi çok daha iyidir. Aynı zamanda Veyon 4.5, genişletilmiş ve iyileştirilmiş çoklu oturum desteği sunarak uygulama ve masaüstü sanallaştırma ortamlarına odaklanır. Ek olarak, Linux'taki çeşitli uyumluluk sorunları giderildi ve dosya aktarım eklentisi bir yapılandırma sayfası aldı.

source: The feature plugin API has been revised.
tr: Özellik eklentisi API'si revize edildi.

source: The invocation of worker processes and communication with them has been improved, resulting in increased reliability of certain Veyon features such as the demo mode.
tr: Çalışan süreçlerin çağrılması ve bunlarla iletişim iyileştirildi; bu sayede demo modu gibi bazı Veyon özelliklerinin güvenilirliği artırıldı.

source: Session IDs are now managed internally. This allows reusing a session ID after a user session has been closed. RDP session IDs (which are increased continuously) are no longer used for calculating server port numbers.
tr: Oturum kimlikleri artık dahili olarak yönetiliyor. Bu, bir kullanıcı oturumu kapatıldıktan sonra bir oturum kimliğinin yeniden kullanılmasına olanak tanır. RDP oturum kimlikleri (sürekli olarak artırılır) artık sunucu bağlantı noktası numaralarını hesaplamak için kullanılmaz.

source: Configurator
tr: Yapılandırıcı

source: Several parts of the user interface have been improved.
tr: Kullanıcı arayüzünün çeşitli bölümleri iyileştirildi.

source: Settings for new Veyon Master features have been added.
tr: Yeni Veyon Master özellikleri için ayarlar eklendi.

source: Demo: The server has been refactored to be multithreaded which improves performance and responsiveness especially with many clients.
tr: Demo: Sunucu, özellikle çok sayıda istemciyle performansı ve tepki süresini iyileştiren çok iş parçacıklı olacak şekilde yeniden düzenlendi.
