Repository: veyon/docs
Catalog: locale/*/LC_MESSAGES/admin.po
Languages: tr

source: A non-graphical service application which monitors user sessions on a computer and starts Veyon Server instances within these sessions. The service and its server subprocesses are required to run on all computers including teacher computers. If Veyon Server instances are started manually the Veyon Service is not required.
tr: Bir bilgisayardaki kullanıcı oturumlarını izleyen ve bu oturumlar içinde Veyon Server örneklerini başlatan grafiksel olmayan bir hizmet uygulaması. Hizmet ve sunucu alt süreçlerinin öğretmen bilgisayarları dahil tüm bilgisayarlarda çalışması gerekir. Veyon Server örnekleri manuel olarak başlatılırsa Veyon Service gerekli değildir.

source: Veyon Server
tr: Veyon Sunucusu

source: A server application which provides access to a computer as well as control and application functions. In regular operation this program is started by the Veyon Service automatically and with elevated privileges so it can't be terminated by users.
tr: Bir bilgisayara erişimin yanı sıra kontrol ve uygulama işlevleri sağlayan bir sunucu uygulaması. Normal çalışmada bu program Veyon Hizmeti tarafından otomatik olarak ve yükseltilmiş ayrıcalıklarla başlatılır, böylece kullanıcılar tarafından sonlandırılamaz.

source: A helper program started by the server to provide specific functions in an isolated environment or in the context of the currently logged-on user. Those specific functions include the tray icon, the demo server on the teacher computer and the demo client on the student computers.
tr: Sunucu tarafından başlatılan ve izole edilmiş bir ortamda veya şu anda oturum açmış kullanıcının bağlamında belirli işlevler sağlayan bir yardımcı program. Bu belirli işlevler arasında tepsi simgesi, öğretmen bilgisayarındaki demo sunucusu ve öğrenci bilgisayarlarındaki demo istemcisi bulunur.

source: Veyon Configurator
tr: Veyon Yapılandırıcı

source: A configuration tool which allows configuring and customizing all components of a local Veyon installation through a graphical user interface. The program is started by the administrator with elevated privileges whenever necessary.
tr: Yerel bir Veyon kurulumunun tüm bileşenlerini grafiksel bir kullanıcı arayüzü aracılığıyla yapılandırmaya ve özelleştirmeye izin veren bir yapılandırma aracı. Program, gerektiğinde yükseltilmiş ayrıcalıklarla yönetici tarafından başlatılır.

source: A command line tool that in addition to the Veyon Configurator allows various configuration adjustments, automated tasks and the use of some Veyon features without graphical interaction. The program is run either interactively on the command line or script-controlled with usually administrative privileges.
tr: Veyon Yapılandırıcıya ek olarak çeşitli yapılandırma ayarlamalarına, otomatik görevlere ve bazı Veyon özelliklerinin grafiksel etkileşim olmadan kullanılmasına olanak tanıyan bir komut satırı aracı. Program komut satırında etkileşimli olarak veya genellikle yönetici ayrıcalıklarıyla betik kontrollü olarak çalıştırılır.

source: Network architecture
tr: Ağ mimarisi

source: From a network perspective the following components and TCP ports are involved:
tr: Ağ perspektifinden bakıldığında aşağıdaki bileşenler ve TCP portları söz konusudur:

source: Teacher computer
tr: Öğretmen bilgisayarı

source: Student computer
tr: Öğrenci bilgisayarı

source: Master computer
tr: Ana bilgisayar

source: Client computer
tr: İstemci bilgisayarı

source: Software components
tr: Yazılım bileşenleri

source: Configuration tool
tr: Yapılandırma aracı

source: LDAP/AD integration
tr: LDAP/AD entegrasyonu

source: This chapter covers the setup of Veyon for connecting it to LDAP-compatible servers. In the following the generic term *LDAP* will be used and refers to all LDAP-compatible products and technologies such as *OpenLDAP*, *Samba* or *Active Directory*. LDAP integration enables you to use information about users, user groups, computers and locations that already exist in most environments, instead of manually replicating it in the Veyon configuration. Once configured Veyon Master can retrieve locations and computers to be displayed directly from the directory service. Additionally LDAP users and user groups can serve as a base for :ref:`ComputerAccessControl`.
tr: Bu bölüm, Veyon'un LDAP uyumlu sunuculara bağlanması için kurulumunu kapsar. Aşağıda genel terim *LDAP* kullanılacak ve *OpenLDAP*, *Samba* veya *Active Directory* gibi tüm LDAP uyumlu ürünlere ve teknolojilere atıfta bulunacaktır. LDAP entegrasyonu, Veyon yapılandırmasında manuel olarak çoğaltmak yerine, çoğu ortamda zaten var olan kullanıcılar, kullanıcı grupları, bilgisayarlar ve konumlar hakkında bilgi kullanmanızı sağlar. Yapılandırıldıktan sonra Veyon Master, doğrudan dizin hizmetinden görüntülenecek konumları ve bilgisayarları alabilir. Ek olarak, LDAP kullanıcıları ve kullanıcı grupları :ref:`ComputerAccessControl` için bir temel görevi görebilir.

source: The configuration of the LDAP integration is done on configuration page :guilabel:`LDAP` in Veyon Configurator. The page is divided into several subpages for :ref:`LDAPBasicSettings`, :ref:`LDAPEnvironmentSettings`, :ref:`LDAPAdvancedSettings` and :ref:`LDAPIntegrationTests`.
tr: LDAP entegrasyonunun yapılandırması Veyon Configurator'daki :guilabel:`LDAP` yapılandırma sayfasında yapılır. Sayfa :ref:`LDAPBasicSettings`, :ref:`LDAPEnvironmentSettings`, :ref:`LDAPAdvancedSettings` ve :ref:`LDAPIntegrationTests` için birkaç alt sayfaya bölünmüştür.

source: Basic settings
tr: Temel ayarlar

source: The basic settings affect all basic parameters for accessing an LDAP server. They are mandatory for a properly working LDAP integration.
tr: Temel ayarlar, bir LDAP sunucusuna erişim için tüm temel parametreleri etkiler. Bunlar, düzgün çalışan bir LDAP entegrasyonu için zorunludur.

source: LDAP server and port
tr: LDAP sunucusu ve bağlantı noktası

source: Enter the address of the LDAP server (hostname or IP address) here. If a port other than the default LDAP port 389 is used, the port parameter has to be adjusted accordingly.
tr: LDAP sunucusunun adresini (ana bilgisayar adı veya IP adresi) buraya girin. Varsayılan LDAP portu 389'dan farklı bir port kullanılırsa, port parametresi buna göre ayarlanmalıdır.

source: Anonymous bind / Use bind credentials
tr: Anonim bağlama / Bağlama kimlik bilgilerini kullan

source: Depending on the environment and configuration of the LDAP server, LDAP queries can be performed either as an anonymous user or with valid usernames and passwords only. If the server access requires a username and password, the option :guilabel:`Use bind credentials` has to be selected and the credentials have to be entered in the input fields below. Otherwise the default option :guilabel:`Anonymous bind` can be used.
tr: LDAP sunucusunun ortamına ve yapılandırmasına bağlı olarak, LDAP sorguları anonim bir kullanıcı olarak veya yalnızca geçerli kullanıcı adları ve parolalarla gerçekleştirilebilir. Sunucu erişimi bir kullanıcı adı ve parola gerektiriyorsa, :guilabel:`Use bind credentials` seçeneği seçilmeli ve kimlik bilgileri aşağıdaki giriş alanlarına girilmelidir. Aksi takdirde varsayılan seçenek :guilabel:`Anonymous bind` kullanılabilir.

source: Bind DN
tr: DN bağla

source: The bind DN is the username used to log in at the server in order to perform LDAP operations. However, the required format heavily depends on the LDAP server and its configuration. Possible formats include ``User``, ``DOMAIN\User`` or ``cn=User,…,dc=example,dc=org``.
tr: Bağlama DN'si, LDAP işlemlerini gerçekleştirmek için sunucuda oturum açmak için kullanılan kullanıcı adıdır. Ancak, gereken biçim büyük ölçüde LDAP sunucusuna ve yapılandırmasına bağlıdır. Olası biçimler arasında ``User``, ``DOMAIN\User`` veya ``cn=User,…,dc=example,dc=org`` bulunur.

source: Bind password
tr: Şifre bağla

source: In addition to the bind DN the corresponding password has to be entered.
tr: Bind DN'ye ek olarak ilgili şifrenin de girilmesi gerekiyor.

source: You can use the :guilabel:`Test` button to verify, whether server access is working with the supplied parameters.
tr: Sunucu erişiminin verilen parametrelerle çalışıp çalışmadığını doğrulamak için :guilabel:`Test` butonunu kullanabilirsiniz.

source: Veyon only requires read access to the LDAP directory. As an additional security measure on the LDAP server a dedicated user with read-only access to the LDAP directory can be created, e.g. "Veyon-LDAP-RO". Access to relevant attributes can be further restricted for this user.
tr: Veyon yalnızca LDAP dizinine okuma erişimi gerektirir. LDAP sunucusunda ek bir güvenlik önlemi olarak LDAP dizinine salt okunur erişimi olan özel bir kullanıcı oluşturulabilir, örneğin "Veyon-LDAP-RO". Bu kullanıcı için ilgili özniteliklere erişim daha da kısıtlanabilir.

source: Connection security
tr: Bağlantı güvenliği

source: Veyon can establish encrypted connections to the LDAP server. For this purpose, settings are available in the section :guilabel:`Connection security`.
tr: Veyon, LDAP sunucusuna şifreli bağlantılar kurabilir. Bu amaçla, ayarlar :guilabel:`Bağlantı güvenliği` bölümünde mevcuttur.

source: Encryption protocol
tr: Şifreleme protokolü

source: You can choose between the encryption protocols *None*, *TLS* and *SSL*. The use of the modern TLS protocol is recommended.
tr: *Hiçbiri*, *TLS* ve *SSL* şifreleme protokolleri arasında seçim yapabilirsiniz. Modern TLS protokolünün kullanılması önerilir.

source: **Default:** *None*
tr: **Varsayılan:** *Yok*

source: TLS certificate verification
tr: TLS sertifika doğrulaması

source: This setting determines how the security certificate of the LDAP server is to be checked when the encrypted connection is established. With the default setting *System defaults*, depending on the operating system, an attempt is made to verify the certificate using the root certificates installed system-wide. The Windows certificate store is not taken into account here, so that a separate CA certificate file may have to be stored. With the *Never* setting, the server certificate is not verified at all. This however allows for case man-in-the-middle attacks and should therefore only be used in exceptional cases. The *User-defined CA certificate file* setting ensures that the certificate check is performed on the basis of a specified CA certificate file.
tr: Bu ayar, şifreli bağlantı kurulduğunda LDAP sunucusunun güvenlik sertifikasının nasıl kontrol edileceğini belirler. Varsayılan ayar *Sistem varsayılanları* ile, işletim sistemine bağlı olarak, sertifikanın sistem genelinde yüklü kök sertifikalar kullanılarak doğrulanması denenir. Windows sertifika deposu burada dikkate alınmaz, bu nedenle ayrı bir CA sertifika dosyasının depolanması gerekebilir. *Asla* ayarı ile sunucu sertifikası hiç doğrulanmaz. Ancak bu, aracı saldırılara izin verir ve bu nedenle yalnızca istisnai durumlarda kullanılmalıdır. *Kullanıcı tanımlı CA sertifika dosyası* ayarı, sertifika kontrolünün belirtilen bir CA sertifika dosyası temelinde gerçekleştirilmesini sağlar.

source: **Default:** *System defaults*
tr: **Varsayılan:** *Sistem varsayılanları*

source: Custom CA certificate file
tr: Özel CA sertifika dosyası

source: If you use your own certification authority (CA), it may be necessary to store their certificate in a PEM file format so that Veyon can check the certificate of the LDAP server.
tr: Kendi sertifika yetkilinizi (CA) kullanıyorsanız, Veyon'un LDAP sunucusunun sertifikasını kontrol edebilmesi için sertifikalarını bir PEM dosya biçiminde depolamanız gerekebilir.

source: Base DN
tr: Temel DN

source: The base DN defines the address of the root object in the directory. All objects are stored below the base DN. Usually the base DN comes from the DNS or AD domain (see also `RFC 2247 <https://www.ietf.org/rfc/rfc2247.txt>`_).
tr: Temel DN, dizindeki kök nesnenin adresini tanımlar. Tüm nesneler temel DN'nin altında saklanır. Genellikle temel DN, DNS veya AD etki alanından gelir (ayrıca bkz. `RFC 2247 <https://www.ietf.org/rfc/rfc2247.txt>`_).

source: In most cases a fixed base DN is used so the default option :guilabel:`Fixed base DN` has to be chosen. The base DN then has to be entered in the corresponding input field or selected from the server by using the :guilabel:`Browse` button. You can use the :guilabel:`Test` button to verify, whether the settings are correct and entries can be found.
tr: Çoğu durumda sabit tabanlı bir DN kullanılır, bu nedenle varsayılan seçenek :guilabel:`Sabit tabanlı DN` seçilmelidir. Daha sonra, taban DN ilgili giriş alanına girilmeli veya :guilabel:`Gözat` düğmesi kullanılarak sunucudan seçilmelidir. Ayarların doğru olup olmadığını ve girişlerin bulunup bulunmadığını doğrulamak için :guilabel:`Test` düğmesini kullanabilirsiniz.

source: If a generic Veyon configuration is to be used across multiple sites with different base DNs, Veyon can be configured so that the base DN is always queried dynamically using LDAP naming contexts. For this to work the :guilabel:`Discover base DN by naming context` has to be chosen and the naming context attribute must be adapted. You can use the :guilabel:`Test` button to verify, whether a Base DN could be determined.
tr: Farklı temel DN'lere sahip birden fazla sitede genel bir Veyon yapılandırması kullanılacaksa, temel DN'nin her zaman LDAP adlandırma bağlamları kullanılarak dinamik olarak sorgulanması için Veyon yapılandırılabilir. Bunun işe yaraması için :guilabel:`Baz DN'yi adlandırma bağlamı ile keşfet` seçilmeli ve adlandırma bağlamı özniteliği uyarlanmalıdır. Bir Temel DN'nin belirlenip belirlenemediğini doğrulamak için :guilabel:`Test` düğmesini kullanabilirsiniz.

source: After importing a generic Veyon configuration without a fixed base DN it is also possible to determine the base DN through the :ref:`LDAPCLI` and write it to the local configuration.
tr: Sabit bir temel DN olmadan genel bir Veyon yapılandırması içe aktarıldıktan sonra, temel DN'yi :ref:`LDAPCLI` aracılığıyla belirlemek ve bunu yerel yapılandırmaya yazmak da mümkündür.

source: Environment settings
tr: Ortam ayarları

source: After the basic settings have been configured and tested, the environment-specific settings can now be made. These settings determine which trees contain objects of certain types as well as the names of certain object attributes. With these parameters Veyon can retrieve all required information from the LDAP directory.
tr: Temel ayarlar yapılandırılıp test edildikten sonra, ortama özgü ayarlar artık yapılabilir. Bu ayarlar, hangi ağaçların belirli türdeki nesneleri ve belirli nesne niteliklerinin adlarını içerdiğini belirler. Veyon, bu parametrelerle LDAP dizininden gerekli tüm bilgileri alabilir.

source: Object trees
tr: Nesne ağaçları

source: Object trees are organizational or structural units in which certain types of objects (users, groups, computers) are stored. The respective CNs (Common Names) or OUs (Organizational Units) must be entered **without the base DN part** in the respective input field. Next to each input field there are buttons for opening browse dialogs and for testing the individual setting.
tr: Nesne ağaçları, belirli nesne türlerinin (kullanıcılar, gruplar, bilgisayarlar) depolandığı organizasyonel veya yapısal birimlerdir. İlgili CN'ler (Ortak Adlar) veya OU'lar (Organizasyonel Birimler) ilgili giriş alanına **temel DN kısmı olmadan** girilmelidir. Her giriş alanının yanında, göz atma iletişim kutularını açmak ve bireysel ayarları test etmek için düğmeler bulunur.

source: User tree
tr: Kullanıcı ağacı

source: The LDAP tree (without base DN) in which the user objects are located must be entered here, e.g. ``OU=Users`` or ``CN=Users``.
tr: Kullanıcı nesnelerinin bulunduğu LDAP ağacı (temel DN olmadan) buraya girilmelidir, örneğin ``OU=Users`` veya ``CN=Users``.

source: Group tree
tr: Grup ağacı

source: The LDAP tree (without base DN) in which the group objects are located must be entered here, e.g. ``OU=Groups`` or ``CN=Groups``.
tr: Grup nesnelerinin bulunduğu LDAP ağacı (temel DN olmadan) buraya girilmelidir, örneğin ``OU=Groups`` veya ``CN=Groups``.

source: Computer tree
tr: Bilgisayar ağacı

source: The LDAP tree (without base DN) in which the computer objects are located must be entered here, e.g. ``OU=Computers`` or ``CN=Computers``.
tr: Bilgisayar nesnelerinin yer aldığı LDAP ağacı (temel DN olmadan) buraya girilmelidir, örneğin ``OU=Bilgisayarlar`` veya ``CN=Bilgisayarlar``.

source: Computer group tree
tr: Bilgisayar grubu ağacı

source: If the computer groups are located in a different tree than the regular user groups or in a subtree, the corresponding LDAP tree can be specified here. Otherwise the group tree is used to query computer groups and to filter them with a specific :ref:`object filter <LDAPObjectFilters>` if necessary.
tr: Bilgisayar grupları normal kullanıcı gruplarından farklı bir ağaçta veya bir alt ağaçta yer alıyorsa, karşılık gelen LDAP ağacı burada belirtilebilir. Aksi takdirde grup ağacı bilgisayar gruplarını sorgulamak ve gerekirse belirli bir :ref:`object filter <LDAPObjectFilters>` ile filtrelemek için kullanılır.

source: Perform recursive search operations in object trees
tr: Nesne ağaçlarında yinelemeli arama işlemleri gerçekleştirin

source: This option can be used to control whether objects should be queried recursively. The search then takes place not only in the specified tree but also in any existing subtrees.
tr: Bu seçenek nesnelerin yinelemeli olarak sorgulanıp sorgulanmayacağını kontrol etmek için kullanılabilir. Arama daha sonra yalnızca belirtilen ağaçta değil, aynı zamanda mevcut alt ağaçlarda da gerçekleşir.

source: **Default:** *disabled*
tr: **Varsayılan:** *devre dışı*

source: If objects of one type are stored in different object trees (e.g. users in both ``CN=Teachers`` and in ``CN=Students``), the parameter for the corresponding object tree can be left empty and the option :guilabel:`Perform recursive search operations in object trees` can be activated. A recursive search is then performed in the entire LDAP directory starting from the base DN. In this case, however it is strongly recommended to set the :ref:`object filters <LDAPObjectFilters>` for the respective object type.
tr: Bir türün nesneleri farklı nesne ağaçlarında depolanıyorsa (örneğin, hem ``CN=Teachers`` hem de ``CN=Students``'taki kullanıcılar), karşılık gelen nesne ağacı için parametre boş bırakılabilir ve :guilabel:`Nesne ağaçlarında yinelemeli arama işlemleri gerçekleştir` seçeneği etkinleştirilebilir. Daha sonra, temel DN'den başlayarak tüm LDAP dizininde yinelemeli bir arama gerçekleştirilir. Ancak bu durumda, ilgili nesne türü için :ref:`nesne filtreleri <LDAPObjectFilters>` ayarlanması şiddetle önerilir.

source: Object attributes
tr: Nesne öznitelikleri

source: For Veyon to be able to retrieve the required information from the queried objects, the names of some object attributes have to be configured, as these differ substantially depending on the environment and LDAP server. Next to each input field buttons for browsing the attribute of an existing object and testing the respective attribute name are available.
tr: Veyon'un sorgulanan nesnelerden gerekli bilgileri alabilmesi için, bazı nesne niteliklerinin adlarının yapılandırılması gerekir, çünkü bunlar ortama ve LDAP sunucusuna bağlı olarak önemli ölçüde farklılık gösterir. Her giriş alanının yanında, mevcut bir nesnenin niteliğine göz atmak ve ilgili nitelik adını test etmek için düğmeler mevcuttur.

source: User login name attribute
tr: Kullanıcı oturum açma adı özniteliği

source: This attribute must hold the login name of a user. The attribute is used to determine the LDAP user object associated with a particular username. In an OpenLDAP environment often the attribute name ``uid`` is used while the name ``sAMAccountName`` is common in Active Directories.
tr: Bu öznitelik bir kullanıcının oturum açma adını tutmalıdır. Öznitelik, belirli bir kullanıcı adıyla ilişkili LDAP kullanıcı nesnesini belirlemek için kullanılır. Bir OpenLDAP ortamında genellikle öznitelik adı ``uid`` kullanılırken, ``sAMAccountName`` adı Active Directory'lerde yaygındır.

source: Group member attribute
tr: Grup üyesi özniteliği

source: Members of a group are listed in group objects through this attribute. The attribute is used to determine the groups a particular user is a member of. Depending on the configuration the attribute also used map computers to locations. In an OpenLDAP environment often the attribute name ``member`` is used while the name ``memberUid`` is common in Active Directories.
tr: Bir grubun üyeleri bu öznitelik aracılığıyla grup nesnelerinde listelenir. Öznitelik, belirli bir kullanıcının üyesi olduğu grupları belirlemek için kullanılır. Yapılandırmaya bağlı olarak öznitelik ayrıca bilgisayarları konumlara eşlemek için de kullanılır. Bir OpenLDAP ortamında genellikle ``member`` öznitelik adı kullanılırken ``memberUid`` adı Active Directory'lerde yaygındır.

source: Computer display name attribute
tr: Bilgisayar ekran adı özniteliği

source: The content of this optional attribute is used to determine the name of a computer displayed in Veyon Master. If left blank the common name (``cn``) is used instead.
tr: Bu isteğe bağlı özniteliğin içeriği, Veyon Master'da görüntülenen bir bilgisayarın adını belirlemek için kullanılır. Boş bırakılırsa bunun yerine genel ad (``cn``) kullanılır.

source: **Default:** *cn*
tr: **Varsayılan:** *cn*

source: Computer host name attribute
tr: Bilgisayar ana bilgisayar adı özniteliği

source: This attribute must hold the DNS name of the computer. It is used to determine the LDAP computer object associated with a particular computer hostname. In an OpenLDAP environment often the attribute name ``name`` is used while the name ``dNSHostName`` is common in Active Directories.
tr: Bu öznitelik bilgisayarın DNS adını tutmalıdır. Belirli bir bilgisayar ana bilgisayar adıyla ilişkili LDAP bilgisayar nesnesini belirlemek için kullanılır. Bir OpenLDAP ortamında genellikle öznitelik adı ``name`` kullanılırken, ``dNSHostName`` adı Active Directory'lerde yaygındır.

source: Hostnames stored as fully qualified domain names (FQDN, e.g. myhost.example.org)
tr: Tam nitelikli alan adları (FQDN, örn. myhost.example.org) olarak depolanan ana bilgisayar adları

source: This option specifies whether to use the `fully qualified domain name (FQDN) <https://en.wikipedia.org/wiki/Fully_qualified_domain_name>`_ for mapping computer names to LDAP computer objects. If the computer names are stored without the domain part in the LDAP directory, this option has to be left disabled, otherwise it must be enabled.
tr: Bu seçenek, bilgisayar adlarını LDAP bilgisayar nesnelerine eşlemek için `tam nitelikli etki alanı adı (FQDN) <https://en.wikipedia.org/wiki/Fully_qualified_domain_name>`_ kullanılıp kullanılmayacağını belirtir. Bilgisayar adları LDAP dizininde etki alanı bölümü olmadan depolanırsa, bu seçeneğin devre dışı bırakılması gerekir, aksi takdirde etkinleştirilmesi gerekir.

source: Computer MAC address attribute
tr: Bilgisayar MAC adresi özniteliği
