Repository: veyon/docs
Catalog: locale/*/LC_MESSAGES/admin.po
Languages: tr

source: During a screen broadcast, only changed screen areas are sent to the client computers (incremental updates) in order to minimize the network traffic. These updates are performed individually and asynchronously for each client, so that after a while the clients may no longer run synchronously depending on bandwidth and latency. Therefore, complete screen contents (*key frames*) are transmitted at regular intervals, so that a synchronous image is displayed on all clients at the latest when the key frame interval expires. The lower the value, the higher the processor and network traffic.
tr: Bir ekran yayını sırasında, ağ trafiğini en aza indirmek için yalnızca değiştirilen ekran alanları istemci bilgisayarlara gönderilir (artımlı güncellemeler). Bu güncellemeler her istemci için ayrı ayrı ve eşzamansız olarak gerçekleştirilir, böylece bir süre sonra istemciler bant genişliğine ve gecikmeye bağlı olarak artık eşzamansız olarak çalışmayabilir. Bu nedenle, tam ekran içerikleri (*anahtar kareler*) düzenli aralıklarla iletilir, böylece anahtar kare aralığı sona erdiğinde en geç tüm istemcilerde eşzamansız bir görüntü görüntülenir. Değer ne kadar düşükse, işlemci ve ağ trafiği o kadar yüksek olur.

source: **Default:** *10 s*
tr: **Varsayılan:** *10 s*

source: Memory limit
tr: Bellek sınırı

source: All screen update data is stored by the demo server in an internal buffer and then distributed to clients. To prevent the internal buffer between two key frames from occupying too much memory due to too many incremental updates, the value specified here is used as a limit. This limit is a soft limit, so that if it is exceeded, a key frame update is attempted (even if the key frame interval has not yet expired), but the buffer still retains all data. The buffer is only reset when the double value is exceeded (hard limit). If there are repeated interruptions or delays while broadcasting a screen, this value should be increased.
tr: Tüm ekran güncelleme verileri demo sunucusu tarafından dahili bir tamponda saklanır ve ardından istemcilere dağıtılır. İki anahtar kare arasındaki dahili tamponun çok fazla artımlı güncelleme nedeniyle çok fazla bellek kaplamasını önlemek için, burada belirtilen değer bir sınır olarak kullanılır. Bu sınır yumuşak bir sınırdır, yani aşıldığında bir anahtar kare güncellemesi denenir (anahtar kare aralığı henüz sona ermemiş olsa bile), ancak tampon yine de tüm verileri tutar. Tampon yalnızca double değeri aşıldığında sıfırlanır (sert sınır). Bir ekran yayınlanırken tekrarlanan kesintiler veya gecikmeler varsa, bu değer artırılmalıdır.

source: **Default:** *128 MB*
tr: **Varsayılan:** *128 MB*

source: Bandwidth limit
tr: Bant genişliği sınırı

source: As of Veyon 4.8, the total bandwidth used for screen transmission can be limited. This involves determining the bandwidth used between two key frames and comparing it with the set limit. If it is above this limit, the demo server reduces the image quality so that less data is transmitted to the clients. Conversely, if the bandwidth used is below 80% of the limit, the image quality is increased again.
tr: Veyon 4.8 itibariyle, ekran iletimi için kullanılan toplam bant genişliği sınırlandırılabilir. Bu, iki anahtar kare arasında kullanılan bant genişliğinin belirlenmesini ve ayarlanan sınırla karşılaştırılmasını içerir. Bu sınırın üzerindeyse, demo sunucusu görüntü kalitesini düşürür, böylece istemcilere daha az veri iletilir. Tersine, kullanılan bant genişliği sınırın %80'inin altındaysa, görüntü kalitesi tekrar artırılır.

source: **Default:** *100 MB/s*
tr: **Varsayılan:** *100 MB/s*

source: All options for connecting Veyon to an LDAP-compatible server are described in detail in chapter :ref:`LDAP`.
tr: Veyon'u LDAP uyumlu bir sunucuya bağlamak için tüm seçenekler :ref:`LDAP` bölümünde ayrıntılı olarak açıklanmıştır.

source: File transfer
tr: Dosya transferi

source: Starting with Veyon 4.5, an additional configuration page with settings related to the file transfer feature is available in the advanced view.
tr: Veyon 4.5 sürümünden itibaren gelişmiş görünümde dosya aktarım özelliğiyle ilgili ayarların yer aldığı ek bir yapılandırma sayfası mevcut.

source: Directories
tr: Dizinler

source: Default source directory
tr: Varsayılan kaynak dizini

source: This directory will be opened by default when the user starts the file transfer feature and is asked for the files to transfer.
tr: Kullanıcı dosya transfer özelliğini başlattığında ve transfer edilecek dosyalar sorulduğunda bu dizin varsayılan olarak açılacaktır.

source: **Default:** ``%HOME%``
tr: **Varsayılan:** ``%HOME%``

source: Destination directory
tr: Hedef dizin

source: All received files will be saved in this directory on the client side. Change it if you do not want to store received files in root of the user's home directory.
tr: Alınan tüm dosyalar istemci tarafındaki bu dizine kaydedilecektir. Alınan dosyaları kullanıcının ana dizininin kökünde saklamak istemiyorsanız bunu değiştirin.

source: Options
tr: Seçenekler

source: Remember last source directory
tr: Son kaynak dizinini hatırla

source: When the user is asked for files to transfer, the directory which files have been transferred from previously, is opened if this option is enabled. Disable this option to always open the default source directory.
tr: Kullanıcıdan transfer edilecek dosyalar istendiğinde, bu seçenek etkinleştirilmişse dosyaların daha önce transfer edildiği dizin açılır. Varsayılan kaynak dizinini her zaman açmak için bu seçeneği devre dışı bırakın.

source: Create destination directory if it does not exist
tr: Hedef dizin yoksa oluşturun

source: When using a destination directory other than the default one, it may happen that the destination directory does not exist. Keep this option enabled to create it automatically whenever receiving files on the client side.
tr: Varsayılandan farklı bir hedef dizin kullanıldığında, hedef dizinin var olmaması durumu olabilir. İstemci tarafında dosyalar alındığında otomatik olarak oluşturulması için bu seçeneği etkin tutun.

source: Starting with Veyon 4.5, an additional configuration page with settings related to the WebAPI plugin is available in the advanced view.
tr: Veyon 4.5 sürümünden itibaren gelişmiş görünümde WebAPI eklentisiyle ilgili ayarların yer aldığı ek bir yapılandırma sayfası mevcuttur.

source: Enable WebAPI server
tr: WebAPI sunucusunu etkinleştir

source: This option defines whether to start the WebAPI server along with the Veyon Service.
tr: Bu seçenek, Veyon Servisi ile birlikte WebAPI sunucusunun başlatılıp başlatılmayacağını tanımlar.

source: Network port
tr: Ağ bağlantı noktası

source: This setting specifies the network port at which the WebAPI server should listen for incoming requests.
tr: Bu ayar, WebAPI sunucusunun gelen istekleri dinleyeceği ağ bağlantı noktasını belirtir.

source: **Default:** *11080*
tr: **Varsayılan:** *11080*

source: Connection settings
tr: Bağlantı ayarları

source: A connection refers to an authentication resource identified by a connection UUID.
tr: Bağlantı, bir bağlantı UUID'si tarafından tanımlanan bir kimlik doğrulama kaynağını ifade eder.

source: Lifetime
tr: Ömür boyu

source: Every connection is only valid for a certain period of time, regardless of its activity (in contrast to the idle timeout). This value can be changed to configure shorter or longer connection lifetimes.
tr: Her bağlantı, etkinliğinden bağımsız olarak yalnızca belirli bir süre için geçerlidir (boşta kalma zaman aşımının aksine). Bu değer, daha kısa veya daha uzun bağlantı ömürlerini yapılandırmak için değiştirilebilir.

source: **Default:** *3 h*
tr: **Varsayılan:** *3 s*

source: Idle timeout
tr: Boşta kalma zaman aşımı

source: If no request is received for a certain connection for longer than specified by this setting, the connection is closed automatically.
tr: Bu ayar ile belirlenen süreden daha uzun süre belirli bir bağlantı için istek alınmazsa bağlantı otomatik olarak kapatılır.

source: **Default:** *60 s*
tr: **Varsayılan:** *60 s*

source: Authentication timeout
tr: Kimlik doğrulama zaman aşımı

source: This setting determines the time period within which a connection must be successfully authenticated. Unauthenticated connections will be closed automatically when timed out.
tr: Bu ayar, bir bağlantının başarıyla kimlik doğrulamasının yapılması gereken zaman aralığını belirler. Kimliği doğrulanmamış bağlantılar zaman aşımına uğradığında otomatik olarak kapatılır.

source: **Default:** *15 s*
tr: **Varsayılan:** *15 s*

source: Maximum number of open connections
tr: Maksimum açık bağlantı sayısı

source: This setting limits the number of simultaneous open connections, e.g. to mitigate possible denial of service attacks.
tr: Bu ayar, örneğin olası hizmet reddi saldırılarını azaltmak için, aynı anda açık olan bağlantıların sayısını sınırlar.

source: **Default:** *10*
tr: **Varsayılan:** *10*

source: Connection encryption
tr: Bağlantı şifrelemesi

source: Use HTTPS with TLS 1.3 instead of HTTP
tr: HTTP yerine TLS 1.3 ile HTTPS kullanın

source: This option determines whether only HTTPS connections should be allowed instead of HTTP connections. When enabled, appropriate TLS certificate and private key files have to be configured as well.
tr: Bu seçenek, HTTP bağlantıları yerine yalnızca HTTPS bağlantılarına izin verilip verilmeyeceğini belirler. Etkinleştirildiğinde, uygun TLS sertifikası ve özel anahtar dosyalarının da yapılandırılması gerekir.

source: TLS certificate file
tr: TLS sertifika dosyası

source: The path to the TLS certificate file for the HTTPS server.
tr: HTTPS sunucusu için TLS sertifika dosyasının yolu.

source: TLS private key file
tr: TLS özel anahtar dosyası

source: The path to the TLS private key file for the HTTPS server.
tr: HTTPS sunucusu için TLS özel anahtar dosyasının yolu.

source: Path variables
tr: Yol değişkenleri

source: Path variables have to be supplied in the format ``%VARIABLE%`` on all platforms.
tr: Tüm platformlarda yol değişkenlerinin ``%DEĞİŞKEN%`` biçiminde sağlanması gerekir.

source: This variable is expanded to the user-specific directory for application data stored by Veyon, e.g. :file:`...\\User\\AppData\\Veyon` on Windows or :file:`~/.veyon` on Linux.
tr: Bu değişken, Veyon tarafından depolanan uygulama verileri için kullanıcıya özel dizine genişletilir, örneğin Windows'ta :file:`...\\User\\AppData\\Veyon` veya Linux'ta :file:`~/.veyon`.

source: This variable is expanded to the local or redirected Desktop directory of the logged on user, e.g. :file:`C:\\Users\\Admin\\Desktop` on Windows or :file:`/home/admin/Desktop` on Linux (requires Veyon 4.7.3 or newer).
tr: Bu değişken, oturum açmış kullanıcının yerel veya yönlendirilmiş Masaüstü dizinine genişletilir, örneğin Windows'ta :file:`C:\\Users\\Admin\\Desktop` veya Linux'ta :file:`/home/admin/Desktop` (Veyon 4.7.3 veya daha yenisini gerektirir).

source: This variable is expanded to the local or redirected documents directory of the logged on user, e.g. :file:`C:\\Users\\Admin\\Documents` on Windows or :file:`/home/admin/Documents` on Linux (requires Veyon 4.7.3 or newer).
tr: Bu değişken, oturum açmış kullanıcının yerel veya yönlendirilen belgeler dizinine genişletilir, örneğin Windows'ta :file:`C:\\Users\\Admin\\Documents` veya Linux'ta :file:`/home/admin/Documents` (Veyon 4.7.3 veya daha yenisini gerektirir).

source: This variable is expanded to the local or redirected download directory of the logged on user, e.g. :file:`C:\\Users\\Admin\\Downloads` on Windows or :file:`/home/admin/Downloads` on Linux (requires Veyon 4.7.3 or newer).
tr: Bu değişken, oturum açmış kullanıcının yerel veya yönlendirilmiş indirme dizinine genişletilir, örneğin Windows'ta :file:`C:\\Users\\Admin\\Downloads` veya Linux'ta :file:`/home/admin/Downloads` (Veyon 4.7.3 veya daha yenisini gerektirir).

source: This variable is expanded to the system-wide directory for Veyon's application data, e.g. :file:`C:\\ProgramData\\Veyon` on Windows or :file:`/etc/veyon` on Linux.
tr: Bu değişken, Veyon'un uygulama verileri için sistem genelindeki dizine genişletilir, örneğin Windows'ta :file:`C:\\ProgramData\\Veyon` veya Linux'ta :file:`/etc/veyon`.

source: This variable is expanded to the home directory/user profile directory of the logged on user, e.g. :file:`C:\\Users\\Admin` on Windows or :file:`/home/admin` on Linux.
tr: Bu değişken, oturum açmış kullanıcının ana dizinine/kullanıcı profili dizinine genişletilir, örneğin Windows'ta :file:`C:\\Users\\Admin` veya Linux'ta :file:`/home/admin`.

source: This variable is expanded to the hostname of the local computer, allowing to access files in computer-specific directories (requires Veyon 4.7.3 or newer).
tr: Bu değişken yerel bilgisayarın ana bilgisayar adına genişletilir ve bilgisayar özelindeki dizinlerdeki dosyalara erişime izin verir (Veyon 4.7.3 veya daha yenisini gerektirir).

source: This variable is expanded to the local or redirected pictures directory of the logged on user, e.g. :file:`C:\\Users\\Admin\\Pictures` on Windows or :file:`/home/admin/Pictures` on Linux (requires Veyon 4.7.3 or newer).
tr: Bu değişken, oturum açmış kullanıcının yerel veya yönlendirilmiş resimler dizinine genişletilir, örneğin Windows'ta :file:`C:\\Users\\Admin\\Pictures` veya Linux'ta :file:`/home/admin/Pictures` (Veyon 4.7.3 veya daha yenisini gerektirir).

source: This variable is expanded to the user-specific directory for temporary files, e.g. :file:`...\\User\\AppData\\Local\\Temp` on Windows or :file:`/tmp` (or any path specified in the :envvar:`$TMPDIR` environment variable) on Linux. Processes running with system privileges (Veyon Service, Veyon Server and all sub processes) use :file:`C:\\Windows\\Temp` on Windows and :file:`/tmp` on Linux.
tr: Bu değişken, geçici dosyalar için kullanıcıya özgü dizine genişletilir, örneğin Windows'ta :file:`...\\User\\AppData\\Local\\Temp` veya Linux'ta :file:`/tmp` (veya :envvar:`$TMPDIR` ortam değişkeninde belirtilen herhangi bir yol). Sistem ayrıcalıklarıyla çalışan işlemler (Veyon Service, Veyon Server ve tüm alt işlemler) Windows'ta :file:`C:\\Windows\\Temp` ve Linux'ta :file:`/tmp` kullanır.

source: This variable is expanded to the local or redirected videos directory of the logged on user, e.g. :file:`C:\\Users\\Admin\\Videos` on Windows or :file:`/home/admin/Videos` on Linux (requires Veyon 4.7.3 or newer).
tr: Bu değişken, oturum açmış kullanıcının yerel veya yönlendirilmiş videolar dizinine genişletilir, örneğin Windows'ta :file:`C:\\Users\\Admin\\Videos` veya Linux'ta :file:`/home/admin/Videos` (Veyon 4.7.3 veya daha yenisini gerektirir).

source: Environment variables
tr: Ortam değişkenleri

source: Veyon evaluates various optional environment variables allowing to override default settings for runtime settings such as session ID, log level and authentication keys to use.
tr: Veyon, oturum kimliği, günlük düzeyi ve kullanılacak kimlik doğrulama anahtarları gibi çalışma zamanı ayarları için varsayılan ayarları geçersiz kılmaya olanak tanıyan çeşitli isteğe bağlı ortam değişkenlerini değerlendirir.

source: This variable allows explicitly specifying the name of the authentication key to use in case multiple authentication keys are available. This can be used to override the default behaviour of Veyon Master which uses the first readable private key even if multiple private key files are available.
tr: Bu değişken, birden fazla kimlik doğrulama anahtarı mevcut olduğunda kullanılacak kimlik doğrulama anahtarının adını açıkça belirtmeye olanak tanır. Bu, birden fazla özel anahtar dosyası mevcut olsa bile ilk okunabilir özel anahtarı kullanan Veyon Master'ın varsayılan davranışını geçersiz kılmak için kullanılabilir.

source: This variable allows overriding the configured log level at runtime, e.g. for debugging purposes.
tr: Bu değişken, çalışma zamanında yapılandırılmış günlük düzeyinin geçersiz kılınmasına örneğin hata ayıklama amaçları için olanak tanır.

source: This variable allows overriding the session ID and is evaluated by Veyon Server. When multi session mode (multiple local and remote sessions on the same host) is enabled each Veyon Server instance has to use distinct network numbers for not conflicting with other instances. A server therefore adds the numerical value of this environment variable to the configured :ref:`network port numbers <RefNetworkPortNumbers>` to determine the port numbers to use. In the :ref:`RefNetworkObjectDirectory` the absolute port (Veyon server port + session ID) must be specified along with the computer/IP address, e.g. ``192.168.2.3:11104``.
tr: Bu değişken oturum kimliğinin geçersiz kılınmasına izin verir ve Veyon Server tarafından değerlendirilir. Çoklu oturum modu (aynı ana bilgisayarda birden fazla yerel ve uzak oturum) etkinleştirildiğinde, her Veyon Server örneği diğer örneklerle çakışmamak için ayrı ağ numaraları kullanmalıdır. Bu nedenle bir sunucu, kullanılacak bağlantı noktası numaralarını belirlemek için bu ortam değişkeninin sayısal değerini yapılandırılmış :ref:`ağ bağlantı noktası numaraları <RefNetworkPortNumbers>`e ekler. :ref:`RefNetworkObjectDirectory`'de mutlak bağlantı noktası (Veyon server bağlantı noktası + oturum kimliği) bilgisayar/IP adresiyle birlikte belirtilmelidir, örn. ``192.168.2.3:11104``.

source: Authentication method
tr: Kimlik doğrulama yöntemi

source: Network objects
tr: Ağ nesneleri

source: Network object directory backend
tr: Ağ nesnesi dizini arka ucu

source: Network object directory update interval
tr: Ağ nesnesi dizin güncelleme aralığı

source: User groups backend
tr: Kullanıcı grupları arka ucu

source: Domain groups
tr: Etki alanı grupları

source: Standard error output
tr: Standart hata çıktısı

source: Windows event log
tr: Windows olay günlüğü

source: Program version
tr: Program sürümü

source: Blocked access notification
tr: Engellenen erişim bildirimi

source: Unauthorized access
tr: Yetkisiz erişim

source: Remote connection notification
tr: Uzaktan bağlantı bildirimi

source: System service
tr: Sistem hizmeti

source: Sessions
tr: Oturumlar

source: Session settings
tr: Oturum ayarları

source: Terminal server
tr: Terminal sunucusu

source: Remote desktop server
tr: Uzak masaüstü sunucusu

source: Local session mode
tr: Yerel oturum modu

source: Active session mode
tr: Aktif oturum modu

source: Multi session mode
tr: Çoklu oturum modu

source: Port numbers
tr: Bağlantı noktası numaraları

source: Veyon Server port number
tr: Veyon Sunucusu bağlantı noktası numarası

source: Internal VNC server port number
tr: Dahili VNC sunucusu bağlantı noktası numarası

source: Feature manager port number
tr: Özellik yöneticisi bağlantı noktası numarası

source: Demo server port number
tr: Gösteri sunucusu bağlantı noktası numarası

source: Firewall exception
tr: Güvenlik duvarı istisnası

source: Firewall
tr: Güvenlik Duvarı

source: Windows firewall
tr: Windows güvenlik duvarı

source: localhost
tr: yerel ana bilgisayar

source: External VNC server
tr: Harici VNC sunucu

source: Image quality
tr: Görüntü kalitesi

source: Current location
tr: Mevcut konum

source: Computer thumbnail size
tr: Bilgisayar küçük resim boyutu

source: Thumbnail size
tr: Küçük resim boyutu

source: Computer select panel
tr: Bilgisayar seçim paneli

source: Empty locations
tr: Boş lokasyonlar

source: Computer filter
tr: Bilgisayar filtresi

source: Expand locations
tr: Konumları genişlet

source: Double click
tr: Çift tıklama

source: Authorized user groups
tr: Yetkili kullanıcı grupları

source: Application data
tr: Uygulama verileri

source: User profile directory
tr: Kullanıcı profili dizini

source: Home directory
tr: Ana dizin

source: Temporary files
tr: Geçici dosyalar

source: Desktop directory
tr: Masaüstü dizini

source: Documents directory
tr: Belgeler dizini

source: Downloads directory
tr: İndirme dizini

source: Pictures directory
tr: Resim dizini

source: Videos directory
tr: Videolar dizini

source: Release notes
tr: Sürüm notları

source: This chapter contains information on changes in different Veyon release series. You should read them carefully before upgrading from an older version of Veyon. If not migrated properly, using newer versions of Veyon with old settings in the worst case can lead to security issues such as misbehaving access control rules.
tr: Bu bölüm farklı Veyon sürüm serilerindeki değişiklikler hakkında bilgi içerir. Veyon'un eski bir sürümünden yükseltme yapmadan önce bunları dikkatlice okumalısınız. Doğru şekilde taşınmaz ise, eski ayarlarla yeni Veyon sürümlerini kullanmak en kötü ihtimalle erişim kontrol kurallarının kötü davranması gibi güvenlik sorunlarına yol açabilir.

source: Release notes for the individual releases can be found at the `Veyon releases page <https://github.com/veyon/veyon/releases>`_.
tr: Bireysel sürümlerin sürüm notlarına `Veyon sürümleri sayfası <https://github.com/veyon/veyon/releases>`_ adresinden ulaşılabilir.

source: Upgrading configuration
tr: Yapılandırmayı yükseltme

source: Due to changes in Veyon and its plugins it may happen that both configuration keys and values change between the release series of Veyon. In general Veyon has builtin mechanisms to read old configuration keys and values and migrate them internally at runtime. This ensures that Veyon keeps running normally after upgrading the software only. It is still highly recommended to always upgrade the Veyon configuration stored in the system. This can be done in two ways:
tr: Veyon ve eklentilerindeki değişiklikler nedeniyle, Veyon'un sürüm serileri arasında hem yapılandırma anahtarlarının hem de değerlerinin değişmesi söz konusu olabilir. Genel olarak Veyon, eski yapılandırma anahtarlarını ve değerlerini okumak ve bunları çalışma zamanında dahili olarak taşımak için yerleşik mekanizmalara sahiptir. Bu, Veyon'un yalnızca yazılımı yükselttikten sonra normal şekilde çalışmaya devam etmesini sağlar. Sistemde saklanan Veyon yapılandırmasını her zaman yükseltmeniz şiddetle önerilir. Bu iki şekilde yapılabilir:

source: Open Veyon Configurator and click the :guilabel:`Apply` button to save and apply the runtime-migrated configuration permanently.
tr: Veyon Yapılandırıcıyı açın ve çalışma zamanından geçirilen yapılandırmayı kalıcı olarak kaydetmek ve uygulamak için :guilabel:`Uygula` düğmesine tıklayın.

source: Use the :ref:`CommandLineInterface` to upgrade the configuration through the :ref:`upgrade command of the config module <CLIConfigUpgrade>`.
tr: Yapılandırmayı :ref:`config modülü <CLIConfigUpgrade>'in upgrade komutu` aracılığıyla yükseltmek için :ref:`CommandLineInterface` komutunu kullanın.

source: If not using the second method in an automated manner on all computers, the upgraded configuration needs to be :ref:`exported to all other computers <ConfImportExport>` afterwards.
tr: İkinci yöntem tüm bilgisayarlarda otomatik olarak kullanılmıyorsa, yükseltilen yapılandırmanın daha sonra diğer tüm bilgisayarlara<ConfImportExport> :ref:`aktarılması` gerekir.

source: If configuration keys are renamed, the old keys are always kept for compatibility reasons allowing to switch back to a previous version more easily. There'll be a clean up mechanism in a future release which will remove all legacy configuration keys.
tr: Yapılandırma anahtarları yeniden adlandırılırsa, uyumluluk nedenleriyle eski anahtarlar her zaman saklanır ve bu da önceki bir sürüme daha kolay geri dönülmesine olanak tanır. Gelecekteki bir sürümde tüm eski yapılandırma anahtarlarını kaldıracak bir temizleme mekanizması olacak.
