Repository: veyon/docs
Catalog: locale/*/LC_MESSAGES/admin.po
Languages: tr

source: This command lists all available authentication keys in the configured key directory. If the ``details`` option is specified a table with key details will be displayed instead. Some details might be missing if a key is not accessible e.g. due to the lack of read permissions.
tr: Bu komut yapılandırılmış anahtar dizinindeki tüm kullanılabilir kimlik doğrulama anahtarlarını listeler. ``details`` seçeneği belirtilirse bunun yerine anahtar ayrıntılarının bulunduğu bir tablo görüntülenir. Bir anahtar erişilebilir değilse örneğin okuma izinlerinin olmaması nedeniyle bazı ayrıntılar eksik olabilir.

source: This command adjusts file access permissions to <KEY> so that only the user group <ACCESS GROUP> has read access to it.
tr: Bu komut, dosya erişim izinlerini <KEY>yalnızca kullanıcı grubunun<ACCESS GROUP> okuma erişimine sahip olmasını sağlayacak şekilde ayarlar.

source: Configuration management
tr: Yapılandırma yönetimi

source: The local Veyon configuration can be managed using the ``config`` module. Both the complete configuration as individual configuration keys can be read or written.
tr: Yerel Veyon yapılandırması ``config`` modülü kullanılarak yönetilebilir. Hem tam yapılandırma hem de bireysel yapılandırma anahtarları okunabilir veya yazılabilir.

source: This command resets the entire local configuration by deleting all configuration keys. Use this command to recreate a defined state without old settings before importing a configuration.
tr: Bu komut tüm yapılandırma anahtarlarını silerek tüm yerel yapılandırmayı sıfırlar. Bir yapılandırmayı içe aktarmadan önce eski ayarlar olmadan tanımlanmış bir durumu yeniden oluşturmak için bu komutu kullanın.

source: This command exports the local configuration to a file. The name of the destination file must be specified as an additional parameter:
tr: Bu komut yerel yapılandırmayı bir dosyaya aktarır. Hedef dosyanın adı ek bir parametre olarak belirtilmelidir:

source: This command imports a previously exported configuration file into the local configuration. The name of the configuration file to be imported must be specified as an additional argument:
tr: Bu komut daha önce dışa aktarılmış bir yapılandırma dosyasını yerel yapılandırmaya içe aktarır. İçe aktarılacak yapılandırma dosyasının adı ek bir argüman olarak belirtilmelidir:

source: This command shows a list of all configuration keys and their corresponding values. This way you can get the names of the configuration keys in order to read or write them individually via the ``get`` or ``set`` commands. When additionally specifying ``defaults`` the default value for each configuration key is printed instead of the actual configured value. Alternatively the data types of the configuration keys can be inspected by specifying ``types``.
tr: Bu komut tüm yapılandırma anahtarlarının ve bunlara karşılık gelen değerlerin bir listesini gösterir. Bu şekilde, yapılandırma anahtarlarının adlarını, ``get`` veya ``set`` komutları aracılığıyla ayrı ayrı okumak veya yazmak için alabilirsiniz. Ek olarak ``defaults`` belirtildiğinde, gerçek yapılandırılmış değer yerine her yapılandırma anahtarı için varsayılan değer yazdırılır. Alternatif olarak, yapılandırma anahtarlarının veri türleri ``types`` belirtilerek incelenebilir.

source: This command allows reading a single configuration key. The name of the key must be supplied as a parameter.
tr: Bu komut tek bir yapılandırma anahtarının okunmasına izin verir. Anahtarın adı bir parametre olarak sağlanmalıdır.

source: This command can be used to write a single configuration key. The name of the key and the desired value must be passed as additional arguments:
tr: Bu komut tek bir yapılandırma anahtarı yazmak için kullanılabilir. Anahtarın adı ve istenen değer ek argümanlar olarak geçirilmelidir:

source: With this command a single configuration key can be deleted, i.e. Veyon then uses the internal default value. The name of the key must be passed as an additional argument:
tr: Bu komutla tek bir yapılandırma anahtarı silinebilir, yani Veyon daha sonra dahili varsayılan değeri kullanır. Anahtarın adı ek bir argüman olarak geçirilmelidir:

source: With this command the configuration of Veyon and all plugins can be updated and saved. This may be necessary if settings or configuration formats have changed due to program or plugin updates.
tr: Bu komutla Veyon ve tüm eklentilerin yapılandırması güncellenebilir ve kaydedilebilir. Bu, program veya eklenti güncellemeleri nedeniyle ayarlar veya yapılandırma biçimleri değişmişse gerekli olabilir.

source: Feature control
tr: Özellik denetimi

source: The ``feature`` module provides commands for querying available features and controlling them on remote computers.
tr: ``Feature`` modülü, uzak bilgisayarlarda mevcut özellikleri sorgulamak ve kontrol etmek için komutlar sağlar.

source: Displays a list with the names of all available features.
tr: Mevcut tüm özelliklerin adlarını içeren bir liste görüntüler.

source: Displays a table with detailed information about all available features. This information include a description, the UID, the name of the plugin providing the respective feature and some other implementation-related details.
tr: Mevcut tüm özellikler hakkında ayrıntılı bilgi içeren bir tablo görüntüler. Bu bilgiler bir açıklama, UID, ilgili özelliği sağlayan eklentinin adı ve diğer bazı uygulamayla ilgili ayrıntıları içerir.

source: Starts the specified feature on the specified host by connecting to the Veyon Server running remotely. The feature can be specified by name or UID. Use the ``show`` command to see all available features. Depending on the feature, additional arguments (such as the text message to display) encoded as a single JSON string have to be specified. Please refer to the developer documentation for more information
tr: Belirtilen özelliği belirtilen ana bilgisayarda uzaktan çalışan Veyon Sunucusuna bağlanarak başlatır. Özellik, ad veya UID ile belirtilebilir. Tüm kullanılabilir özellikleri görmek için ``show`` komutunu kullanın. Özelliğe bağlı olarak, tek bir JSON dizesi olarak kodlanmış ek argümanlar (görüntülenecek metin mesajı gibi) belirtilmelidir. Daha fazla bilgi için lütfen geliştirici belgelerine bakın

source: Stops the specified feature on the specified host by connecting to the Veyon Server running remotely. The feature can be specified by name or UID. Use the ``show`` command to see all available features.
tr: Uzaktan çalışan Veyon Sunucusuna bağlanarak belirtilen ana bilgisayarda belirtilen özelliği durdurur. Özellik ad veya UID ile belirtilebilir. Kullanılabilir tüm özellikleri görmek için ``show`` komutunu kullanın.

source: The commands available in the ``ldap`` module are documented in section :ref:`LDAPCLI` in chapter :ref:`LDAP`.
tr: ``ldap`` modülünde kullanılabilen komutlar :ref:`LDAP` bölümündeki :ref:`LDAPCLI` bölümünde belgelenmiştir.

source: Network object directory
tr: Ağ nesnesi dizini

source: As described in the section :ref:`ConfLocationsAndComputers`, Veyon provides a built-in network object directory that can be used when no LDAP server is available. This network object directory can be managed in the Veyon Configurator as well as on the command line. Certain operations such as CSV import are currently only available on the command line. For most commands, a detailed description with examples is available in the command-specific help. The following commands can be used in the ``networkobjects`` module:
tr: :ref:`ConfLocationsAndComputers` bölümünde açıklandığı gibi, Veyon, LDAP sunucusu mevcut olmadığında kullanılabilen yerleşik bir ağ nesnesi dizini sağlar. Bu ağ nesnesi dizini, Veyon Configurator'da ve komut satırında yönetilebilir. CSV içe aktarma gibi belirli işlemler şu anda yalnızca komut satırında kullanılabilir. Çoğu komut için, örneklerle birlikte ayrıntılı bir açıklama komuta özgü yardımda mevcuttur. Aşağıdaki komutlar ``networkobjects`` modülünde kullanılabilir:

source: This command adds an object, where ``<TYPE>`` can be ``location`` or ``computer``. ``<PARENT>`` can be specified as name or UUID.
tr: Bu komut bir nesne ekler; burada ``<TYPE>`` ``konum`` veya ``bilgisayar`` olabilir. ``<PARENT>`` ise isim veya UUID olarak belirtilebilir.

source: This command resets the entire network object directory, i.e. all locations and computers are removed. This operation is particularly useful before any automated import.
tr: Bu komut tüm ağ nesnesi dizinini sıfırlar, yani tüm konumlar ve bilgisayarlar kaldırılır. Bu işlem özellikle otomatik içe aktarmadan önce faydalıdır.

source: This command outputs the complete network object directory as a flat table. Each property such as object UID, type or name is displayed as a separate column.
tr: Bu komut, tam ağ nesnesi dizinini düz bir tablo olarak çıktı olarak verir. Nesne UID'si, türü veya adı gibi her özellik ayrı bir sütun olarak görüntülenir.

source: This command can be used to export either the complete network object directory or only the specified location to a text file. The formatting can be controlled via a format string containing placeholder variables. This allows generating CSV file easily. Valid variables are ``%type%``, ``%name%``, ``%host%``, ``%mac%`` and ``%location%``. Various examples are given in the command help (``veyon-cli networkobjects help export``).
tr: Bu komut, tam ağ nesnesi dizinini veya yalnızca belirtilen konumu bir metin dosyasına aktarmak için kullanılabilir. Biçimlendirme, yer tutucu değişkenleri içeren bir biçim dizesi aracılığıyla kontrol edilebilir. Bu, CSV dosyasının kolayca oluşturulmasını sağlar. Geçerli değişkenler ``%type%``, ``%%name%``, ``%host%``, ``%mac%`` ve ``%location%``'dir. Komut yardımında (``veyon-cli networkobjects help export``) çeşitli örnekler verilmiştir.

source: When using this command in batch files or through scheduled tasks on Windows make sure to properly escape the percent sign, i.e. use ``%%type%%`` instead of ``%type%``. Otherwise the individual parts of the format strings will be treated as environment variables and substituted with empty strings in most cases. This will lead to unexpected parse errors.
tr: Bu komutu toplu iş dosyalarında veya Windows'ta zamanlanmış görevler aracılığıyla kullanırken yüzde işaretini düzgün bir şekilde atladığınızdan emin olun, yani ``%type%`` yerine ``%%type%%`` kullanın. Aksi takdirde biçim dizelerinin bireysel parçaları ortam değişkenleri olarak ele alınacak ve çoğu durumda boş dizelerle değiştirilecektir. Bu, beklenmeyen ayrıştırma hatalarına yol açacaktır.

source: This command can be used to import a text file into the network object directory. The processing of the input data can be controlled via a format string or a regular expression containing placeholder variables. This way both CSV files and other types of structured data can be imported. Valid variables are ``%type%``, ``%name%``, ``%host%``, ``%mac%`` and ``%location%``. Various examples are given in the command help (``veyon-cli networkobjects help import``).
tr: Bu komut, bir metin dosyasını ağ nesnesi dizinine aktarmak için kullanılabilir. Giriş verilerinin işlenmesi, bir biçim dizesi veya yer tutucu değişkenler içeren bir düzenli ifade aracılığıyla kontrol edilebilir. Bu şekilde hem CSV dosyaları hem de diğer yapılandırılmış veri türleri içe aktarılabilir. Geçerli değişkenler ``%type%``, ``%name%``, ``%host%``, ``%mac%`` ve ``%location%``'dir. Komut yardımında (``veyon-cli networkobjects help import``) çeşitli örnekler verilmiştir.

source: This command prints the complete network object directory as a formatted list. Unlike the ``dump`` command, the hierarchy of locations and computers is represented by appropriate formatting.
tr: Bu komut, tam ağ nesnesi dizinini biçimlendirilmiş bir liste olarak yazdırır. ``dump`` komutunun aksine, konumlar ve bilgisayarlar hiyerarşisi uygun biçimlendirmeyle temsil edilir.

source: This command removes the specified object from the directory. OBJECT can be specified by name or UUID. Removing a location will also remove all related computers.
tr: Bu komut belirtilen nesneyi dizinden kaldırır. OBJECT, ad veya UUID ile belirtilebilir. Bir konumu kaldırmak, ilgili tüm bilgisayarları da kaldıracaktır.

source: Power
tr: Güç

source: The ``power`` module allows using power-related functions from the command line.
tr: ``Power`` modülü komut satırından güçle ilgili fonksiyonların kullanılmasına olanak tanır.

source: This command broadcasts a Wake-on-LAN (WOL) packet to the network in order to power on the computer with the given MAC address.
tr: Bu komut, verilen MAC adresine sahip bilgisayarı ağ üzerinden uyandırmak için Ağdan-Uyandırma (WOL) paketi yayımlar

source: Remote access
tr: Uzaktan erişim

source: The ``remoteaccess`` module provides functions for a graphical remote access to computers. These are the same functions that can be accessed from the Veyon Master. The function provided by the command line tool can be used for example to create an program shortcut for direct access to a specific computer.
tr: ``remoteaccess`` modülü, bilgisayarlara grafiksel uzaktan erişim için işlevler sağlar. Bunlar, Veyon Master'dan erişilebilen işlevlerle aynıdır. Komut satırı aracının sağladığı işlev, örneğin belirli bir bilgisayara doğrudan erişim için bir program kısayolu oluşturmak için kullanılabilir.

source: This command opens a window with the remote control function that can be used to control a remote computer. The computer name or IP address (and optionally the TCP port) must be passed as an argument:
tr: Bu komut, uzak bir bilgisayarı kontrol etmek için kullanılabilen uzaktan kontrol işlevine sahip bir pencere açar. Bilgisayar adı veya IP adresi (ve isteğe bağlı olarak TCP portu) bir argüman olarak geçirilmelidir:

source: This command opens a window with the remote view function to monitor a remote computer. In this mode the screen content is displayed in real time, but interaction with the computer is not possible until the corresponding button on the tool bar has been clicked. The computer or IP address (and optionally the TCP port) has to be passed as an argument:
tr: Bu komut, uzak bir bilgisayarı izlemek için uzaktan görüntüleme işlevine sahip bir pencere açar. Bu modda ekran içeriği gerçek zamanlı olarak görüntülenir, ancak araç çubuğundaki ilgili düğmeye tıklanana kadar bilgisayarla etkileşim mümkün değildir. Bilgisayar veya IP adresi (ve isteğe bağlı olarak TCP portu) bir argüman olarak geçirilmelidir:

source: Service control
tr: Hizmet kontrolü

source: The ``service`` module can be used to control the local Veyon Service.
tr: ``Service`` modülü yerel Veyon Servisini kontrol etmek için kullanılabilir.

source: This command registers the Veyon Service as a service in the operating system so that it is automatically started when the computer boots.
tr: Bu komut, Veyon Servisini işletim sisteminde bir servis olarak kaydeder, böylece bilgisayar başlatıldığında otomatik olarak başlatılır.

source: This command removes the service registration in the operating system so that the Veyon Service is no longer automatically started at boot time.
tr: Bu komut işletim sistemindeki servis kaydını kaldırır, böylece Veyon Servisi artık önyükleme sırasında otomatik olarak başlatılmaz.

source: This command starts the Veyon Service.
tr: Bu komut Veyon Servisini başlatır.

source: This command stops the Veyon Service.
tr: Bu komut Veyon Servisini durdurur.

source: This command restarts the Veyon Service.
tr: Bu komut Veyon Servisini yeniden başlatır.

source: This command queries and displays the status of the Veyon Service.
tr: Bu komut Veyon Servisinin durumunu sorgular ve görüntüler.

source: Shell
tr: Kabuk

source: Simple shell functionalities are provided by the ``shell`` module. If this module is called without further arguments, an interactive mode is started. In this mode, all CLI commands can be entered directly without having to specify and call the ``veyon-cli`` program for each command. The mode can be left by entering the keyword ``exit``.
tr: Basit kabuk işlevleri ``shell`` modülü tarafından sağlanır. Bu modül başka argümanlar olmadan çağrılırsa, etkileşimli bir mod başlatılır. Bu modda, tüm CLI komutları her komut için ``veyon-cli`` programını belirtmeye ve çağırmaya gerek kalmadan doğrudan girilebilir. Moddan ``exit`` anahtar sözcüğü girilerek çıkılabilir.

source: Furthermore the module can be used for automated processing of commands in a text file in order to implement simple batch processing:
tr: Ayrıca modül, basit toplu işlemleri uygulamak amacıyla bir metin dosyasındaki komutların otomatik olarak işlenmesi için de kullanılabilir:

source: This command executes the commands specified in the text file line by line. Operations are executed independently of the result of previous operations, i.e. an error does not lead to termination.
tr: Bu komut, metin dosyasında belirtilen komutları satır satır yürütür. İşlemler, önceki işlemlerin sonucundan bağımsız olarak yürütülür, yani bir hata sonlandırmaya yol açmaz.

source: Command line tool
tr: Komut satırı aracı

source: Command line
tr: Komut satırı

source: Configuration key
tr: Yapılandırma anahtarı

source: List features
tr: Özellikleri listele

source: Service registration
tr: Hizmet kaydı

source: Configuration
tr: Yapılandırma

source: To begin with the setup, start the Veyon Configurator if this has not already been done automatically after the installation. With this program a local Veyon installation can be set up and customized. The graphical user interface is divided into different topic- or component-related configuration pages. Depending on the installed plugins there may be additional configuration pages.
tr: Kuruluma başlamak için, kurulumdan sonra otomatik olarak yapılmadıysa Veyon Configurator'ı başlatın. Bu programla yerel bir Veyon kurulumu ayarlanabilir ve özelleştirilebilir. Grafiksel kullanıcı arayüzü farklı konu veya bileşenle ilgili yapılandırma sayfalarına ayrılmıştır. Yüklenen eklentilere bağlı olarak ek yapılandırma sayfaları olabilir.

source: The :ref:`ConfigurationReference` describes all configuration pages and configuration options with their individual definitions and possible configuration values.
tr: :ref:`ConfigurationReference` tüm yapılandırma sayfalarını ve yapılandırma seçeneklerini, bunların bireysel tanımları ve olası yapılandırma değerleriyle açıklar.

source: Overview
tr: Genel Bakış

source: The basic settings on the configuration page :ref:`RefGeneral` apply to all :ref:`components` of Veyon. These include settings for the :ref:`RefUserInterface`, :ref:`RefLogging`, :ref:`RefAuthentication` as well as the :ref:`RefNetworkObjectDirectory` which stores the locations and computers displayed in the Veyon Master.
tr: Yapılandırma sayfasındaki :ref:`RefGeneral` temel ayarlar, Veyon'un tüm :ref:`bileşenleri` için geçerlidir. Bunlara :ref:`RefUserInterface`, :ref:`RefLogging`, :ref:`RefAuthentication` ve Veyon Master'da görüntülenen konumları ve bilgisayarları depolayan :ref:`RefNetworkObjectDirectory` ayarları dahildir.

source: The settings on the configuration page :ref:`RefService` influence the functionality of the Veyon Service and are used for fine-tuning and adaptation to implement special application scenarios. For smooth operation the default settings should normally not be changed.
tr: Yapılandırma sayfasındaki ayarlar :ref:`RefService` Veyon Hizmetinin işlevselliğini etkiler ve özel uygulama senaryolarını uygulamak için ince ayar ve uyarlama için kullanılır. Sorunsuz bir çalışma için varsayılan ayarlar normalde değiştirilmemelidir.

source: All settings on configuration page :ref:`RefMaster` only affect the behavior and functions of the Veyon Master application and apply system-wide for all users.
tr: :ref:`RefMaster` yapılandırma sayfasındaki tüm ayarlar yalnızca Veyon Master uygulamasının davranışlarını ve işlevlerini etkiler ve sistem genelinde tüm kullanıcılar için geçerlidir.

source: For a quick start to get to know the software you only need to add a location and individual computers on configuration page :ref:`ConfLocationsAndComputers`. After the configuration has been :ref:`exported to all computers <ConfImportExport>` the Veyon Master application can already be started and used. It should be ensured that the user used at logon exists with the same password on all computers.
tr: Yazılımı tanımak için hızlı bir başlangıç ​​için yapılandırma sayfasında :ref:`ConfLocationsAndComputers` bir konum ve tek tek bilgisayarlar eklemeniz yeterlidir. Yapılandırma :ref:`tüm bilgisayarlara aktarıldıktan sonra <ConfImportExport>` Veyon Master uygulaması başlatılabilir ve kullanılabilir. Oturum açma sırasında kullanılan kullanıcının tüm bilgisayarlarda aynı parola ile bulunduğundan emin olunmalıdır.

source: Authentication
tr: Kimlik doğrulama

source: In order to access a computer running the Veyon Service the accessing user must first authenticate himself, i.e. he has to prove his identity and usage authorization. Otherwise unrestricted access from any user to any computer running the Veyon Service would be possible. Access without authentication is not supported. The setup is done via the configuration page :ref:`RefGeneral` in section :ref:`RefAuthentication` in Veyon Configurator.
tr: Veyon Servisini çalıştıran bir bilgisayara erişmek için, erişen kullanıcı önce kendini doğrulamalıdır, yani kimliğini ve kullanım yetkisini kanıtlamalıdır. Aksi takdirde, herhangi bir kullanıcıdan Veyon Servisini çalıştıran herhangi bir bilgisayara sınırsız erişim mümkün olacaktır. Kimlik doğrulaması olmadan erişim desteklenmez. Kurulum, Veyon Configurator'daki :ref:`RefAuthentication` bölümündeki :ref:`RefGeneral` yapılandırma sayfası üzerinden yapılır.

source: Authentication methods
tr: Kimlik doğrulama yöntemleri

source: Basically Veyon offers two different authentication methods: key file authentication and logon authentication.
tr: Veyon temel olarak iki farklı kimlik doğrulama yöntemi sunuyor: anahtar dosyası kimlik doğrulaması ve oturum açma kimlik doğrulaması.

source: **Key file authentication** is based on `Public-Key-Cryptography <https://en.wikipedia.org/wiki/Public-key_cryptography>`_, meaning that a public key and a associated private key are used. Only certain users may have access to the private key. On each connection request the Veyon Service sends a random character sequence to Veyon Master, which Veyon Master has to sign cryptographically using the private key. The signature is sent back to the Veyon Service and verified with the corresponding public key. This verification only succeeds if the signature was generated with the appropriate private key. The authenticity of the counterpart is then guaranteed. If the signature verification fails, the connection is closed.
tr: **Anahtar dosyası kimlik doğrulaması** `Public-Key-Cryptography <https://tr.wikipedia.org/wiki/Açık_anahtarlı_şifreleme>`_ temeline dayanır, yani bir genel anahtar ve ilişkili bir özel anahtar kullanılır. Özel anahtara yalnızca belirli kullanıcılar erişebilir. Her bağlantı isteğinde Veyon Servisi, Veyon Master'a rastgele bir karakter dizisi gönderir ve Veyon Master bunu özel anahtarı kullanarak kriptografik olarak imzalamak zorundadır. İmza Veyon Servisine geri gönderilir ve karşılık gelen genel anahtarla doğrulanır. Bu doğrulama yalnızca imza uygun özel anahtarla oluşturulmuşsa başarılı olur. Karşı tarafın gerçekliği daha sonra garanti edilir. İmza doğrulaması başarısız olursa, bağlantı kapatılır.
