Repository: veyon/docs
Catalog: locale/*/LC_MESSAGES/admin.po
Languages: tr

source: Access control rules
tr: Erişim denetim kuralları

source: Introduction
tr: Giriş

source: Access control rules can be used to provide detailed control over which users can access specific computers under specific circumstances. In the following, the term *rule* is used as a synonym for *access control rule*.
tr: Erişim kontrol kuralları, belirli koşullar altında hangi kullanıcıların belirli bilgisayarlara erişebileceği konusunda ayrıntılı kontrol sağlamak için kullanılabilir. Aşağıda, *kural* terimi *erişim kontrol kuralı* için eşanlamlı olarak kullanılmıştır.

source: When a user attempts to access a computer, the defined access control rules are processed one after another until all conditions of a rule apply. As soon as all activated conditions of a rule apply, no further rules are processed and the stored action is executed (exception: rule is disabled).
tr: Bir kullanıcı bir bilgisayara erişmeye çalıştığında, tanımlanmış erişim kontrol kuralları, bir kuralın tüm koşulları uygulanana kadar birbiri ardına işlenir. Bir kuralın tüm etkinleştirilmiş koşulları uygulandığı anda, başka kural işlenmez ve saklanan eylem yürütülür (istisna: kural devre dışıdır).

source: The rules can be configured through the Veyon Configurator on the configuration page :ref:`ConfAccessControl` in section :guilabel:`Access control rules`. The rules list is empty by default. In this case, all access attempts are denied since there is no rule that explicitly allows access. This means that at least one rule must be defined that allows access under certain conditions.
tr: Kurallar, yapılandırma sayfası :ref:`ConfAccessControl` bölümündeki :guilabel:`Erişim kontrol kuralları` bölümünde Veyon Yapılandırıcısı aracılığıyla yapılandırılabilir. Kurallar listesi varsayılan olarak boştur. Bu durumda, erişime açıkça izin veren bir kural olmadığından tüm erişim girişimleri reddedilir. Bu, belirli koşullar altında erişime izin veren en az bir kuralın tanımlanması gerektiği anlamına gelir.

source: Add and modify rules
tr: Kuralları ekle ve değiştir

source: Upon clicking the button :guilabel:`+` a dialog opens which allows the creation of a new rule. Existing rules can be opened or edited by double-clicking them or by clicking the button with the pen symbol.
tr: :guilabel:`+` butonuna tıklandığında yeni bir kural oluşturulmasına izin veren bir iletişim kutusu açılır. Mevcut kurallar, üzerlerine çift tıklanarak veya kalem sembolü olan butona tıklanarak açılabilir veya düzenlenebilir.

source: A rule basically consists of general settings, conditions and an action that is executed when all conditions apply. The dialog is divided into three sections. The meanings of the individual options in the various dialog sections are explained below.
tr: Bir kural temel olarak genel ayarlardan, koşullardan ve tüm koşullar geçerli olduğunda yürütülen bir eylemden oluşur. İletişim kutusu üç bölüme ayrılmıştır. Çeşitli iletişim kutusu bölümlerindeki bireysel seçeneklerin anlamları aşağıda açıklanmıştır.

source: General
tr: Genel

source: A name for the rule should be defined in input field :guilabel:`Rule name` first. The name is later used to identify the rule and is displayed in the rules list. For documentation purposes an optional description can be added to the :guilabel:`Rule description` input field.
tr: Kural için bir ad, önce giriş alanı :guilabel:`Kural adı`nda tanımlanmalıdır. Ad daha sonra kuralı tanımlamak için kullanılır ve kurallar listesinde görüntülenir. Belgeleme amaçları için :guilabel:`Kural açıklaması` giriş alanına isteğe bağlı bir açıklama eklenebilir.

source: The option :guilabel:`Always process rule and ignore conditions` causes the conditions set below not to be examined for rule processing and the set action is always executed. This particularly useful for fallback rules at the bottom of the rules list, where you can specify that the logged on user is asked for permission if no other rules apply.
tr: :guilabel:`Her zaman kuralı işle ve koşulları yoksay` seçeneği, aşağıda ayarlanan koşulların kural işleme için incelenmemesine ve ayarlanan eylemin her zaman yürütülmesine neden olur. Bu, özellikle kurallar listesinin altındaki yedek kurallar için yararlıdır; burada, başka hiçbir kural geçerli değilse oturum açmış kullanıcıdan izin isteneceğini belirtebilirsiniz.

source: You can use the :guilabel:`Invert all conditions` option to determine that all activated conditions are inverted before evaluation, meaning that activated conditions must not apply. For example, if the condition *No user logged on* is activated, the rule only applies if one or more users are logged on. If a condition is configured so that a user must be a member of a specific group, the rule only applies, if the said user is *not* a member of the group.
tr: Değerlendirmeden önce tüm etkinleştirilmiş koşulların tersine çevrildiğini belirlemek için :guilabel:`Invert all conditions` seçeneğini kullanabilirsiniz, yani etkinleştirilmiş koşullar uygulanmamalıdır. Örneğin, *Hiçbir kullanıcı oturum açmadı* koşulu etkinleştirilirse, kural yalnızca bir veya daha fazla kullanıcı oturum açtığında uygulanır. Bir koşul, bir kullanıcının belirli bir grubun üyesi olması gerektiği şekilde yapılandırılırsa, kural yalnızca söz konusu kullanıcı grubun üyesi *değilse* uygulanır.

source: Conditions
tr: Koşullar

source: For a rule to be processed, one or more conditions must apply.
tr: Bir kuralın işleme alınabilmesi için bir veya daha fazla koşulun geçerli olması gerekir.

source: User is member of group
tr: Kullanıcı grubun üyesidir

source: You can use this condition to specify that either the accessing or the locally logged in user must be a member of a specific group. The desired group can be selected. If no or only wrong groups are selectable, the *User groups backend* under the general settings for :ref:`ComputerAccessControl` may have to be adjusted. Alternatively, a regular expression can be entered to control access from or to certain groups whose names match a certain pattern, e.g. ``/Class 20\d\d-\d\d/`` for the class groups 20NN-NN.
tr: Bu koşulu, erişen kullanıcının veya yerel olarak oturum açmış kullanıcının belirli bir grubun üyesi olması gerektiğini belirtmek için kullanabilirsiniz. İstenen grup seçilebilir. Eğer hiç grup seçilemiyorsa veya yalnızca yanlış gruplar seçilebiliyorsa, :ref:`ComputerAccessControl` için genel ayarlar altındaki Kullanıcı grupları arka ucunun ayarlanması gerekebilir. Alternatif olarak, adları belirli bir kalıpla eşleşen belirli gruplara erişimi veya bu gruplardan erişimi kontrol etmek için bir düzenli ifade girilebilir, örneğin 20NN-NN sınıf grupları için /Class 20\d\d-\d\d/.

source: Computer is located at
tr: Bilgisayar şu konumdadır:

source: With this condition you can define that either the accessing or the local computer has to be located at a specific location. The desired location can be selected. If no or only wrong locations are selectable the :ref:`RefNetworkObjectDirectory` has to be adjusted. Alternatively, a regular expression can be entered to control access from or to multiple locations whose names match a certain pattern.
tr: Bu koşulla, erişen bilgisayarın veya yerel bilgisayarın belirli bir konumda bulunması gerektiğini tanımlayabilirsiniz. İstenen konum seçilebilir. Eğer hiç konum seçilemiyorsa veya yalnızca yanlış konumlar seçilebiliyorsa, :ref:`RefNetworkObjectDirectory` ayarlanmalıdır. Alternatif olarak, adları belirli bir kalıpla eşleşen birden fazla konuma erişimi veya bu konumlardan erişimi kontrol etmek için bir düzenli ifade girilebilir.

source: Accessing computer and local computer are at the same location
tr: Giriş yapan bilgisayar ve yerel bilgisayar aynı lokasyonda

source: You can use this condition to specify that the accessing computer and the local computer must be in the same location. This can be used, for example, to prevent teachers from accessing computers outside their own classroom.
tr: Bu koşulu, erişen bilgisayarın ve yerel bilgisayarın aynı konumda olması gerektiğini belirtmek için kullanabilirsiniz. Bu, örneğin, öğretmenlerin kendi sınıflarının dışındaki bilgisayarlara erişmesini engellemek için kullanılabilir.

source: Accessing computer is localhost
tr: Giriş yapan bilgisayar yerel sunucudur

source: If this condition is enabled, the rule applies only if the accessing computer is the local computer. This ensures for example that teachers can access the local Veyon Service. This access is necessary for the Veyon Master to execute specific functions via the Veyon Service (e.g. the server for demo mode).
tr: Bu koşul etkinleştirilirse, kural yalnızca erişen bilgisayar yerel bilgisayar olduğunda uygulanır. Bu, örneğin öğretmenlerin yerel Veyon Hizmetine erişebilmesini sağlar. Bu erişim, Veyon Master'ın Veyon Hizmeti (örneğin demo modu sunucusu) aracılığıyla belirli işlevleri yürütmesi için gereklidir.

source: Accessing user has one or more groups in common with local (logged on) user
tr: Erişilen kullanıcı, yerel (oturum açmış) kullanıcıyla ortak bir veya daha çok kümeye sahip

source: You can use this condition to specify that the accessing and the local user have to be members of at least one common group, for example a user group for a class or a seminar.
tr: Bu koşulu, erişen ve yerel kullanıcının en azından bir ortak grubun üyesi olması gerektiğini belirtmek için kullanabilirsiniz; örneğin bir sınıfın veya seminerin kullanıcı grubu.

source: Accessing user is logged on user
tr: Erişen kullanıcı oturum açmış kullanıcıdır

source: As an alternative to the condition *accessing computer is localhost* you can also allow a user to access his own sessions. This condition must be activated for this purpose.
tr: *Erişim sağlayan bilgisayar localhost* koşuluna alternatif olarak bir kullanıcının kendi oturumlarına erişmesine de izin verebilirsiniz. Bu koşul bu amaç için etkinleştirilmelidir.

source: Accessing user is already connected
tr: Erişen kullanıcı zaten bağlı

source: In conjunction with the condition *Accessing computer and local computer are at the same location* an extended ruleset can be created allowing access to computer at other locations under certain conditions. This includes the possibility to access a computer if the accessing user is already connected. For example, if the teacher logs on to a teacher computer in room A and B simultaneously and displays the computers of room B displayed in Veyon Master, the computers in room B have a connection from the teacher. Then the teacher can also access room B from Veyon Master in room A if this condition is activated with an allow action.
tr: *Erişim sağlayan bilgisayar ve yerel bilgisayar aynı konumdadır* koşuluyla birlikte, belirli koşullar altında diğer konumlardaki bilgisayara erişime izin veren genişletilmiş bir kurallar kümesi oluşturulabilir. Bu, erişim sağlayan kullanıcı zaten bağlıysa bir bilgisayara erişim olanağını içerir. Örneğin, öğretmen aynı anda A ve B odasındaki bir öğretmen bilgisayarında oturum açarsa ve Veyon Master'da görüntülenen B odası bilgisayarlarını görüntülerse, B odasındaki bilgisayarlar öğretmenden bir bağlantıya sahip olur. Daha sonra öğretmen, bu koşul bir izin verme eylemiyle etkinleştirilirse A odasındaki Veyon Master'dan B odasına da erişebilir.

source: No user logged on
tr: Oturum açan kullanıcı yok

source: This condition determines how a computer can be accessed when no user is logged on. For easier computer administration, it can be helpful to always be able to access a computer when no user is logged on.
tr: Bu koşul, hiçbir kullanıcı oturum açmadığında bir bilgisayara nasıl erişilebileceğini belirler. Daha kolay bilgisayar yönetimi için, hiçbir kullanıcı oturum açmadığında bir bilgisayara her zaman erişebilmek yararlı olabilir.

source: Local computer is already being accessed
tr: Yerel bilgisayara zaten erişiliyor

source: If this condition is activated, the rule takes effect if there is already at least one connection to the local Veyon Service. This can be used, for example, to prevent parallel access to a computer.
tr: Bu koşul etkinleştirilirse, yerel Veyon Hizmetine zaten en az bir bağlantı varsa kural geçerli olur. Bu, örneğin, bir bilgisayara paralel erişimi engellemek için kullanılabilir.

source: Action
tr: Eylem

source: If all the enabled conditions of a rule apply, a specific action is performed with respect to computer access. You can define this action in section :guilabel:`Action`:
tr: Bir kuralın tüm etkinleştirilmiş koşulları geçerliyse, bilgisayar erişimiyle ilgili belirli bir eylem gerçekleştirilir. Bu eylemi :guilabel:`Eylem` bölümünde tanımlayabilirsiniz:

source: Allow access
tr: Erişime izin ver

source: Access to a computer is allowed and further rules are not processed. If there is a rule in the rules list below that would deny access, access is still allowed. There must be at least one rule with this action.
tr: Bir bilgisayara erişime izin verilir ve daha fazla kural işlenmez. Aşağıdaki kurallar listesinde erişimi reddedecek bir kural varsa, erişime hala izin verilir. Bu eylemle en az bir kural olmalıdır.

source: Deny access
tr: Erişimi reddet

source: Access to a computer is denied and further rules are not processed. If there is a rule in the rules list below that would allow access, access is still denied.
tr: Bir bilgisayara erişim reddedilir ve daha fazla kural işlenmez. Aşağıdaki kurallar listesinde erişime izin verecek bir kural varsa, erişim yine de reddedilir.

source: Ask logged on user for permission
tr: Oturum açmış kullanıcıdan izin iste

source: This action displays a dialog on the computer that allows the logged-in user to choose whether to allow or deny access. No further rules are processed regardless of the user's decision.
tr: Bu eylem, oturum açmış kullanıcının erişime izin verip vermemeyi seçmesine olanak tanıyan bir iletişim kutusunu bilgisayarda görüntüler. Kullanıcının kararından bağımsız olarak başka hiçbir kural işlenmez.

source: None (rule disabled)
tr: Yok (kural devre dışı)

source: This action makes the rule being ignore. Access control will be continued by processing the next rule. This option can be used to create an inactive dummy entry to visually subdivide the rules list.
tr: Bu eylem, kuralın yok sayılmasını sağlar. Erişim denetimi, bir sonraki kuralın işlenmesiyle devam eder. Bu seçenek, kurallar listesini görsel olarak alt bölümlere ayırmak için etkin olmayan bir kukla giriş oluşturmak için kullanılabilir.

source: By clicking the :guilabel:`OK` button the rule and the changes made are accepted and the dialog is closed.
tr: :guilabel:`Tamam` butonuna tıklandığında kural ve yapılan değişiklikler kabul edilmiş olur ve iletişim kutusu kapatılır.

source: Sorting rules
tr: Kuralları sıralama

source: The defined access control rules are processed one after the other in the order of the list. The action of the first matching rule is executed, even if subsequent rules would also apply and lead to a different action.
tr: Tanımlanmış erişim kontrol kuralları liste sırasına göre birbiri ardına işlenir. İlk eşleşen kuralın eylemi, sonraki kurallar da geçerli olsa ve farklı bir eyleme yol açsa bile yürütülür.

source: All rules can be reordered via the buttons with the arrow symbols. Rules that should fundamentally prevent or allow access based on certain criteria should be placed as high up as possible. Rules to cover special cases can follow below. Rules for the implementation of fallback behaviour should be at the bottom.
tr: Tüm kurallar ok sembollerine sahip düğmeler aracılığıyla yeniden sıralanabilir. Belirli kriterlere göre erişimi temelde engellemesi veya izin vermesi gereken kurallar mümkün olduğunca yukarıya yerleştirilmelidir. Özel durumları kapsayan kurallar aşağıda takip edilebilir. Geri dönüş davranışının uygulanmasına ilişkin kurallar en altta olmalıdır.

source: Logical concatenation of rules
tr: Kuralların mantıksal olarak birleştirilmesi

source: If more than one condition is activated in a rule, *each* condition must apply for the rule to be applied (logical AND). If only one of several rules should apply (logical OR), several access control rules must be defined.
tr: Bir kuralda birden fazla koşul etkinleştirilirse, kuralın uygulanması için *her* koşul geçerli olmalıdır (mantıksal VE). Birkaç kuraldan yalnızca biri geçerliyse (mantıksal VEYA), birkaç erişim kontrol kuralı tanımlanmalıdır.

source: With basic knowledge of Boolean algebra, the option *Invert all conditions* can be used as negation operator in conjunction with inverted actions to model extended scenarios. For example, if a user must be a member of two specific groups to allow access to a computer, two separate rules can be created that deny access, if the user is *not* a member of either group.
tr: Boolean cebirinin temel bilgisiyle, *Tüm koşulları tersine çevir* seçeneği, genişletilmiş senaryoları modellemek için ters eylemlerle birlikte olumsuzlama operatörü olarak kullanılabilir. Örneğin, bir kullanıcının bir bilgisayara erişime izin vermek için iki belirli grubun üyesi olması gerekiyorsa, kullanıcı her iki grubun da üyesi *değilse* erişimi reddeden iki ayrı kural oluşturulabilir.

source: If there is no matching access control rule so that all activated conditions apply, access is denied and the connection is closed. This prevents an attacker from being accidentally allowed access due to an incomplete ruleset.
tr: Tüm etkinleştirilmiş koşulların geçerli olması için eşleşen bir erişim kontrol kuralı yoksa, erişim reddedilir ve bağlantı kapatılır. Bu, bir saldırganın eksik bir kural kümesi nedeniyle yanlışlıkla erişime izin verilmesini önler.

source: Testing a ruleset
tr: Bir kurallar setini test etme

source: In section :guilabel:`Computer access control` the configured ruleset can be checked with various scenarios using the :guilabel:`Test` button. In the test dialog you can enter the parameters to simulate a scenario. With the button :guilabel:`OK` the rules are processed with the given parameters and a message with the test result is displayed.
tr: :guilabel:`Bilgisayar erişim kontrolü` bölümünde yapılandırılmış kurallar kümesi :guilabel:`Test` butonu kullanılarak çeşitli senaryolarla kontrol edilebilir. Test iletişim kutusunda bir senaryoyu simüle etmek için parametreleri girebilirsiniz. :guilabel:`TAMAM` butonuyla kurallar verilen parametrelerle işlenir ve test sonucuyla birlikte bir mesaj görüntülenir.

source: Access control
tr: Erişim denetimi

source: Computer access control
tr: Bilgisayarlara erişim denetimi

source: Ruleset
tr: Kural seti

source: Computer access rules
tr: Bilgisayar erişim kuralları

source: Fallback access rule
tr: Geri dönüş erişim kuralı

source: Access control rule condition
tr: Erişim kontrol kuralı koşulu

source: Access control rule action
tr: Erişim kontrol kuralı eylemi

source: Negation operator
tr: Olumsuzluk operatörü

source: Inverse rule
tr: Ters kural

source: Inverse condition
tr: Ters koşul

source: Command line interface
tr: Komut satırı arayüzü

source: For administrative tasks, the *Veyon Configurator* and the command line tool *Veyon CLI* are available. The program can be started via the command ``veyon-cli`` in the command line. On Windows there's an additional non-console version ``veyon-wcli`` which allows automating tasks without irritating command line window popups. If the :envvar:`$PATH` (Linux) or :envvar:`%PATH%` (Windows) environment variable does not contain the Veyon installation directory, you must first change to the installation directory or prepend the directory to the program name.
tr: Yönetimsel görevler için *Veyon Configurator* ve komut satırı aracı *Veyon CLI* kullanılabilir. Program komut satırında ``veyon-cli`` komutuyla başlatılabilir. Windows'ta, komut satırı penceresi açılır pencerelerini rahatsız etmeden görevleri otomatikleştirmeye izin veren ek bir konsol olmayan sürüm ``veyon-wcli`` vardır. :envvar:`$PATH` (Linux) veya :envvar:`%PATH%` (Windows) ortam değişkeni Veyon kurulum dizinini içermiyorsa, önce kurulum dizinine geçmeli veya dizini program adının önüne eklemelisiniz.

source: If the program is called with the ``help`` parameter, a list of all available modules is displayed. The list can vary depending on the installed Veyon plugins:
tr: Program ``help`` parametresiyle çağrılırsa, tüm kullanılabilir modüllerin bir listesi görüntülenir. Liste, yüklü Veyon eklentilerine bağlı olarak değişebilir:

source: Each CLI module supports the ``help`` command, so that a list of all available commands can be displayed for each module. Sample output for the ``config`` module:
tr: Her CLI modülü ``help`` komutunu destekler, böylece her modül için tüm kullanılabilir komutların bir listesi görüntülenebilir. ``config`` modülü için örnek çıktı:

source: For some modules the ``help`` command can be supplied with a command name as an additional argument to get specific help for a command:
tr: Bazı modüller için ``help`` komutu, belirli bir komut için özel yardım almak amacıyla ek bir argüman olarak bir komut adıyla sağlanabilir:

source: Authentication key management
tr: Kimlik doğrulama anahtarı yönetimi

source: The ``authkeys`` module allows the management of authentication keys so that common operations such as importing an authentication key or assigning a user group can be automated easily.
tr: ``authkeys`` modülü, kimlik doğrulama anahtarlarının yönetilmesine olanak tanır; böylece kimlik doğrulama anahtarının içe aktarılması veya kullanıcı grubu ataması gibi yaygın işlemler kolayca otomatikleştirilebilir.

source: The ``<KEY>`` parameter always refers to a key name consisting of a name identifier and a type, e.g. ``teacher/public``. A name identifier must consist of letters only. The type has to be either ``private`` or ``public``.
tr: ``<KEY>`` parametresi her zaman bir isim tanımlayıcısı ve bir türden oluşan bir anahtar ismine atıfta bulunur, örneğin ``teacher/public``. Bir isim tanımlayıcısı yalnızca harflerden oluşmalıdır. Tür ``private`` veya ``public`` olmalıdır.

source: This command creates a authentication key pair with name <NAME> and saves private and public key to the configured key directories. The parameter must be a name for the key, which may only contain letters.
tr: Bu komut, adı <NAME> olan bir kimlik doğrulama anahtar çifti oluşturur ve özel ve genel anahtarı yapılandırılmış anahtar dizinlerine kaydeder. Parametre, yalnızca harflerden oluşabilen anahtar için bir ad olmalıdır.

source: This command deletes the authentication key <KEY> from the configured key directory. Please note that a key can't be recovered once it has been deleted.
tr: Bu komut, <KEY> kimlik doğrulama anahtarını yapılandırılmış anahtar dizininden siler. Bir anahtar silindikten sonra kurtarılamayacağını lütfen unutmayın.

source: This command exports the <KEY> to <FILE> authentication key. If <FILE> is not specified a name will be constructed from name and type of <KEY>.
tr: Bu komut <KEY> ila <FILE> kimlik doğrulama anahtarını dışa aktarır. <FILE> belirtilmezse, <KEY>'ün adı ve türünden bir ad oluşturulur.

source: This command extracts the public key part from the private key <KEY> and saves it as the associated public key. When setting up another master computer, it is therefore sufficient to transfer the private key only. The public key can then be extracted.
tr: Bu komut, özel anahtar <KEY>'den genel anahtar kısmını çıkarır ve ilişkili genel anahtar olarak kaydeder. Başka bir ana bilgisayar kurarken, yalnızca özel anahtarı aktarmak yeterlidir. Daha sonra genel anahtar çıkarılabilir.

source: This command imports the authentication key <KEY> from <FILE>. If <FILE> is not specified a name will be constructed from name and type of <KEY>.
tr: Bu komut, <FILE> öğesinden <KEY> kimlik doğrulama anahtarını alır. <FILE> belirtilmezse, <KEY> adından ve türünden bir ad oluşturulur.
