Repository: veyon/docs
Catalog: locale/*/LC_MESSAGES/admin.po
Languages: tr

source: In general when using the user log in feature make sure to enable the *Interactive logon: Do not display last user name* group policy. This makes Windows ask for both a username and a password in the logon screen which is required for the log in feature to work properly. See `How To Prevent the Name of the Last Logged-On User from Being Displayed in the Log On to Windows Dialog Box <https://support.microsoft.com/en-gb/help/324740/how-to-prevent-the-name-of-the-last-logged-on-user-from-being-displayed>`_ and `How to make Windows 10 ask for user name and password during log on <https://winaero.com/blog/how-to-make-windows-10-ask-for-user-name-and-password-during-log-on/>`_ for details. Also a logon message must not be configured as it blocks the automated logon procedure. Therefore make sure to disable the *Interactive logon: Message title for users attempting to log on* and *Interactive logon: Message text for users attempting to log on* policies. See `How to configure Windows Server 2003 to display a message when users log on <https://support.microsoft.com/en-us/help/310430/how-to-configure-windows-server-2003-to-display-a-message-when-users-l>`_ for details.
tr: Genel olarak kullanıcı oturum açma özelliğini kullanırken *Etkileşimli oturum açma: Son kullanıcı adını görüntüleme* grup ilkesini etkinleştirdiğinizden emin olun. Bu, Windows'un oturum açma özelliğinin düzgün çalışması için gerekli olan oturum açma ekranında hem kullanıcı adı hem de parola istemesini sağlar. Ayrıntılar için `Windows'da Oturum Açma İletişim Kutusunda Son Oturum Açan Kullanıcının Adının Görüntülenmesini Önleme <https://support.microsoft.com/en-gb/help/324740/how-to-prevent-the-name-of-the-last-logged-on-user-from-being-displayed>`_ ve `Windows 10'un oturum açma sırasında kullanıcı adı ve parola istemesini sağlama <https://winaero.com/blog/how-to-make-windows-10-ask-for-user-name-and-password-during-log-on/>`_ konularına bakın. Ayrıca, otomatik oturum açma prosedürünü engellediği için bir oturum açma mesajı yapılandırılmamalıdır. Bu nedenle, *Etkileşimli oturum açma: Oturum açmaya çalışan kullanıcılar için ileti başlığı* ve *Etkileşimli oturum açma: Oturum açmaya çalışan kullanıcılar için ileti metni* ilkelerini devre dışı bıraktığınızdan emin olun. Ayrıntılar için `Kullanıcılar oturum açtığında bir ileti görüntülemek üzere Windows Server 2003'ü yapılandırma <https://support.microsoft.com/en-us/help/310430/how-to-configure-windows-server-2003-to-display-a-message-when-users-l>`_ konusuna bakın.

source: Some advanced settings control the timing when simulating key presses to remotely logging in users.
tr: Bazı gelişmiş ayarlar, kullanıcıların uzaktan oturum açması için tuş basımlarının simüle edilmesi sırasında zamanlamayı kontrol eder.

source: Input start delay
tr: Girdi başlangıç gecikmesi

source: This value specifies the number of milliseconds to wait between issuing Ctrl+Alt+Del and sending the first character of the username. This value can be increased on slow computers to ensure that the username input field is ready.
tr: Bu değer, Ctrl+Alt+Del tuşlarına basılması ile kullanıcı adının ilk karakterinin gönderilmesi arasında beklenecek milisaniye sayısını belirtir. Bu değer, kullanıcı adı giriş alanının hazır olduğundan emin olmak için yavaş bilgisayarlarda artırılabilir.

source: **Default:** *1000 ms*
tr: **Varsayılan:** *1000 ms*

source: Simulated key presses interval
tr: Simüle edilmiş tuş basma aralığı

source: This value specifies the number of milliseconds to wait between the individual simulated key presses. Increase this value if you encounter logon failures caused by missing characters or improperly switched input fields.
tr: Bu değer, simüle edilen bireysel tuş vuruşları arasında beklenecek milisaniye sayısını belirtir. Eksik karakterler veya yanlış anahtarlanmış giriş alanları nedeniyle oturum açma hataları ile karşılaşırsanız bu değeri artırın.

source: **Default:** *10 ms*
tr: **Varsayılan:** *10 ms*

source: Screen lock
tr: Ekran kilidi

source: The screen lock feature per default disables all input devices and hides parts of the operating system user interface. This behaviour can be changed for cases where parts of the operating system user interface no longer function properly after a computer is unlocked.
tr: Ekran kilidi özelliği varsayılan olarak tüm giriş aygıtlarını devre dışı bırakır ve işletim sistemi kullanıcı arayüzünün parçalarını gizler. Bu davranış, bir bilgisayar kilidi açıldıktan sonra işletim sistemi kullanıcı arayüzünün parçalarının artık düzgün çalışmadığı durumlarda değiştirilebilir.

source: Hide taskbar
tr: Görev çubuğunu gizle

source: This option defines whether the taskbar and the start button should be disabled and hidden by the screen lock feature.
tr: Bu seçenek, ekran kilidi özelliğinin görev çubuğunu ve başlat düğmesini devre dışı bırakıp bırakmayacağını ve gizleyip gizlemeyeceğini tanımlar.

source: Hide start menu
tr: Başlat menüsünü gizle

source: This option defines whether the start menu should be disabled and hidden by the screen lock feature.
tr: Bu seçenek, başlat menüsünün ekran kilidi özelliği tarafından devre dışı bırakılıp gizlenmeyeceğini tanımlar.

source: Hide desktop
tr: Masaüstünü gizle

source: This option defines whether the desktop should be disabled and hidden by the screen lock feature.
tr: Bu seçenek, ekran kilidi özelliğinin masaüstünü devre dışı bırakıp bırakmayacağını ve gizleyip gizlemeyeceğini tanımlar.

source: Use input device interception driver
tr: Giriş aygıtı engelleme sürücüsünü kullan

source: This option defines whether the Interception driver should be used. This driver is used by the screen lock feature to block special key sequences such as :kbd:`Ctrl+Alt+Del` at the driver level. The Interception driver may cause troubles with RDP sessions and should therefore be disabled and uninstalled when using Veyon in remote desktop environments. In this case, consider not installing the driver at all during the installation of Veyon by either unchecking the Interception driver option or passing the ``/NoInterception`` option to the installer in silent mode. If the driver is already installed, uninstallation is only possible after disabling this option and rebooting the computer. The driver can then be uninstalled using the :file:`uninstall.bat` script in the :file:`interception` subdirectory in Veyon's installation directory.
tr: Bu seçenek, Interception sürücüsünün kullanılıp kullanılmayacağını tanımlar. Bu sürücü, ekran kilidi özelliği tarafından sürücü düzeyinde :kbd:`Ctrl+Alt+Del` gibi özel tuş dizilerini engellemek için kullanılır. Interception sürücüsü, RDP oturumlarında sorunlara neden olabilir ve bu nedenle Veyon uzak masaüstü ortamlarında kullanıldığında devre dışı bırakılmalı ve kaldırılmalıdır. Bu durumda, Interception sürücü seçeneğinin işaretini kaldırarak veya yükleyiciye sessiz modda ``/NoInterception`` seçeneğini geçirerek Veyon'un kurulumu sırasında sürücüyü hiç yüklememeyi düşünün. Sürücü zaten yüklenmişse, kaldırma işlemi yalnızca bu seçeneği devre dışı bıraktıktan ve bilgisayarı yeniden başlattıktan sonra mümkündür. Sürücü daha sonra Veyon'un kurulum dizinindeki :file:`interception` alt dizininde bulunan :file:`uninstall.bat` betiği kullanılarak kaldırılabilir.

source: UltraVNC server settings
tr: UltraVNC sunucu ayarları

source: Veyon uses a lightweight version of UltraVNC as a builtin VNC server on Windows. While the Veyon Server manages most UltraVNC settings on its own a few performance and system integration related settings can be changed manually. In general you should not need to change the default values unless you encounter problems while accessing or controlling remote computers.
tr: Veyon, Windows'ta yerleşik bir VNC sunucusu olarak UltraVNC'nin hafif bir sürümünü kullanır. Veyon Sunucusu, UltraVNC ayarlarının çoğunu kendi başına yönetirken, performans ve sistem entegrasyonuyla ilgili birkaç ayar manuel olarak değiştirilebilir. Genel olarak, uzak bilgisayarlara erişirken veya onları kontrol ederken sorunlarla karşılaşmadığınız sürece varsayılan değerleri değiştirmenize gerek kalmaz.

source: Enable capturing of layered (semi-transparent) windows
tr: Katmanlı (yarı saydam) pencerelerin yakalanmasını etkinleştir

source: When using the traditional screen mirroring driver (i.e. Windows 7 is used or Desktop Duplication Engine is disabled) the VNC server can't capture semi-transparent windows. This can result in large parts of the screen not being captured if the Windows Aero theme is used. To circumvent this issue capturing of semi-transparent windows is enabled per default. Besides potentially lower performance this can also make the mouse cursor flicker on client computers.
tr: Geleneksel ekran yansıtma sürücüsü kullanıldığında (yani Windows 7 kullanıldığında veya Masaüstü Çoğaltma Motoru devre dışı bırakıldığında) VNC sunucusu yarı saydam pencereleri yakalayamaz. Bu, Windows Aero teması kullanıldığında ekranın büyük bölümlerinin yakalanmamasına neden olabilir. Bu sorunu aşmak için yarı saydam pencerelerin yakalanması varsayılan olarak etkinleştirilir. Potansiyel olarak daha düşük performansın yanı sıra bu, istemci bilgisayarlarda fare imlecinin titremesine de neden olabilir.

source: Enable multi monitor support
tr: Çoklu monitör desteğini etkinleştir

source: This option says whether to capture only the first of all monitors. On client computers it usually is desirable to see all monitors. On master computers this option can be disabled in order to broadcast only the contents of the first screen in demo mode. This way the teacher does not have to share its whole desktop. Broadcasting less screen data also improves performance.
tr: Bu seçenek, tüm monitörlerin yalnızca ilkinin yakalanıp yakalanmayacağını belirtir. İstemci bilgisayarlarda genellikle tüm monitörleri görmek istenir. Ana bilgisayarlarda bu seçenek, demo modunda yalnızca ilk ekranın içeriklerini yayınlamak için devre dışı bırakılabilir. Bu şekilde öğretmenin tüm masaüstünü paylaşması gerekmez. Daha az ekran verisi yayınlamak da performansı artırır.

source: Enable Desktop Duplication Engine on Windows 8 and newer
tr: Windows 8 ve üzeri sürümlerde Masaüstü Çoğaltma Motorunu Etkinleştirin

source: When this option is enabled UltraVNC uses the new Desktop Duplication Engine on Windows 8 and newer. This engine is a new driver backend for capturing screen data and provides much better performance compared to the traditional screen mirroring driver. Additionally it also captures windows with DirectX-rendered content, e.g. allowing to view and control DirectX-based CAD applications remotely.
tr: Bu seçenek etkinleştirildiğinde UltraVNC, Windows 8 ve daha yeni sürümlerde yeni Masaüstü Çoğaltma Motorunu kullanır. Bu motor, ekran verilerini yakalamak için yeni bir sürücü arka ucudur ve geleneksel ekran yansıtma sürücüsüne kıyasla çok daha iyi performans sağlar. Ek olarak, DirectX ile işlenmiş içerikle pencereleri de yakalar, örneğin DirectX tabanlı CAD uygulamalarını uzaktan görüntülemeye ve kontrol etmeye olanak tanır.

source: Poll full screen (leave this enabled per default)
tr: Anketi tam ekran yap (bunu varsayılan olarak etkin bırakın)

source: If no suitable driver for capturing screen data is found this determines whether to scan the whole screen for changed pixels. Otherwise only the foreground window is scanned which can reduce CPU load. It should only be disabled as a last resort if CPU load is an issue.
tr: Ekran verilerini yakalamak için uygun bir sürücü bulunamazsa, bu, tüm ekranın değişen pikseller için taranıp taranmayacağını belirler. Aksi takdirde yalnızca ön plan penceresi taranır ve bu da CPU yükünü azaltabilir. Yalnızca CPU yükü bir sorunsa son çare olarak devre dışı bırakılmalıdır.

source: Low accuracy (turbo mode)
tr: Düşük doğruluk (turbo modu)

source: Enabling this option will make the VNC server use a scan raster to detect changed screen areas which need to be sent to the viewer. As changes of individual pixels might only be detected every 4th scan pass, partial updates can be delayed by a few hundred milliseconds in some cases. At the same time this option greatly improves performance and reduces the CPU load caused by the VNC server.
tr: Bu seçeneği etkinleştirmek, VNC sunucusunun görüntüleyiciye gönderilmesi gereken değişen ekran alanlarını algılamak için bir tarama raster'ı kullanmasını sağlayacaktır. Tek tek piksellerdeki değişiklikler yalnızca her 4. tarama geçişinde algılanabileceğinden, bazı durumlarda kısmi güncellemeler birkaç yüz milisaniye gecikebilir. Aynı zamanda bu seçenek performansı büyük ölçüde iyileştirir ve VNC sunucusunun neden olduğu CPU yükünü azaltır.

source: In order to authenticate a user (i.e. verify its username and password) on Linux the Veyon Server launches the Veyon Authentication helper (``veyon-auth-helper``). This small program actually performs the user authentication via `Linux PAM <https://en.wikipedia.org/wiki/Linux_PAM>`_. In almost every Linux installation several PAM services are configured and usually managed by Linux distribution specific tools. Veyon uses the PAM service ``login`` per default, i.e. authentication is performed through the modules configured in ``/etc/pam.d/login`` (Veyon 4.0/4.1 used ``/etc/pam.d/su``).
tr: Bir kullanıcıyı doğrulamak (yani kullanıcı adını ve parolasını doğrulamak) için Linux'ta Veyon Sunucusu Veyon Kimlik Doğrulama yardımcısını (``veyon-auth-helper``) başlatır. Bu küçük program aslında kullanıcı kimlik doğrulamasını `Linux PAM <https://en.wikipedia.org/wiki/Linux_PAM>`_ aracılığıyla gerçekleştirir. Neredeyse her Linux kurulumunda birkaç PAM hizmeti yapılandırılır ve genellikle Linux dağıtımına özgü araçlar tarafından yönetilir. Veyon varsayılan olarak PAM hizmeti ``login``'i kullanır, yani kimlik doğrulama ``/etc/pam.d/login`` içinde yapılandırılan modüller aracılığıyla gerçekleştirilir (Veyon 4.0/4.1 ``/etc/pam.d/su`` kullanır).

source: Custom PAM service for user authentication
tr: Kullanıcı kimlik doğrulaması için özel PAM hizmeti

source: If you want to use a dedicated PAM service configuration to authenticate Veyon users you can enter a custom PAM service name here. A simple identifier such as ``veyon`` should be used. If for example set to ``veyon``, the Veyon Authentication helper will use the PAM service ``veyon``, i.e. configuration is taken from the file ``/etc/pam.d/veyon``. Please make sure to provide the PAM service configuration file before using this setting. Otherwise authentication will always fail.
tr: Veyon kullanıcılarını doğrulamak için özel bir PAM hizmeti yapılandırması kullanmak istiyorsanız buraya özel bir PAM hizmeti adı girebilirsiniz. ``veyon`` gibi basit bir tanımlayıcı kullanılmalıdır. Örneğin ``veyon`` olarak ayarlanırsa, Veyon Kimlik Doğrulama yardımcısı ``veyon`` PAM hizmetini kullanır, yani yapılandırma ``/etc/pam.d/veyon`` dosyasından alınır. Lütfen bu ayarı kullanmadan önce PAM hizmeti yapılandırma dosyasını sağladığınızdan emin olun. Aksi takdirde kimlik doğrulama her zaman başarısız olur.

source: To verify that the custom PAM service is set up properly you can change the :ref:`authentication method <RefAuthentication>` to :guilabel:`Logon authentication` and click the :guilabel:`Test` button.
tr: Özel PAM hizmetinin düzgün bir şekilde ayarlandığını doğrulamak için :ref:`kimlik doğrulama yöntemi <RefAuthentication>`i :guilabel:`Oturum açma kimlik doğrulaması` olarak değiştirebilir ve :guilabel:`Test` butonuna tıklayabilirsiniz.

source: SAS generation
tr: SAS oluşturma

source: Secure Attention Sequence
tr: Güvenli Dikkat Dizisi

source: Authentication mechanism
tr: Kimlik doğrulama mekanizması

source: Configuration reference
tr: Yapılandırma referansı

source: In this chapter all configuration pages within Veyon Configurator as well as all configuration options with their respective meanings are explained in detail. It mainly serves as a reference for looking up detailed configuration options. A manual and hints for the installation can be found in chapter :ref:`Configuration`.
tr: Bu bölümde Veyon Configurator'daki tüm yapılandırma sayfaları ve ilgili anlamlarıyla tüm yapılandırma seçenekleri ayrıntılı olarak açıklanmaktadır. Esas olarak ayrıntılı yapılandırma seçeneklerine bakmak için bir referans görevi görür. Kurulum için bir kılavuz ve ipuçları :ref:`Configuration` bölümünde bulunabilir.

source: Some advanced settings are hidden in the standard view. You can switch to the advanced view using the menu.
tr: Standart görünümde bazı gelişmiş ayarlar gizlidir. Menüyü kullanarak gelişmiş görünüme geçebilirsiniz.

source: User interface
tr: Kullanıcı arayüzü

source: Language
tr: Dil

source: The selected language can be configured for the graphical user interfaces as well as the command line tools. You can choose from all the languages which have been translated so far. Please note that changing the language will require a program restart in order to take effect. Per default Veyon uses the language of the operating system if a translation is available for that language. Otherwise English will be used as a fallback.
tr: Seçilen dil, grafiksel kullanıcı arayüzleri ve komut satırı araçları için yapılandırılabilir. Şimdiye kadar çevrilmiş tüm diller arasından seçim yapabilirsiniz. Lütfen dilin değiştirilmesinin etkili olması için programın yeniden başlatılması gerekeceğini unutmayın. Varsayılan olarak Veyon, o dil için bir çeviri mevcutsa işletim sisteminin dilini kullanır. Aksi takdirde İngilizce bir geri dönüş olarak kullanılacaktır.

source: **Default:** *Use system language setting*
tr: **Varsayılan:** *Sistem dili ayarını kullan*

source: Style
tr: Stil

source: This setting allows to change between certain styles of user interface controls. While the Fusion style offers a clean and pleasent look and feel, it's also possible to switch back to the native style of the operating system or desktop environment.
tr: Bu ayar, kullanıcı arayüzü kontrollerinin belirli stilleri arasında geçiş yapmanıza olanak tanır. Fusion stili temiz ve hoş bir görünüm ve his sunarken, işletim sisteminin veya masaüstü ortamının yerel stiline geri dönmek de mümkündür.

source: **Default:** *Fusion*
tr: **Varsayılan:** *Fusion*

source: The :ref:`Configuration` chapter describes the :ref:`ConfAuthenticationMethods` available in Veyon.
tr: :ref:`Yapılandırma` bölümü Veyon'da bulunan :ref:`ConfAuthenticationMethods`'u açıklar.

source: Method
tr: Yöntem

source: This option defines which authentication method to use. :ref:`Logon authentication <ConfLogonAuthentication>` does not require any further setup and can be used immediately. To use the :ref:`key file authentication <ConfKeyFileAuthentication>`, appropriate authentication keys must first be created and distributed.
tr: Bu seçenek hangi kimlik doğrulama yönteminin kullanılacağını tanımlar. :ref:`Logon authentication <ConfLogonAuthentication>` herhangi bir ek kurulum gerektirmez ve hemen kullanılabilir. :ref:`key file authentication <ConfKeyFileAuthentication>` kullanmak için, önce uygun kimlik doğrulama anahtarları oluşturulmalı ve dağıtılmalıdır.

source: **Default:** *Logon authentication*
tr: **Varsayılan:** *Oturum açma kimlik doğrulaması*

source: In Veyon a network object directory provides information about network objects. Network objects can either be computers or their locations. The data supplied by the network object directory is used by Veyon Master to populate the :guilabel:`Locations & computers` view with entries. The data from the network object directory is also used for access control rules making use of computer location information. By default a backend is used which stores computers and locations in the local Veyon configuration and queries them from the configuration whenever required. See section :ref:`ConfLocationsAndComputers` for details.
tr: Veyon'da bir ağ nesnesi dizini ağ nesneleri hakkında bilgi sağlar. Ağ nesneleri bilgisayarlar veya konumları olabilir. Ağ nesnesi dizini tarafından sağlanan veriler Veyon Master tarafından :guilabel:`Locations & computers` görünümünü girişlerle doldurmak için kullanılır. Ağ nesnesi dizininden gelen veriler ayrıca bilgisayar konum bilgilerinden yararlanan erişim kontrol kuralları için de kullanılır. Varsayılan olarak, bilgisayarları ve konumları yerel Veyon yapılandırmasında depolayan ve gerektiğinde yapılandırmadan sorgulayan bir arka uç kullanılır. Ayrıntılar için :ref:`ConfLocationsAndComputers` bölümüne bakın.

source: Backend
tr: Arka uç

source: You can use this setting to set the desired backend for the network object directory. Depending on the installation there may be several backends such as :ref:`LDAP` available beside the default backend.
tr: Bu ayarı, ağ nesnesi dizini için istenen arka ucu ayarlamak için kullanabilirsiniz. Kuruluma bağlı olarak, varsayılan arka ucun yanı sıra :ref:`LDAP` gibi birkaç arka uç bulunabilir.

source: **Default:** *Builtin (computers and locations in local configuration)*
tr: **Varsayılan:** *Yerleşik (yerel yapılandırmadaki bilgisayarlar ve konumlar)*

source: Update interval
tr: Güncelleme aralığı

source: The network object directory automatically updates in background which especially is useful for dynamic backends such as LDAP. The time interval for these updates can be altered with this option.
tr: Ağ nesne dizini, özellikle LDAP gibi dinamik arka uçlar için yararlı olan arka planda otomatik olarak güncellenir. Bu güncellemeler için zaman aralığı bu seçenekle değiştirilebilir.

source: **Default:** *60 seconds*
tr: **Varsayılan:** *60 saniye*

source: User groups
tr: Kullanıcı grupları

source: Veyon uses information about user groups and their members for performing :ref:`ConfAccessControl` and setting access groups for :ref:`authentication keys <ConfKeyFileAuthentication>`. In most cases the default backend is a good choice. If you want to use e.g. dedicated LDAP groups or Entra ID groups you can change the backend accordingly.
tr: Veyon, :ref:`ConfAccessControl` gerçekleştirmek ve :ref:`authentication keys <ConfKeyFileAuthentication>` için erişim grupları ayarlamak için kullanıcı grupları ve üyeleri hakkında bilgi kullanır. Çoğu durumda varsayılan arka uç iyi bir seçimdir. Örneğin özel LDAP grupları veya Entra ID grupları kullanmak istiyorsanız arka ucu buna göre değiştirebilirsiniz.

source: A user group backend provides user groups and their members (users) required for access control. While the default backend is suitable for system user groups the LDAP backends will make LDAP/AD user groups available for access control.
tr: Bir kullanıcı grubu arka ucu, erişim denetimi için gereken kullanıcı gruplarını ve üyelerini (kullanıcıları) sağlar. Varsayılan arka uç sistem kullanıcı grupları için uygun olsa da LDAP arka uçları, LDAP/AD kullanıcı gruplarını erişim denetimi için kullanılabilir hale getirecektir.

source: **Default:** *Default (system user groups)*
tr: **Varsayılan:** *Varsayılan (sistem kullanıcı grupları)*

source: Include user groups from domain
tr: Etki alanından kullanıcı gruplarını dahil et
