Repository: veyon/docs
Catalog: locale/*/LC_MESSAGES/admin.po
Languages: tr

source: Demo: A feature has been added to share a user's screen instead of the own one.
tr: Demo: Kullanıcının kendi ekranı yerine kendi ekranını paylaşma özelliği eklendi.

source: Demo: The modes (window/fullscreen) have been made subfeatures displayed in a drop down menu.
tr: Demo: Modlar (pencere/tam ekran) açılır menüde görüntülenen alt özellikler haline getirildi.

source: Demo: A feature has been added to share only one of multiple own screens.
tr: Demo: Birden fazla ekrandan sadece birini paylaşma özelliği eklendi.

source: FileTransfer: A configuration page has been added allowing to configure source and destination folders.
tr: FileTransfer: Kaynak ve hedef klasörleri yapılandırmaya olanak tanıyan bir yapılandırma sayfası eklendi.

source: RemoteAccess: The username is now displayed in the window title.
tr: RemoteAccess: Kullanıcı adı artık pencere başlığında görüntüleniyor.

source: WebAPI: Added a new plugin offering a RESTful API for accessing Veyon Server instances.
tr: WebAPI: Veyon Server örneklerine erişim için RESTful API sunan yeni bir eklenti eklendi.

source: The reboot/poweroff functions now prefer using systemd-logind.
tr: Yeniden başlatma/kapatma işlevleri artık systemd-logind'i kullanmayı tercih ediyor.

source: The reboot/poweroff functions now look for binaries in /sbin and /usr/sbin if they are not in the PATH environment variable.
tr: Yeniden başlatma/kapatma işlevleri artık PATH ortam değişkeninde değillerse /sbin ve /usr/sbin içindeki ikili dosyaları arıyor.

source: The user session management code has been improved to start Veyon Server more reliably.
tr: Kullanıcı oturumu yönetim kodu, Veyon Sunucusunun daha güvenilir şekilde başlatılması için iyileştirildi.

source: The screenlock feature is now working properly with most desktop environments.
tr: Ekran kilidi özelliği çoğu masaüstü ortamında düzgün çalışmıyor.

source: The new Slideshow panel cycles through all computers and shows a magnified view of each computer for a short time.
tr: Yeni Slayt Gösterisi paneli tüm bilgisayarlarda dolaşır ve her bilgisayarın kısa bir süre için büyütülmüş görünümünü gösterir.

source: The new Spotlight panel shows one or multiple computers in realtime. This allows keeping an eye on users requiring special attention.
tr: Yeni Spot ışığı paneli bir veya birden fazla bilgisayarı gerçek zamanlı olarak gösterir. Bu, özel ilgi gerektiren kullanıcıları gözlemlemenizi sağlar.

source: The size of computer icons is now always adjusted automatically whenever the panel is resized or computers are added or removed.
tr: Bilgisayar simgelerinin boyutu artık panel yeniden boyutlandırıldığında veya bilgisayarlar eklendiğinde veya kaldırıldığında otomatik olarak ayarlanıyor.

source: States and sizes of panels are now saved when closing the program and restored upon the next start.
tr: Program kapatıldığında panellerin durumları ve boyutları artık kaydediliyor ve bir sonraki başlatmada geri yükleniyor.

source: The aspect ratio of computer icons is now adjusted to the original screen sizes.
tr: Bilgisayar simgelerinin en boy oranı artık orijinal ekran boyutlarına göre ayarlandı.

source: A notification is now shown for both incomplete and failed authentication attempts.
tr: Artık hem eksik hem de başarısız kimlik doğrulama girişimleri için bir bildirim gösteriliyor.

source: Support for external VNC servers without any authentication/password configured has been added.
tr: Herhangi bir kimlik doğrulama/şifre yapılandırılmadan harici VNC sunucularına destek eklendi.

source: The Interception driver is now disabled in multi session mode to prevent issues with hanging RDP sessions.
tr: Askıya alınmış RDP oturumlarıyla ilgili sorunların önlenmesi için Interception sürücüsü artık çoklu oturum modunda devre dışı bırakıldı.

source: Several 3rdparty libraries have been updated (Qt 5.12.11 snapshot, OpenLDAP 2.4.56, OpenSSL 1.1.1h)
tr: Birkaç üçüncü taraf kütüphanesi güncellendi (Qt 5.12.11 anlık görüntüsü, OpenLDAP 2.4.56, OpenSSL 1.1.1h)

source: Due to the large number of changes, there's a medium risk for regressions. Therefore especially the initial release (v4.5.0) should be tested thoroughly before deploying.
tr: Çok sayıda değişiklik nedeniyle, gerilemeler için orta düzeyde bir risk vardır. Bu nedenle özellikle ilk sürüm (v4.5.0) dağıtımdan önce iyice test edilmelidir.

source: There are no structural changes in Veyon 4.5.
tr: Veyon 4.5’te yapısal bir değişiklik bulunmuyor.

source: Several configuration keys have been renamed in Veyon 4.5. When upgrading to Veyon 4.5 or newer the new configuration keys will be populated with the values of the old keys automatically.
tr: Veyon 4.5'te birkaç yapılandırma anahtarı yeniden adlandırıldı. Veyon 4.5 veya daha yeni bir sürüme yükseltme yaparken yeni yapılandırma anahtarları otomatik olarak eski anahtarların değerleriyle doldurulacak.

source: Veyon 4.4 is mostly identical to Veyon 4.3. The most notable change is the updated VNC and networking stack which provides even better reliability. As a result Veyon 4.4 uses slightly different techniques and settings when establishing connections to client computers, so the new version should be tested thoroughly before deployment. Apart from this, the risk of regressions is very low.
tr: Veyon 4.4, Veyon 4.3 ile büyük ölçüde aynıdır. En dikkat çekici değişiklik, daha iyi güvenilirlik sağlayan güncellenmiş VNC ve ağ yığınıdır. Sonuç olarak Veyon 4.4, istemci bilgisayarlara bağlantılar kurarken biraz farklı teknikler ve ayarlar kullanır, bu nedenle yeni sürüm dağıtımdan önce iyice test edilmelidir. Bunun dışında, gerileme riski çok düşüktür.

source: There are no structural changes in Veyon 4.4.
tr: Veyon 4.4’te yapısal bir değişiklik bulunmuyor.

source: No configuration keys have been changed or renamed. Various internal settings of the VNC and networking stack (such as timeouts and intervals) are now configurable at the command line for debugging and tuning purposes.
tr: Hiçbir yapılandırma anahtarı değiştirilmedi veya yeniden adlandırılmadı. VNC ve ağ yığınının çeşitli dahili ayarları (zaman aşımları ve aralıklar gibi) artık hata ayıklama ve ayarlama amaçları için komut satırında yapılandırılabilir.

source: Veyon 4.3 is mostly identical to Veyon 4.2. A new plugin has been added which allows logging in a particular user remotely on all computers. The ``config`` CLI module has been improved to handle specific data types (such as JSON data and option indices) more intelligently. Upgrading to Veyon 4.3 does not require any configuration changes. Since only a new plugin has been added and some commands of the ``config`` CLI module have been extended the risk of regressions is very low.
tr: Veyon 4.3, Veyon 4.2 ile büyük ölçüde aynıdır. Tüm bilgisayarlarda belirli bir kullanıcının uzaktan oturum açmasına izin veren yeni bir eklenti eklendi. ``config`` CLI modülü, belirli veri türlerini (JSON verileri ve seçenek dizinleri gibi) daha akıllıca işlemek için iyileştirildi. Veyon 4.3'e yükseltme herhangi bir yapılandırma değişikliği gerektirmez. Sadece yeni bir eklenti eklendiği ve ``config`` CLI modülünün bazı komutları genişletildiği için gerileme riski çok düşüktür.

source: There are no structural changes in Veyon 4.3.
tr: Veyon 4.3’te yapısal bir değişiklik bulunmuyor.

source: No configuration keys have been changed or renamed. The only new configuration keys are directly related to the new remote log in feature and usually do not have to be changed.
tr: Hiçbir yapılandırma anahtarı değiştirilmedi veya yeniden adlandırılmadı. Tek yeni yapılandırma anahtarları doğrudan yeni uzaktan oturum açma özelliğiyle ilgilidir ve genellikle değiştirilmeleri gerekmez.

source: Veyon 4.2 continues the Veyon 4 major release series with many internal modernizations, user interface optimizations and performance improvements in many areas. Veyon 4.2 lays the foundation for commercial add-ons offered starting in the second half of 2019. The following new features and improvements can be found in Veyon 4.2:
tr: Veyon 4.2, birçok alanda birçok dahili modernizasyon, kullanıcı arayüzü optimizasyonu ve performans iyileştirmesiyle Veyon 4 ana sürüm serisini sürdürüyor. Veyon 4.2, 2019'un ikinci yarısından itibaren sunulan ticari eklentilerin temelini atıyor. Veyon 4.2'de aşağıdaki yeni özellikler ve iyileştirmeler bulunabilir:

source: The network object management layer has been revised to allow using multi-level hierarchies in commercial add-ons.
tr: Ticari eklentilerde çok seviyeli hiyerarşilerin kullanılmasına olanak sağlamak için ağ nesne yönetim katmanı revize edildi.

source: The automatic detection of user interface language in some countries has been improved (e.g. use German in Austria or Switzerland).
tr: Bazı ülkelerde kullanıcı arayüzü dilinin otomatik olarak algılanması iyileştirildi (örneğin Avusturya veya İsviçre'de Almanca kullanılması).

source: Context information in log messages have been improved.
tr: Günlük mesajlarındaki bağlam bilgileri iyileştirildi.

source: The computer sort order can now be configured.
tr: Bilgisayar sıralama düzeni artık yapılandırılabilir.

source: The internal data models have been improved leading to more stability and reliability.
tr: Dahili veri modelleri iyileştirilerek daha fazla istikrar ve güvenilirlik sağlandı.

source: The connection and message handling has been improved to reduce latencies.
tr: Bağlantı ve mesaj işleme, gecikmeleri azaltmak için iyileştirildi.

source: New view modes "Standard" and "Advanced" have been added.
tr: Yeni görünüm modları "Standart" ve "Gelişmiş" eklendi.

source: An authentication test functionality has been added.
tr: Kimlik doğrulama testi işlevi eklendi.

source: The new file transfer plugin allows sending files to all users and open them automatically if requested.
tr: Yeni dosya transfer eklentisi, dosyaların tüm kullanıcılara gönderilmesine ve istendiğinde otomatik olarak açılmasına olanak tanır.

source: Wake-on-LAN can be used in the CLI via the power module.
tr: Wake-on-LAN, güç modülü aracılığıyla CLI'da kullanılabilir.

source: The builtin network object directory gained support for importing CSV files with a type column.
tr: Yerleşik ağ nesnesi dizini, tür sütunu olan CSV dosyalarını içe aktarmak için destek kazandı.

source: The power down feature supports additional options to install updates, confirm shutdown or power down after timeout.
tr: Güç kapatma özelliği, güncellemeleri yükleme, kapatmayı onaylama veya zaman aşımından sonra gücü kapatma gibi ek seçenekleri destekler.

source: Users can now add custom programs and websites to the respective menu.
tr: Kullanıcılar artık ilgili menüye özel programlar ve internet siteleri ekleyebilecekler.

source: Thumbnail updates can be slowed down while the demo mode is active. This improves performance and reduces network traffic.
tr: Gösteri modu etkinken küçük resim güncellemeleri yavaşlatılabilir. Bu, performansı iyileştirir ve ağ trafiğini azaltır.

source: Browse buttons have been added to the configuration pages.
tr: Yapılandırma sayfalarına gözatma butonları eklendi.

source: A new attribute for the computer display name has been added.
tr: Bilgisayar görüntüleme adı için yeni bir öznitelik eklendi.

source: Computer attribute queries have been optimized to decrease load on the LDAP/AD server.
tr: LDAP/AD sunucusundaki yükü azaltmak için bilgisayar öznitelik sorguları optimize edildi.

source: Computer location queries used by access control have been fixed if containers/OUs are used as locations.
tr: Konum olarak konteynerler/OU'lar kullanılıyorsa, erişim denetimi tarafından kullanılan bilgisayar konum sorguları düzeltildi.

source: The result messages of the integration tests have been improved.
tr: Entegrasyon testlerinin sonuç mesajlarında iyileştirmeler yapıldı.

source: A configuration page with platform-specific settings has been added.
tr: Platformlara özel ayarların yer aldığı bir yapılandırma sayfası eklendi.

source: The PAM service ``login`` instead of ``su`` is now used to authenticate users.
tr: Kullanıcıların kimlik doğrulamasında artık ``su`` yerine ``login`` PAM servisi kullanılıyor.

source: Support for using a custom PAM service such as ``veyon`` has been added.
tr: ``Veyon`` gibi özel bir PAM servisinin kullanımına yönelik destek eklendi.

source: Platform-specific network code has been improved for more reliable network connections.
tr: Daha güvenilir ağ bağlantıları için platformlara özgü ağ kodu iyileştirildi.

source: An alternative authentication mechanism has been added for cases where the SSPI-based mechanism does not work.
tr: SSPI tabanlı mekanizmanın çalışmadığı durumlar için alternatif bir kimlik doğrulama mekanizması eklendi.

source: The screen lock feature can now disable and hide the taskbar, start button and start menu.
tr: Ekran kilidi özelliği artık görev çubuğunu, başlat düğmesini ve başlat menüsünü devre dışı bırakabiliyor ve gizleyebiliyor.

source: The underlying Qt framework has been updated to the LTS version 5.12 leading to better Windows 10 support.
tr: Altta yatan Qt çerçevesi, Windows 10 desteğini artıracak şekilde LTS sürüm 5.12'ye güncellendi.

source: Performance and security of the builtin UltraVNC server have been improved.
tr: Dahili UltraVNC sunucusunun performansı ve güvenliği iyileştirildi.

source: Starting with Veyon 4.2 the more generic term *location* instead of *room* is used wherever appropriate. This affects both the user interface and configuration key names. The wording has been changed to better reflect where computers are located in multi-level hierarchies.
tr: Veyon 4.2'den başlayarak, uygun olan her yerde *oda* yerine daha genel bir terim olan *konum* kullanılır. Bu, hem kullanıcı arayüzünü hem de yapılandırma anahtar adlarını etkiler. Bilgisayarların çok seviyeli hiyerarşilerde nerede bulunduğunu daha iyi yansıtacak şekilde ifadeler değiştirildi.

source: In Veyon 4.2 the command line utility has been renamed to ``veyon-cli``. All occurrences of the old name ``veyon-ctl`` in your scripts and installation routines have to be replaced accordingly. On Windows there's also a new non-console version ``veyon-wcli`` which allows automating tasks without irritating command line window popups.
tr: Veyon 4.2'de komut satırı yardımcı programının adı ``veyon-cli`` olarak değiştirildi. Komut dosyalarınızda ve kurulum rutinlerinizde eski ``veyon-ctl`` adının tüm örnekleri buna göre değiştirilmelidir. Windows'ta ayrıca komut satırı penceresi açılır pencerelerini rahatsız etmeden görevleri otomatikleştirmeye izin veren yeni bir konsol dışı sürüm ``veyon-wcli`` de bulunmaktadır.

source: On Linux the systemd unit has been renamed from ``veyon-service.service`` to ``veyon.service``.
tr: Linux'ta systemd birimi ``veyon-service.service``'den ``veyon.service``'e yeniden adlandırıldı.

source: The Veyon Configurator no longer shows all configuration options per default in order to present a cleaner user interface. If you miss certain advanced options you can switch the view to :guilabel:`Advanced` through the :guilabel:`View` menu.
tr: Veyon Yapılandırıcısı artık daha temiz bir kullanıcı arayüzü sunmak için tüm yapılandırma seçeneklerini varsayılan olarak göstermiyor. Belirli gelişmiş seçenekleri kaçırırsanız, görünümü :guilabel:`Görünüm` menüsü aracılığıyla :guilabel:`Gelişmiş` olarak değiştirebilirsiniz.

source: Several configuration keys have been renamed in Veyon 4.2. When upgrading to Veyon 4.2 or newer the new configuration keys will be populated with the values of the old keys automatically.
tr: Veyon 4.2'de birkaç yapılandırma anahtarı yeniden adlandırıldı. Veyon 4.2 veya daha yeni bir sürüme yükseltme yaparken yeni yapılandırma anahtarları otomatik olarak eski anahtarların değerleriyle doldurulacak.

source: Veyon 4.1 was the first feature release series of Veyon 4. Even though not visible to the end user the most notable change is the platform support modularization, i.e. all platform-specific functions have been moved to distinct plugins. This has significantly improved the support of the individual platforms and makes it easier to support further platforms in the future. In addition to that Veyon 4.1 offers many improvements and new features compared to 4.0:
tr: Veyon 4.1, Veyon 4'ün ilk özellik yayın serisiydi. Son kullanıcı tarafından görülmese de en dikkat çekici değişiklik platform desteği modülerleştirmesidir, yani tüm platforma özgü işlevler ayrı eklentilere taşınmıştır. Bu, bireysel platformların desteğini önemli ölçüde iyileştirmiştir ve gelecekte daha fazla platformu desteklemeyi kolaylaştırır. Buna ek olarak Veyon 4.1, 4.0'a kıyasla birçok iyileştirme ve yeni özellik sunar:

source: All passwords in configuration are now encrypted.
tr: Yapılandırmadaki tüm parolalar artık şifrelendi.

source: Platform-specific code has been moved into platform plugins.
tr: Platforma özgü kodlar platform eklentilerine taşındı.

source: Computers can now be arranged via drag and drop.
tr: Artık bilgisayarlar sürükle bırak yöntemiyle düzenlenebilecek.

source: A button for hiding powered off computers has been added.
tr: Kapalı bilgisayarları gizlemek için bir buton eklendi.

source: Refresh interval, background color and thumbnail caption are now configurable.
tr: Yenileme aralığı, arka plan rengi ve küçük resim yazısı artık yapılandırılabilir.

source: Authentication key management for both Configurator and command line has been revised completely.
tr: Hem Configurator hem de komut satırı için kimlik doğrulama anahtarı yönetimi tamamen revize edildi.

source: Computers and rooms can now be managed at the command line.
tr: Bilgisayarlar ve odalar artık komut satırından yönetilebiliyor.

source: Computers and rooms can now be imported from CSV and text files.
tr: Bilgisayarlar ve odalar artık CSV ve metin dosyalarından içe aktarılabiliyor.

source: Predefined programs and websites for "run program" and "open website" features can be configured.
tr: "Programı çalıştır" ve "Web sitesini aç" özellikleri için önceden tanımlanmış programlar ve web siteleri yapılandırılabilir.

source: Support for encrypted SSL/TLS connections has been added.
tr: Şifreli SSL/TLS bağlantıları için destek eklendi.

source: Full systemd service support
tr: Tam systemd servis desteği

source: The shutdown/reboot/session logout mechanisms have been rewritten to use DBus calls.
tr: Kapatma/yeniden başlatma/oturum kapatma mekanizmaları DBus çağrılarını kullanacak şekilde yeniden yazıldı.

source: All builds are based on an updated toolchain with GCC 7.3, Qt 5.9 LTS and OpenSSL 1.1.
tr: Tüm sürümler GCC 7.3, Qt 5.9 LTS ve OpenSSL 1.1 ile güncellenmiş araç zincirine dayanmaktadır.

source: As part of the changes for systemd support on Linux, in Veyon 4.1 the Veyon Service component has been split into two separate components. The Veyon Service no longer contains the actual functions to provide access to a computer. These functions have been moved into the new Veyon Server component which runs as a standalone process in user sessions. The Veyon Service now only monitors user sessions on a computer and starts Veyon Server instances within these sessions.
tr: Linux'taki systemd desteğindeki değişikliklerin bir parçası olarak, Veyon 4.1'de Veyon Service bileşeni iki ayrı bileşene ayrıldı. Veyon Service artık bir bilgisayara erişim sağlamak için gerçek işlevleri içermiyor. Bu işlevler, kullanıcı oturumlarında bağımsız bir işlem olarak çalışan yeni Veyon Server bileşenine taşındı. Veyon Service artık yalnızca bir bilgisayardaki kullanıcı oturumlarını izliyor ve bu oturumlar içinde Veyon Server örneklerini başlatıyor.

source: The ``LocalData`` plugin has been split into the ``BuiltinDirectory`` and ``SystemUserGroups`` plugins. This allows using different data sources for access control, e.g. computers from an LDAP directory in combination with local user groups. After upgrading you should verify that the appropriate network object directory and access control user groups backend are selected as desired.
tr: ``LocalData`` eklentisi ``BuiltinDirectory`` ve ``SystemUserGroups`` eklentilerine bölünmüştür. Bu, erişim denetimi için farklı veri kaynaklarının kullanılmasına izin verir, örneğin yerel kullanıcı gruplarıyla birlikte bir LDAP dizinindeki bilgisayarlar. Yükseltmeden sonra uygun ağ nesne dizininin ve erişim denetimi kullanıcı grupları arka ucunun istenildiği gibi seçildiğini doğrulamalısınız.

source: The following configuration keys have changed in Veyon 4.1:
tr: Veyon 4.1'de aşağıdaki yapılandırma anahtarları değişti:

source: In Veyon 4.0 this key contained the unencrypted password for an external VNC server. Starting with Veyon 4.1 this password is always stored encrypted. It will be encrypted automatically when upgrading the configuration to 4.1. There's no way to encrypt the password manually. When downgrading to 4.0 the password needs to be set explicitly again.
tr: Veyon 4.0'da bu anahtar harici bir VNC sunucusu için şifrelenmemiş parolayı içeriyordu. Veyon 4.1'den başlayarak bu parola her zaman şifrelenmiş olarak saklanır. Yapılandırma 4.1'e yükseltildiğinde otomatik olarak şifrelenecektir. Parolayı manuel olarak şifrelemenin bir yolu yoktur. 4.0'a düşürüldüğünde parolanın tekrar açıkça ayarlanması gerekir.

source: In Veyon 4.0 this key contained the unencrypted LDAP bind password. Starting with Veyon 4.1 this password is always stored encrypted. It will be encrypted automatically when upgrading the configuration to 4.1. There's no way to encrypt the password manually. When downgrading to 4.0 the password needs to be set explicitly again.
tr: Veyon 4.0'da bu anahtar şifrelenmemiş LDAP bağlama parolasını içeriyordu. Veyon 4.1'den başlayarak bu parola her zaman şifrelenmiş olarak saklanır. Yapılandırma 4.1'e yükseltildiğinde otomatik olarak şifrelenecektir. Parolayı manuel olarak şifrelemenin bir yolu yoktur. 4.0'a düşürüldüğünde parolanın tekrar açıkça ayarlanması gerekir.

source: Veyon 4.0 used a non-standard syntax for LDAP filters. This has been fixed in Veyon 4.1 where all filter expressions must be placed in parentheses. The expressions will be adjusted automatically when upgrading the configuration to 4.1.
tr: Veyon 4.0, LDAP filtreleri için standart dışı bir sözdizimi kullanıyordu. Bu, tüm filtre ifadelerinin parantez içine yerleştirilmesi gereken Veyon 4.1'de düzeltildi. Yapılandırma 4.1'e yükseltildiğinde ifadeler otomatik olarak ayarlanacaktır.

source: In Veyon 4.0 the builtin network object directory was provided by a different plugin. Starting with Veyon 4.1 locations and computers are stored in ``BuiltinDirectory/NetworkObjects`` instead of ``LocalData/NetworkObjects``.
tr: Veyon 4.0'da yerleşik ağ nesnesi dizini farklı bir eklenti tarafından sağlanıyordu. Veyon 4.1'den başlayarak konumlar ve bilgisayarlar ``LocalData/NetworkObjects`` yerine ``BuiltinDirectory/NetworkObjects``'te saklanıyor.

source: Veyon 4.0 was the first release series of Veyon 4, the successor of iTALC. It features a modular architecture, a rewritten Master application and LDAP/AD support. As of December 2018 the Veyon 4.0.x series is marked end-of-life and will not receive updates any longer.
tr: Veyon 4.0, iTALC'ın halefi olan Veyon 4'ün ilk sürüm serisiydi. Modüler bir mimari, yeniden yazılmış bir Ana uygulama ve LDAP/AD desteği içerir. Aralık 2018 itibarıyla Veyon 4.0.x serisi kullanım ömrünün sonuna gelmiştir ve artık güncelleme almayacaktır.

source: Troubleshooting
tr: Sorun giderme
