Repository: veyon/docs
Catalog: locale/*/LC_MESSAGES/admin.po
Languages: tr

source: There are known issues with specific KDE and Qt versions on Linux causing the Veyon Server to crash. This affects several other VNC server implementations as well. If you're affected by such crashes consider upgrading KDE/Qt. As a last resort you can disable the X Damage extension in the VNC server configuration. This will however decrease overall performance and increase the CPU load.
tr: Linux'taki belirli KDE ve Qt sürümlerinde Veyon Server'ın çökmesine neden olan bilinen sorunlar vardır. Bu, diğer birkaç VNC server uygulamasını da etkiler. Bu tür çökmelerden etkileniyorsanız KDE/Qt'yi yükseltmeyi düşünün. Son çare olarak VNC server yapılandırmasındaki X Damage uzantısını devre dışı bırakabilirsiniz. Ancak bu, genel performansı düşürecek ve CPU yükünü artıracaktır.

source: Some features such as starting apps or opening websites do not work
tr: Uygulamaları başlatma veya web sitelerini açma gibi bazı özellikler çalışmıyor

source: It has been reported that problems arise if the username and the computer name are identical. When logging in a user called ``student`` on a computer with the hostname ``student``, some features will fail to start when the user session is being controlled via Veyon Master.
tr: Kullanıcı adı ve bilgisayar adı aynıysa sorun çıktığı bildirilmiştir. ``student`` adlı bir kullanıcı ``student`` adlı bir bilgisayara giriş yaptığında, kullanıcı oturumu Veyon Master üzerinden kontrol edildiğinde bazı özellikler başlatılamayacaktır.

source: Debugging
tr: Hata ayıklama

source: Error analysis
tr: Hata analizi

source: Error correction
tr: Hata düzeltilmesi

source: Connectivity problems
tr: Bağlantı sorunları
