Repository: veyon/docs
Catalog: locale/*/LC_MESSAGES/admin.po
Languages: tr

source: If you encounter interaction or connection problems between master and client computers you should always ensure that an identical Veyon configuration is used on all computers. To avoid problems in general it's recommended to automate the configuration transfer during :ref:`installation <AutoInstall>` or via the :ref:`CommandLineInterface` instead of importing the configuration manually using the Veyon Configurator. The configuration must also be transferred to all affected computers each time a change is made during troubleshooting.
tr: Ana ve istemci bilgisayarlar arasında etkileşim veya bağlantı sorunlarıyla karşılaşırsanız, her zaman tüm bilgisayarlarda aynı Veyon yapılandırmasının kullanıldığından emin olmalısınız. Genel olarak sorunlardan kaçınmak için, yapılandırmayı Veyon Yapılandırıcısı'nı kullanarak manuel olarak içe aktarmak yerine :ref:`kurulum <AutoInstall>` sırasında veya :ref:`CommandLineInterface` aracılığıyla yapılandırma aktarımını otomatikleştirmeniz önerilir. Ayrıca, sorun giderme sırasında bir değişiklik yapıldığında yapılandırmanın tüm etkilenen bilgisayarlara aktarılması gerekir.

source: Computers can't be accessed
tr: Bilgisayarlara erişilemiyor

source: There are multiple causes which can prevent access to a computer using Veyon Master.
tr: Veyon Master kullanarak bir bilgisayara erişimi engelleyebilecek birden fazla neden vardır.

source: Networking problems
tr: Ağ sorunları

source: First of all the general network connectivity of the computer should be checked. Use the utility ``ping`` (which is usually included with every operating system) to diagnose connectivity problems.
tr: Öncelikle bilgisayarın genel ağ bağlantısı kontrol edilmelidir. Bağlantı sorunlarını teşhis etmek için ``ping`` yardımcı programını (genellikle her işletim sistemine dahil edilir) kullanın.

source: Problems with the Veyon Service
tr: Veyon Hizmetiyle İlgili Sorunlar

source: If the computer can be pinged you should verify that the Veyon Service is running correctly. Open the Veyon Configurator and open the configuration page :ref:`RefService`. In the section :ref:`RefServiceGeneral` the status of the service should be displayed with status *Running*. Otherwise the service can be started using the button :guilabel:`Start service`. If this is not successful you should try reinstalling Veyon. If a new installation does not help you can check the log files of the Veyon Service as well as the logging messages of the operating system for error messages and possible causes. Additionally you can find more hints or settings in the service management of your operating system.
tr: Bilgisayar pinglenebiliyorsa Veyon Servisinin doğru çalıştığını doğrulamalısınız. Veyon Configurator'ı açın ve yapılandırma sayfasını açın :ref:`RefService`. :ref:`RefServiceGeneral` bölümünde servisin durumu *Çalışıyor* durumuyla görüntülenmelidir. Aksi takdirde servis :guilabel:`Servisi başlat` düğmesi kullanılarak başlatılabilir. Bu başarılı olmazsa Veyon'u yeniden yüklemeyi denemelisiniz. Yeni bir kurulum yardımcı olmazsa Veyon Servisinin günlük dosyalarını ve işletim sisteminin günlük mesajlarını hata mesajları ve olası nedenler açısından kontrol edebilirsiniz. Ek olarak işletim sisteminizin servis yönetiminde daha fazla ipucu veya ayar bulabilirsiniz.

source: Service and firewall settings
tr: Hizmet ve güvenlik duvarı ayarları

source: If the service is running you have to ensure that it is listening for incoming connections on the correct network port. You can verify that on the local computer using ``telnet``:
tr: Hizmet çalışıyorsa, doğru ağ bağlantı noktasında gelen bağlantıları dinlediğinden emin olmalısınız. Bunu yerel bilgisayarda ``telnet`` kullanarak doğrulayabilirsiniz:

source: Besides general program output the character string ``RFB 003.008`` must be displayed. If the output does not contain these characters you should check the :ref:`network port number settings <RefNetworkPortNumbers>` and :ref:`Miscellaneous network settings <RefNetworkMisc>`, especially the Veyon server port number. You should try to reset them to their default values.
tr: Genel program çıktısının yanı sıra ``RFB 003.008`` karakter dizisi görüntülenmelidir. Çıktı bu karakterleri içermiyorsa :ref:`network port number settings <RefNetworkPortNumbers>` ve :ref:`Miscellaneous network settings <RefNetworkMisc>` öğelerini, özellikle Veyon server port numarasını kontrol etmelisiniz. Bunları varsayılan değerlerine sıfırlamayı denemelisiniz.

source: Next the same access has to be possible from a different computer in the network. The utility ``telnet`` can be used again for the diagnosis. The program argument ``localhost`` has to be replaced with the name or IP address of the corresponding computer. If the access fails please ensure that the option :guilabel:`Allow connections from localhost only` in the :ref:`Miscellaneous network settings <RefNetworkMisc>` is disabled. Additionally :ref:`computer access control <ComputerAccessControl>` should be disabled initially as the service otherwise might listen on ``localhost`` only. This can happen if the external access would be denied because of currently matching rules. If both settings are correct the output of
tr: Sonra aynı erişim ağdaki farklı bir bilgisayardan mümkün olmalıdır. ``telnet`` yardımcı programı tanılama için tekrar kullanılabilir. ``localhost`` program argümanı ilgili bilgisayarın adı veya IP adresiyle değiştirilmelidir. Erişim başarısız olursa lütfen :ref:`Çeşitli ağ ayarları <RefNetworkMisc>`'deki :guilabel:`Yalnızca localhost'tan gelen bağlantılara izin ver` seçeneğinin devre dışı olduğundan emin olun. Ek olarak :ref:`bilgisayar erişim denetimi <ComputerAccessControl>` başlangıçta devre dışı bırakılmalıdır, aksi takdirde hizmet yalnızca ``localhost``'u dinleyebilir. Bu, şu anda eşleşen kurallar nedeniyle harici erişimin reddedilmesi durumunda olabilir. Her iki ayar da doğruysa çıktı

source: has to indicate that the service is not (only) listening on ``localhost`` or ``127.0.0.1`` (status ``LISTEN`` or similar).
tr: hizmetin (sadece) ``localhost`` veya ``127.0.0.1`` (durum ``LISTEN`` veya benzeri) üzerinde dinlemediğini belirtmelidir.

source: If the port access from remote computers still fails usually a firewall prevents the access and has to be reconfigured accordingly. On Linux this concerns settings of ``iptables``, ``ufw`` etc. Consult the corresponding manuals of the used software. On Windows Veyon automatically configures the integrated Windows firewall if the option :guilabel:`Enable firewall exception` in the :ref:`Miscellaneous network settings <RefNetworkMisc>` is set to its default value (*enabled*). If a 3rd party firewall solution is used it must be configured to allow external access to TCP ports 11100 (Veyon server port) and 11400 (demo server).
tr: Uzak bilgisayarlardan port erişimi hala başarısız olursa genellikle bir güvenlik duvarı erişimi engeller ve buna göre yeniden yapılandırılması gerekir. Linux'ta bu ``iptables``, ``ufw`` vb. ayarlarını ilgilendirir. Kullanılan yazılımın ilgili kılavuzlarına bakın. Windows'ta Veyon, :ref:`Miscellaneous network settings` içindeki :guilabel:`Enable firewall exception` <RefNetworkMisc>seçeneği varsayılan değerine (*enabled*) ayarlandığında entegre Windows güvenlik duvarını otomatik olarak yapılandırır. Üçüncü taraf bir güvenlik duvarı çözümü kullanılıyorsa, TCP portları 11100'e (Veyon sunucu portu) ve 11400'e (demo sunucusu) harici erişime izin verecek şekilde yapılandırılmalıdır.

source: Authentication settings
tr: Kimlik doğrulama ayarları

source: Another cause of the error can be wrong or insufficient :ref:`authentication settings <RefAuthentication>`. For first tests you should select :ref:`logon authentication <ConfLogonAuthentication>` instead of :ref:`key file authentication <ConfKeyFileAuthentication>` on both computers. As soon as the authentication test is successful on the local computer external access will also work.
tr: Hatanın bir diğer nedeni yanlış veya yetersiz :ref:`kimlik doğrulama ayarları <RefAuthentication>` olabilir. İlk testler için her iki bilgisayarda :ref:`anahtar dosyası kimlik doğrulaması <ConfKeyFileAuthentication>` yerine :ref:`oturum açma kimlik doğrulaması <ConfLogonAuthentication>`yi seçmelisiniz. Yerel bilgisayarda kimlik doğrulama testi başarılı olur olmaz harici erişim de çalışacaktır.

source: If :ref:`key file authentication <ConfKeyFileAuthentication>` is used the key files on master and client computers must match exactly. On client computers the public key file must have exactly the same content **and the same name** as on the master computer. If the access still fails the access permissions to the key files may be wrong. The Veyon Service needs to have read permissions on the *public key file* while the user of Veyon Master has to be able to read the *private key file*. If the problem persists the :ref:`key file directories <RefKeyFileDirectories>` of the key files should be deleted on all computers and a new key pair generated on the master computer. The public key must then be imported again on all client computers.
tr: :ref:`anahtar dosyası kimlik doğrulaması <ConfKeyFileAuthentication>` kullanılırsa ana ve istemci bilgisayarlardaki anahtar dosyaları tam olarak eşleşmelidir. İstemci bilgisayarlarda ortak anahtar dosyası ana bilgisayardakiyle tam olarak aynı içeriğe **ve aynı ada** sahip olmalıdır. Erişim yine de başarısız olursa anahtar dosyalarına erişim izinleri yanlış olabilir. Veyon Hizmetinin *ortak anahtar dosyası* üzerinde okuma izinlerine sahip olması gerekirken Veyon Ana kullanıcısı *özel anahtar dosyasını* okuyabilmelidir. Sorun devam ederse anahtar dosyalarının :ref:`anahtar dosyası dizinleri <RefKeyFileDirectories>` tüm bilgisayarlardan silinmeli ve ana bilgisayarda yeni bir anahtar çifti oluşturulmalıdır. Ortak anahtar daha sonra tüm istemci bilgisayarlara tekrar aktarılmalıdır.

source: Settings for computer access control
tr: Bilgisayar erişim kontrolü ayarları

source: An incorrect configuration of computer access control can also lead to computers being inaccessible. Initially it's recommended to disable :ref:`computer access control <ComputerAccessControl>` completely using the Veyon Configurator. This allows you to determine which method of computer access control may be configured incorrectly.
tr: Bilgisayar erişim kontrolünün yanlış yapılandırılması da bilgisayarların erişilemez olmasına yol açabilir. Başlangıçta, Veyon Yapılandırıcısı kullanılarak :ref:`bilgisayar erişim kontrolü <ComputerAccessControl>`in tamamen devre dışı bırakılması önerilir. Bu, hangi bilgisayar erişim kontrolü yönteminin yanlış yapılandırılabileceğini belirlemenizi sağlar.

source: If :ref:`authorized user groups for computer access <RefAuthorizedUserGroups>` are used you should check whether the list of authorized user groups is complete and whether the accessing user is a member of one of these user groups.
tr: :ref:`Bilgisayar erişimi için yetkili kullanıcı grupları <RefAuthorizedUserGroups>` kullanılıyorsa, yetkili kullanıcı grupları listesinin eksiksiz olup olmadığını ve erişen kullanıcının bu kullanıcı gruplarından birinin üyesi olup olmadığını kontrol etmelisiniz.

source: Improperly configured :ref:`access control rules <AccessControlRules>` can also cause problems with accessing computers. It is necessary to always specify at least one rule to allow access under certain conditions. If this is ensured, a temporary test rule can be inserted at the end of the list for further debugging. This rule should be configured so that the option :guilabel:`Always process rule and ignore conditions` is enabled and the action :guilabel:`Allow access` is selected. This rule can then be moved up in the rule list step by step until the test returns the desired positive results and the access works. The access rule located directly below the test rule is then the cause for the access denial and can be examined more closely and corrected accordingly. Don't forget to remove the test rule afterwards to prevent unauthorized access.
tr: Uygunsuz şekilde yapılandırılmış :ref:`erişim kontrol kuralları <AccessControlRules>` de bilgisayarlara erişimde sorunlara yol açabilir. Belirli koşullar altında erişime izin vermek için her zaman en az bir kural belirtmek gerekir. Bu sağlanırsa, daha fazla hata ayıklama için listenin sonuna geçici bir test kuralı eklenebilir. Bu kural, :guilabel:`Kuralları her zaman işle ve koşulları yoksay` seçeneği etkinleştirilecek ve :guilabel:`Erişime izin ver` eylemi seçilecek şekilde yapılandırılmalıdır. Bu kural daha sonra, test istenen olumlu sonuçları döndürene ve erişim çalışana kadar kural listesinde adım adım yukarı taşınabilir. Test kuralının hemen altında bulunan erişim kuralı daha sonra erişim reddinin nedeni olur ve daha yakından incelenebilir ve buna göre düzeltilebilir. Yetkisiz erişimi önlemek için daha sonra test kuralını kaldırmayı unutmayın.

source: Anti-virus software
tr: Anti-virüs yazılımı

source: It has been reported by some users that an installed anti-virus software caused problems with Veyon, especially regarding the Veyon Service. As part of the troubleshooting process you should temporarily disable the anti-virus software in order to figure out whether the anti-virus software is the cause of error. If so, try to add an exception for the Veyon Service after enabling the anti-virus software again. Alternatively contact the vendor of your anti-virus software for further assistance.
tr: Bazı kullanıcılar tarafından, yüklenen bir anti-virüs yazılımının Veyon'da, özellikle Veyon Hizmeti ile ilgili sorunlara neden olduğu bildirilmiştir. Sorun giderme sürecinin bir parçası olarak, anti-virüs yazılımının hataya neden olup olmadığını anlamak için anti-virüs yazılımını geçici olarak devre dışı bırakmalısınız. Eğer öyleyse, anti-virüs yazılımını tekrar etkinleştirdikten sonra Veyon Hizmeti için bir istisna eklemeyi deneyin. Alternatif olarak, daha fazla yardım için anti-virüs yazılımınızın satıcısıyla iletişime geçin.

source: Time synchronization problems
tr: Zaman senkronizasyon sorunları

source: When using :ref:`logon authentication <ConfLogonAuthentication>`, Veyon requires the operating system to reliably perform user authentications on all remote computers. Especially in AD/Kerberos-based environments, authentication may not work reliably when the system clock is not synchronized with the domain controller or authentication server and differs significantly. Therefore make sure time synchronization is configured and working properly if you encounter sporadic connectivity problems when using Veyon.
tr: :ref:`logon authentication <ConfLogonAuthentication>` kullanıldığında, Veyon işletim sisteminin tüm uzak bilgisayarlarda kullanıcı kimlik doğrulamalarını güvenilir bir şekilde gerçekleştirmesini gerektirir. Özellikle AD/Kerberos tabanlı ortamlarda, sistem saati etki alanı denetleyicisi veya kimlik doğrulama sunucusuyla senkronize edilmediğinde ve önemli ölçüde farklılık gösterdiğinde kimlik doğrulama güvenilir bir şekilde çalışmayabilir. Bu nedenle, Veyon kullanırken ara sıra bağlantı sorunlarıyla karşılaşırsanız zaman senkronizasyonunun yapılandırıldığından ve düzgün çalıştığından emin olun.

source: Settings are not correctly saved/loaded
tr: Ayarlar doğru şekilde kaydedilmedi/yüklenmedi

source: After updating to a new version of Veyon it may happen in rare cases that some configuration keys are inconsistent and need to be recreated. This can result in settings not being saved or reloaded correctly, such as the builtin location and computer information. In this case the :ref:`configuration should be reset <ConfigReset>` and rebuilt based on the default values.
tr: Veyon'un yeni bir sürümüne güncelledikten sonra, nadir durumlarda bazı yapılandırma anahtarlarının tutarsız olması ve yeniden oluşturulması gerekebilir. Bu, yerleşik konum ve bilgisayar bilgileri gibi ayarların doğru şekilde kaydedilmemesi veya yeniden yüklenmemesiyle sonuçlanabilir. Bu durumda :ref:`yapılandırma <ConfigReset> olarak sıfırlanmalı` ve varsayılan değerlere göre yeniden oluşturulmalıdır.

source: Locations and computers from LDAP directory are not displayed in Veyon Master
tr: LDAP dizinindeki konumlar ve bilgisayarlar Veyon Master'da görüntülenmiyor

source: Please make sure that:
tr: Lütfen şunlardan emin olun:

source: the :ref:`network object directory <RefNetworkObjectDirectory>` on configuration page :guilabel:`General` is set to *LDAP Basic* or *LDAP Pro*
tr: :guilabel:`Genel` yapılandırma sayfasındaki :ref:`network object directory <RefNetworkObjectDirectory>` *LDAP Basic* veya *LDAP Pro* olarak ayarlanmıştır

source: LDAP integration tests :guilabel:`List all entries of a location` and :guilabel:`List all locations` are successful and return proper objects
tr: LDAP bütünleştirme testleri :guilabel:`Bir konumun tüm girişlerini listele` ve :guilabel:`Tüm konumları listele` başarılıdır ve uygun nesneleri döndürür

source: on the configuration page :guilabel:`Master` all options for fine-tuning the behavior are set to their default values
tr: :guilabel:`Master` yapılandırma sayfasında davranışı ince ayarlamak için tüm seçenekler varsayılan değerlerine ayarlanmıştır

source: Selecting current location automatically doesn't work
tr: Mevcut konumu otomatik olarak seçmek çalışmıyor

source: If the :ref:`option automatically selecting the current location <RefAutoSelectLocation>` is activated, but has no effect when starting Veyon Master, you should first make sure that the master computer is also listed as a computer for the respective room in the :ref:`network object directory <RefNetworkObjectDirectory>`.
tr: Eğer :ref:`Otomatik olarak geçerli konum <RefAutoSelectLocation>'i seçen seçenek` aktifse, fakat Veyon Master'ı başlatırken bir etkisi olmazsa, öncelikle ana bilgisayarın :ref:`ağ nesnesi dizini <RefNetworkObjectDirectory>`de ilgili oda için bir bilgisayar olarak da listelendiğinden emin olmalısınız.

source: If the problem persists although all entries in the network object directory are correct, there is usually a problem with the DNS configuration in the network. Make sure that computer names can be resolved to IP addresses and reverse lookups of IP addresses return the corresponding computer names. On most operating systems, the DNS diagnostic tool ``nslookup`` is available for this purpose. Calling the program with the local computer name as an argument must return a valid IP address. A second call with the determined IP address must again return the computer name.
tr: Ağ nesnesi dizinindeki tüm girdiler doğru olmasına rağmen sorun devam ederse, genellikle ağdaki DNS yapılandırmasında bir sorun vardır. Bilgisayar adlarının IP adreslerine çözülebildiğinden ve IP adreslerinin ters aramalarının karşılık gelen bilgisayar adlarını döndürdüğünden emin olun. Çoğu işletim sisteminde, DNS tanılama aracı ``nslookup`` bu amaç için kullanılabilir. Programı yerel bilgisayar adını bir argüman olarak kullanarak çağırmak geçerli bir IP adresi döndürmelidir. Belirlenen IP adresiyle yapılan ikinci bir çağrı yine bilgisayar adını döndürmelidir.

source: If the function does not work as desired despite correct DNS setup, in the second step the :ref:`log level <RefLoglevel>` can be set to the highest value (*Debug messages and everything else*). After restarting Veyon Master, you can search the log file ``VeyonMaster.log`` in the :ref:`log file directory <RefLogFileDirectory>` for further error causes. The lines with the messages *"initializing locations"* and *"found locations"* indicate which host names and IP addresses were used to determine the location and which locations were eventually determined on the basis of these information.
tr: Doğru DNS kurulumuna rağmen işlev istenildiği gibi çalışmıyorsa, ikinci adımda :ref:`log level <RefLoglevel>` en yüksek değere ayarlanabilir (*Hata ayıklama mesajları ve diğer her şey*). Veyon Master'ı yeniden başlattıktan sonra, daha fazla hata nedeni için :ref:`log dosyası dizini <RefLogFileDirectory>`deki ``VeyonMaster.log`` günlük dosyasını arayabilirsiniz. *"konumlar başlatılıyor"* ve *"bulunan konumlar"* mesajlarının bulunduğu satırlar, konumu belirlemek için hangi ana bilgisayar adlarının ve IP adreslerinin kullanıldığını ve hangi konumların sonunda bu bilgilere dayanarak belirlendiğini gösterir.

source: Screen lock can be bypassed via Ctrl+Alt+Del
tr: Ekran kilidi Ctrl+Alt+Del ile atlatılabilir

source: To completely block all keystrokes and keyboard shortcuts in screen lock mode, you must restart your computer after installing Veyon on Windows. Without a restart, the Veyon-specific driver for input devices is not yet active and keystrokes cannot be intercepted.
tr: Ekran kilidi modunda tüm tuş vuruşlarını ve klavye kısayollarını tamamen engellemek için, Veyon'u Windows'a yükledikten sonra bilgisayarınızı yeniden başlatmanız gerekir. Yeniden başlatma olmadan, giriş aygıtları için Veyon'a özgü sürücü henüz etkin değildir ve tuş vuruşları engellenemez.

source: In demo mode, only a black screen or window with a blue loading spinner is displayed on client computers
tr: Gösteri modunda, istemci bilgisayarlarda yalnızca siyah bir ekran veya mavi yükleme döndürücüsü olan bir pencere görüntülenir

source: the user of Veyon Master has access to its own computer (i.e. the local Veyon Service). When using the :ref:`key file authentication <ConfKeyFileAuthentication>` make sure the public key is deployed to both student **and** teacher computers.
tr: Veyon Master kullanıcısı kendi bilgisayarına (yani yerel Veyon Servisi'ne) erişebilir. :ref:`anahtar dosyası kimlik doğrulaması <ConfKeyFileAuthentication>` kullanılırken, genel anahtarın hem öğrenci **hem** öğretmen bilgisayarlarına dağıtıldığından emin olun.

source: in the :ref:`access control ruleset <AccessControlRules>` there's no rule preventing the teacher from accessing its own computer, e.g. a rule prohibiting access to a computer if a teacher is logged on. In this case you should create a rule with the condition :ref:`Accessing computer is localhost <AccessingComputerIsLocalhost>` enabled as far up the list of rules as possible. Otherwise the demo server is unable to access the teacher computer's screen content and distribute it to the client computers.
tr: :ref:`erişim denetimi kuralları seti <AccessControlRules>`de öğretmenin kendi bilgisayarına erişmesini engelleyen bir kural yoktur, örneğin bir öğretmen oturum açmışsa bilgisayara erişimi yasaklayan bir kural. Bu durumda, kural listesinde mümkün olduğunca yukarıda :ref:`Erişim bilgisayarı localhost <AccessingComputerIsLocalhost>` koşulunun etkinleştirildiği bir kural oluşturmalısınız. Aksi takdirde demo sunucusu öğretmen bilgisayarının ekran içeriğine erişemez ve bunu istemci bilgisayarlara dağıtamaz.

source: in the configuration page :guilabel:`Service` under :ref:`network port numbers <RefNetworkPortNumbers>` the demo server port is set to its default value ``11400``
tr: Yapılandırma sayfasında :guilabel:`Service` altında :ref:`network port numbers <RefNetworkPortNumbers>` demo sunucusu portu varsayılan değeri olan ``11400`` olarak ayarlanmıştır

source: on the configuration page :guilabel:`Service` the firewall exception is enabled on the master computer or a third party firewall is configured to allow incoming connections to TCP port ``11400``
tr: yapılandırma sayfasında :guilabel:`Service` güvenlik duvarı istisnası ana bilgisayarda etkinleştirilmiş veya üçüncü taraf bir güvenlik duvarı TCP portu ``11400``'a gelen bağlantılara izin verecek şekilde yapılandırılmış

source: Veyon Server crashes with XIO or XCB errors on Linux
tr: Veyon Sunucusu Linux'ta XIO veya XCB hatalarıyla çöküyor
