Repository: veyon/docs
Catalog: locale/*/LC_MESSAGES/admin.po
Languages: tr

source: The selection of displayed computers is saved in the personal :ref:`user configuration <RefUserConfiguration>`. There are two ways to share this configuration with multiple users. Either the user configuration file can be copied into the profile of the user, e.g. via login scripts. Alternatively, the user configuration can be also be stored in a shared directory (e.g. a network drive) and the :ref:`user configuration setting <RefUserConfiguration>` has to be changed accordingly so that the user configuration is loaded from this directory. Please note that the access rights may have to be adjusted so that changes made by users are not written back into the global user configuration.
tr: Görüntülenen bilgisayarların seçimi kişisel :ref:`kullanıcı yapılandırması <RefUserConfiguration>`'de kaydedilir. Bu yapılandırmayı birden fazla kullanıcıyla paylaşmanın iki yolu vardır. Kullanıcı yapılandırma dosyası kullanıcının profiline kopyalanabilir, örneğin oturum açma komut dosyaları aracılığıyla. Alternatif olarak, kullanıcı yapılandırması paylaşılan bir dizinde (örneğin bir ağ sürücüsü) de saklanabilir ve :ref:`kullanıcı yapılandırması ayarı <RefUserConfiguration>` buna göre değiştirilmelidir, böylece kullanıcı yapılandırması bu dizinden yüklenir. Lütfen erişim haklarının, kullanıcılar tarafından yapılan değişikliklerin genel kullanıcı yapılandırmasına geri yazılmaması için ayarlanması gerekebileceğini unutmayın.

source: In this context please also refer the function :ref:`Automatic switch to current classroom <RefAutoSelectLocation>`, which can be used to directly realize the desired behavior.
tr: Bu bağlamda, istenilen davranışı doğrudan gerçekleştirmek için kullanılabilen :ref:`Otomatik olarak mevcut sınıf <RefAutoSelectLocation>'e geçiş` fonksiyonuna da bakınız.

source: How can I hide the master computer from computer locations?
tr: Ana bilgisayarı bilgisayar konumlarından nasıl gizleyebilirim?

source: All you need to do is enable the option :ref:`Hide local computer <RefAutoHideLocalComputer>` in the master configuration page.
tr: Tek yapmanız gereken ana yapılandırma sayfasında :ref:`Yerel bilgisayar <RefAutoHideLocalComputer>'i gizle` seçeneğini etkinleştirmek.

source: What happens if there is no matching access control rule?
tr: Eşleşen erişim kontrol kuralı yoksa ne olur?

source: If there is no rule where all activated conditions apply when processing the configured access control rules, access is denied and the connection is closed. This prevents an attacker from being accidentally granted access due to an incomplete ruleset.
tr: Yapılandırılmış erişim kontrol kurallarını işlerken tüm etkinleştirilmiş koşulların geçerli olduğu bir kural yoksa, erişim reddedilir ve bağlantı kapatılır. Bu, bir saldırganın eksik bir kural kümesi nedeniyle yanlışlıkla erişim almasını önler.

source: Technical glossary
tr: Teknik sözlük

source: From Wikipedia, the free encyclopedia:
tr: Özgür ansiklopedi Vikipedi'den:

source: Access Control List
tr: Erişim Denetim Listesi

source: Client
tr: İstemci

source: a piece of computer hardware or software that accesses a service made available by a server.
tr: Bir sunucu tarafından sağlanan bir hizmete erişen bir bilgisayar donanım veya yazılım parçası.

source: https://en.wikipedia.org/wiki/Client_(computing)
tr: https://tr.wikipedia.org/wiki/İstemci

source: FAQ
tr: SSS

source: a list of frequently asked questions (FAQs) and answers on a particular topic.
tr: Belirli bir konu hakkında sık sorulan sorular (SSS) ve cevaplarının listesi.

source: https://en.wikipedia.org/wiki/FAQ
tr: https://tr.wikipedia.org/wiki/SSS_(bilgisayar)

source: Host
tr: Ana bilgisayar

source: a computer or other device connected to a computer network. A network host may offer information resources, services, and applications to users or other nodes on the network. A network host is a network node that is assigned a network address.
tr: bir bilgisayar ağına bağlı bir bilgisayar veya başka bir cihaz. Bir ağ ana bilgisayarı, ağdaki kullanıcılara veya diğer düğümlere bilgi kaynakları, hizmetler ve uygulamalar sunabilir. Bir ağ ana bilgisayarı, bir ağ adresi atanmış bir ağ düğümüdür.

source: https://en.wikipedia.org/wiki/Host_(network)
tr: https://tr.wikipedia.org/wiki/Host_(ağ)

source: Hostname
tr: Ana bilgisayar adı

source: a label that is assigned to a device connected to a computer network and that is used to identify the device in various forms of electronic communication, such as the World Wide Web.
tr: Bir bilgisayar ağına bağlı bir cihaza atanan ve Dünya Çapında Ağ gibi çeşitli elektronik iletişim biçimlerinde cihazı tanımlamak için kullanılan bir etiket.

source: https://en.wikipedia.org/wiki/Hostname
tr: https://tr.wikipedia.org/wiki/Sunucu_adı

source: the principal communications protocol in the Internet protocol suite for relaying datagrams across network boundaries. Its routing function enables internetworking, and essentially establishes the Internet.
tr: İnternet protokol paketindeki, veri paketlerini ağ sınırları boyunca iletmek için kullanılan başlıca iletişim protokolü. Yönlendirme işlevi, internetwork'ü etkinleştirir ve esasen İnternet'i kurar.

source: https://en.wikipedia.org/wiki/Internet_Protocol
tr: https://tr.wikipedia.org/wiki/Internet_Protocol

source: IP Address
tr: IP Adresi

source: a numerical label assigned to each device connected to a computer network that uses the Internet Protocol for communication.
tr: İnternet Protokolünü iletişim için kullanan bir bilgisayar ağına bağlı her cihaza atanan sayısal etiket.

source: https://en.wikipedia.org/wiki/IP_address
tr: https://tr.wikipedia.org/wiki/IP_adresi

source: the most recent version of the Internet Protocol (IP), the communications protocol that provides an identification and location system for computers on networks and routes traffic across the Internet.
tr: İnternet Protokolü'nün (IP) en son sürümü, ağlardaki bilgisayarlar için bir tanımlama ve konumlandırma sistemi sağlayan ve İnternet üzerinden trafiği yönlendiren iletişim protokolüdür.

source: https://en.wikipedia.org/wiki/IPv6
tr: https://tr.wikipedia.org/wiki/IPv6

source: an endpoint of communication. Physical as well as wireless connections are terminated at ports of hardware devices. At the software level, within an operating system, a port is a logical construct that identifies a specific process or a type of network service.
tr: iletişimin uç noktası. Fiziksel ve kablosuz bağlantılar donanım aygıtlarının portlarında sonlandırılır. Yazılım düzeyinde, bir işletim sistemi içinde, port belirli bir işlemi veya bir ağ hizmeti türünü tanımlayan mantıksal bir yapıdır.

source: https://en.wikipedia.org/wiki/Port_(computer_networking)
tr: https://tr.wikipedia.org/wiki/Bağlantı_noktası_(bilgisayar_ağı)

source: one of the main protocols of the Internet protocol suite. It originated in the initial network implementation in which it complemented the Internet Protocol (IP). Therefore, the entire suite is commonly referred to as TCP/IP.
tr: İnternet protokol paketinin ana protokollerinden biri. İnternet Protokolü'nü (IP) tamamladığı ilk ağ uygulamasında ortaya çıkmıştır. Bu nedenle, tüm pakete genellikle TCP/IP denir.

source: https://en.wikipedia.org/wiki/Transmission_Control_Protocol
tr: https://tr.wikipedia.org/wiki/TCP

source: a reference to a web resource that specifies its location on a computer network and a mechanism for retrieving it.
tr: Bir bilgisayar ağındaki konumunu ve onu almaya yönelik bir mekanizmayı belirten bir internet kaynağına yapılan başvuru.

source: https://en.wikipedia.org/wiki/URL
tr: https://tr.wikipedia.org/wiki/URL

source: Veyon Administrator Manual
tr: Veyon Yönetici Kılavuzu

source: Installation
tr: Kurulum

source: Hardware and software requirements
tr: Donanım ve yazılım gereksinimleri

source: Veyon is designed to run on standard computers running Windows or Linux. The minimum requirements for the hardware depend on the usage scenario and size of the environment in which Veyon is deployed. While there are no special requirements for client computers all master computers should be equipped with enough RAM and CPU cores to monitor the desired number of client computers.
tr: Veyon, Windows veya Linux çalıştıran standart bilgisayarlarda çalışmak üzere tasarlanmıştır. Donanım için minimum gereksinimler, Veyon'un dağıtıldığı ortamın kullanım senaryosuna ve boyutuna bağlıdır. İstemci bilgisayarlar için özel gereksinimler olmasa da tüm ana bilgisayarlar, istenen sayıda istemci bilgisayarı izlemek için yeterli RAM ve CPU çekirdeğiyle donatılmalıdır.

source: At least 2 GB RAM - Veyon Master requires 20-30 MB per client computer, depending on the client's screen resolution
tr: En az 2 GB RAM - Veyon Master, istemcinin ekran çözünürlüğüne bağlı olarak istemci bilgisayar başına 20-30 MB gerektirir

source: Multi-core system (2-4 CPU cores) highly recommended
tr: Çok çekirdekli sistem (2-4 CPU çekirdeği) şiddetle tavsiye edilir

source: All computers must be connected through a TCP-/IP-compatible network. Both wired and wireless network connections work. For using Veyon with more than 10 computers a Gigabit network is recommended, otherwise the performance of the demo mode feature (see user manual) may not be satisfactory. The same applies to wireless networks (*Wifi*) where at least the IEEE 802.11n standard should be used.
tr: Tüm bilgisayarlar TCP/IP uyumlu bir ağ üzerinden bağlanmalıdır. Hem kablolu hem de kablosuz ağ bağlantıları çalışır. Veyon'u 10'dan fazla bilgisayarla kullanmak için bir Gigabit ağı önerilir, aksi takdirde demo modu özelliğinin performansı (kullanıcı kılavuzuna bakın) tatmin edici olmayabilir. Aynısı en azından IEEE 802.11n standardının kullanılması gereken kablosuz ağlar (*Wifi*) için de geçerlidir.

source: From a software point of view, an up-to-date operating system supported by the manufacturer or the community must be used. The following operating systems are supported:
tr: Yazılım açısından, üretici veya topluluk tarafından desteklenen güncel bir işletim sistemi kullanılmalıdır. Aşağıdaki işletim sistemleri desteklenmektedir:

source: Windows 10 or 11 (32/64 Bit)
tr: Windows 10 veya 11 (32/64 Bit)

source: Linux with at least version 5.7 of Qt
tr: Qt'nin en az 5.7 sürümüne sahip Linux

source: Debian 10 or newer
tr: Debian 10 veya daha yeni

source: Ubuntu 20.04 or newer
tr: Ubuntu 20.04 veya daha yeni

source: openSUSE 15.4 or newer
tr: openSUSE 15.4 veya daha yeni

source: Fedora 38 or newer
tr: Fedora 38 veya daha yeni

source: CentOS 7.9 or newer
tr: CentOS 7.9 veya daha yeni

source: The mixed operation of Veyon on Windows and Linux computers works without any restrictions.
tr: Veyon'un Windows ve Linux bilgisayarlarda karma çalışması herhangi bir kısıtlama olmaksızın çalışmaktadır.

source: Preparing the installation
tr: Kurulumun hazırlanması

source: First of all download the installation files for your platform from the `Veyon download page <https://veyon.io/download/>`_. For Windows computers it is recommended to use the 64-bit version (`win64`). For 32-bit installations the 32-bit version (`win32`) has to be used.
tr: Öncelikle platformunuz için kurulum dosyalarını `Veyon indirme sayfasından <https://veyon.io/download/>`_ indirin. Windows bilgisayarlar için 64-bit sürümü (`win64`) kullanılması önerilir. 32-bit kurulumlar için 32-bit sürümü (`win32`) kullanılmalıdır.

source: Installation on a Windows computer
tr: Windows bilgisayara kurulum

source: Run the installer file with administrative privileges and follow the displayed instructions. On computers that do not require the Veyon Master application (e.g. student computers) you can deselect the component *Veyon Master* in the *Choose Components* dialog.
tr: Yükleyici dosyasını yönetici ayrıcalıklarıyla çalıştırın ve görüntülenen talimatları izleyin. Veyon Master uygulamasını gerektirmeyen bilgisayarlarda (örneğin öğrenci bilgisayarları) *Bileşenleri Seç* iletişim kutusunda *Veyon Master* bileşenini seçimini kaldırabilirsiniz.

source: After the installation is finished the *Veyon Configurator* is started by default. This program allows setting up and customize your Veyon installation. In the next chapter :ref:`Configuration` the usage is described in detail.
tr: Kurulum tamamlandıktan sonra *Veyon Configurator* varsayılan olarak başlatılır. Bu program Veyon kurulumunuzu kurmanıza ve özelleştirmenize olanak tanır. Bir sonraki bölümde :ref:`Configuration` kullanımı ayrıntılı olarak açıklanmıştır.

source: Installation on a Linux computer
tr: Linux bilgisayara kurulum

source: The installation of Veyon on Linux differs depending on the distribution used. If Veyon is available in the package archive of your distribution you can install the program through the appropriate software management application. Alternatively up-to-date binary packages for most major distributions are available at the `Veyon download page <https://veyon.io/download/>`_. In all other cases it's always possible to build and install a current version of Veyon from source. For further information please visit the `Github page of Veyon <https://github.com/veyon/veyon/>`_.
tr: Veyon'un Linux'a kurulumu kullanılan dağıtıma göre farklılık gösterir. Veyon dağıtımınızın paket arşivinde mevcutsa programı uygun yazılım yönetim uygulaması aracılığıyla kurabilirsiniz. Alternatif olarak, çoğu büyük dağıtım için güncel ikili paketler `Veyon indirme sayfası <https://veyon.io/download/>`_ adresinde mevcuttur. Diğer tüm durumlarda, Veyon'un güncel bir sürümünü kaynaktan derlemek ve kurmak her zaman mümkündür. Daha fazla bilgi için lütfen `Veyon'un Github sayfasını <https://github.com/veyon/veyon/>`_ ziyaret edin.

source: Automated/silent installation
tr: Otomatik/sessiz kurulum

source: Basics
tr: Temeller

source: The Veyon Windows installer provided by the community can be executed in *silent* mode, meaning that there is no user interaction and the installation is performed automatically. This is especially useful for automated deployments in larger environments. This way Veyon can be easily integrated with all common software distribution solutions and mechanisms.
tr: Topluluk tarafından sağlanan Veyon Windows yükleyicisi *sessiz* modda çalıştırılabilir, yani kullanıcı etkileşimi yoktur ve yükleme otomatik olarak gerçekleştirilir. Bu, özellikle daha büyük ortamlardaki otomatik dağıtımlar için faydalıdır. Bu şekilde Veyon, tüm yaygın yazılım dağıtım çözümleri ve mekanizmalarıyla kolayca entegre edilebilir.

source: By running the installer with the command line parameter ``/S``, all operations are performed without further questions and dialogs. The same applies to the uninstaller.
tr: Yükleyiciyi ``/S`` komut satırı parametresiyle çalıştırarak, tüm işlemler daha fazla soru ve diyalog olmadan gerçekleştirilir. Aynısı kaldırıcı için de geçerlidir.

source: Examples
tr: Örnekler

source: Install Veyon in *silent* mode:
tr: Veyon'u *sessiz* modda kurun:

source: Uninstall Veyon in *silent* mode:
tr: Veyon'u *sessiz* modda kaldırın:

source: Specify an installation directory for an automated installation:
tr: Otomatik kurulum için bir kurulum dizini belirtin:

source: Because of a shortcoming of the installer software (NSIS) the option ``/D=...`` always has to be the last argument.
tr: Kurulum yazılımının (NSIS) bir eksikliğinden dolayı ``/D=...`` seçeneği her zaman son argüman olmak zorundadır.

source: Import and apply a given Veyon configuration automatically after the installation:
tr: Kurulumdan sonra belirli bir Veyon yapılandırmasını otomatik olarak içe aktarın ve uygulayın:

source: You must specify an absolute path for the configuration file, since the internally called command line tool (*Veyon CLI*) is executed with in a different working directory. Please use either the suggested ``%cd%``-variable or replace with an absolute path.
tr: Yapılandırma dosyası için mutlak bir yol belirtmelisiniz, çünkü dahili olarak çağrılan komut satırı aracı (*Veyon CLI*) farklı bir çalışma dizininde yürütülür. Lütfen önerilen ``%cd%``-değişkenini kullanın veya mutlak bir yolla değiştirin.

source: Automated installation without the Veyon Master component:
tr: Veyon Master bileşeni olmadan otomatik kurulum:

source: Automated installation without creating a start menu folder:
tr: Başlat menüsü klasörü oluşturmadan otomatik kurulum:

source: Automated installation without the Interception driver:
tr: Interception sürücüsü olmadan otomatik kurulum:

source: Delete all Veyon-related settings during uninstallation:
tr: Kaldırma sırasında Veyon ile ilgili tüm ayarları silin:

source: Minimum requirements
tr: Minimum gereksinimler

source: Operating system
tr: İşletim sistemi

source: Automated installation
tr: Otomatik kurulum

source: Unattended installation
tr: Katılımsız kurulum

source: Silent installation
tr: Sessiz kurulum

source: Uninstallation
tr: Kaldırma

source: Uninstalling
tr: Kaldırma

source: Installation directory
tr: Kurulum dizini

source: About this manual
tr: Bu kılavuz hakkında

source: This manual describes the installation and configuration of Veyon in a computer network and is addressed to system administrators and technically experienced users. For end users there is a separate user manual which describes the usage and individual functions of the user program (Veyon Master).
tr: Bu kılavuz, Veyon'un bir bilgisayar ağında kurulumunu ve yapılandırmasını açıklar ve sistem yöneticilerine ve teknik olarak deneyimli kullanıcılara yöneliktir. Son kullanıcılar için, kullanıcı programının (Veyon Master) kullanımını ve bireysel işlevlerini açıklayan ayrı bir kullanıcı kılavuzu vardır.

source: In the following sections of this chapter you will find basic information about Veyon and its components which are of fundamental importance for putting Veyon into operation.
tr: Bu bölümün aşağıdaki bölümlerinde Veyon'un faaliyete geçirilmesi için temel öneme sahip olan Veyon ve bileşenleri hakkında temel bilgiler bulacaksınız.

source: Chapter :ref:`Installation` covers the installation of Veyon on a Windows or Linux computer. It also contains information on how to perform or implement an automated installation.
tr: Bölüm :ref:`Kurulum`, Veyon'un bir Windows veya Linux bilgisayara kurulumunu kapsar. Ayrıca otomatik bir kurulumun nasıl gerçekleştirileceği veya uygulanacağı hakkında bilgi içerir.

source: Chapter :ref:`Configuration` explains how to configure and integrate Veyon using the graphical configuration tool, whereas the :ref:`ConfigurationReference` describes all available configuration settings and options in detail. Information and examples on how to connect Veyon to an LDAP or ActiveDirectory server can be found in chapter :ref:`LDAP`.
tr: Bölüm :ref:`Yapılandırma`, Veyon'un grafiksel yapılandırma aracı kullanılarak nasıl yapılandırılacağını ve entegre edileceğini açıklar, oysa :ref:`YapılandırmaReferansı` tüm mevcut yapılandırma ayarlarını ve seçeneklerini ayrıntılı olarak açıklar. Veyon'un bir LDAP veya ActiveDirectory sunucusuna nasıl bağlanacağına dair bilgi ve örnekler :ref:`LDAP` bölümünde bulunabilir.

source: Veyon also has a command line interface (CLI) which can be used to modify the configuration, automate Veyon-related tasks and to use or control certain program features. All modules and commands of the command line tool are listed and explained in chapter :ref:`CommandLineInterface`.
tr: Veyon ayrıca yapılandırmayı değiştirmek, Veyon ile ilgili görevleri otomatikleştirmek ve belirli program özelliklerini kullanmak veya kontrol etmek için kullanılabilen bir komut satırı arayüzüne (CLI) sahiptir. Komut satırı aracının tüm modülleri ve komutları :ref:`CommandLineInterface` bölümünde listelenmiş ve açıklanmıştır.

source: In case Veyon causes problem during its installation or configuration actions can be taken as described in chapter :ref:`Troubleshooting`. Frequently asked questions are answered in chapter :ref:`FAQ`.
tr: Veyon kurulum veya yapılandırma sırasında sorun çıkarırsa, :ref:`Sorun Giderme` bölümünde açıklandığı gibi eylemler yapılabilir. Sık sorulan sorular :ref:`SSS` bölümünde yanıtlanmıştır.

source: Before upgrading to a new release series of Veyon it's recommended to carefully read the :ref:`ReleaseNotes` for the respective version.
tr: Veyon'un yeni bir sürümüne yükseltme yapmadan önce, ilgili sürümün :ref:`ReleaseNotes` bölümünü dikkatlice okumanız önerilir.

source: About Veyon
tr: Veyon Hakkında

source: Veyon is a free and open source software for monitoring and controlling computers across multiple platforms. Veyon supports you in teaching in digital learning environments, performing virtual trainings or giving remote support. The following features are available in Veyon:
tr: Veyon, birden fazla platformda bilgisayarları izlemek ve kontrol etmek için ücretsiz ve açık kaynaklı bir yazılımdır. Veyon, dijital öğrenme ortamlarında eğitim vermenizde, sanal eğitimler vermenizde veya uzaktan destek vermenizde size destek olur. Veyon'da aşağıdaki özellikler mevcuttur:

source: Monitoring: overview of a (class) room with screen contents of computers being shown in thumbnails
tr: İzleme: Bilgisayarların ekran içeriklerinin küçük resimler halinde gösterildiği bir (sınıf) odasının genel görünümü

source: Remote view or control computers
tr: Uzaktan görüntüleme veya bilgisayarları kontrol etme

source: Broadcast the teacher's screen to all other computers in real time (full screen/window demo)
tr: Öğretmenin ekranını gerçek zamanlı olarak diğer tüm bilgisayarlara yayınlayın (tam ekran/pencere demosu)

source: Lock computers to control attention
tr: Dikkatinizi kontrol etmek için bilgisayarları kilitleyin

source: Distribute documents and other files to students
tr: Öğrencilere belgeleri ve diğer dosyaları dağıtın

source: Send text messages to students
tr: Öğrencilere kısa mesaj gönderin

source: Power on, reboot or shutdown computers remotely
tr: Bilgisayarları uzaktan açın, yeniden başlatın veya kapatın

source: Log out users
tr: Kullanıcıların oturumunu kapat

source: Launch programs and open websites
tr: Programları başlatın ve web sitelerini açın

source: Components
tr: Bileşenler

source: Veyon basically consists of a master and a service component which realize the interaction between teacher and student computers (also referred to as *master computer* and *client computer*):
tr: Veyon temel olarak öğretmen ve öğrenci bilgisayarları (ayrıca *ana bilgisayar* ve *istemci bilgisayar* olarak da adlandırılır) arasındaki etkileşimi gerçekleştiren bir ana ve bir servis bileşeninden oluşur:

source: In detail there are several software components that interact with each other in different ways:
tr: Ayrıntılı olarak, birbirleriyle farklı şekillerde etkileşime giren birkaç yazılım bileşeni vardır:

source: An application program that can be used to monitor and control other computers and utilize further Veyon features. In normal use, the program is started by the end user and accesses other computers via the Veyon Service.
tr: Diğer bilgisayarları izlemek ve kontrol etmek ve daha fazla Veyon özelliğinden yararlanmak için kullanılabilen bir uygulama programı. Normal kullanımda, program son kullanıcı tarafından başlatılır ve Veyon Hizmeti aracılığıyla diğer bilgisayarlara erişir.

source: Veyon Service
tr: Veyon Servisi
