Repository: veyon/docs
Catalog: locale/*/LC_MESSAGES/admin.po
Languages: tr

source: Starting with Veyon 4.8 the quality of the image data transferred between client and master computers in monitoring mode can be configured such that it meets the possible network bandwidth constraints. While *Highest* uses lossless image encodings (default before Veyon 4.8), *Lowest* uses JPEG encoding which results in significantly reduced bandwidth usage but also clearly visible image artifacts.
tr: Veyon 4.8'den başlayarak, izleme modunda istemci ve ana bilgisayarlar arasında aktarılan görüntü verilerinin kalitesi, olası ağ bant genişliği kısıtlamalarını karşılayacak şekilde yapılandırılabilir. *En Yüksek* kayıpsız görüntü kodlamalarını kullanırken (Veyon 4.8'den önce varsayılan), *En Düşük* JPEG kodlamasını kullanır ve bu da bant genişliği kullanımının önemli ölçüde azalmasına ancak aynı zamanda açıkça görülebilen görüntü eserlerine neden olur.

source: **Default:** *Medium*
tr: **Varsayılan:** *Orta*

source: Remote access image quality
tr: Uzaktan erişim görüntü kalitesi

source: Like the image quality in monitoring mode, the image quality in remote access windows can be adjusted to limit bandwidth usage if necessary.
tr: İzleme modundaki görüntü kalitesi gibi, uzaktan erişim pencerelerindeki görüntü kalitesi de gerektiğinde bant genişliği kullanımını sınırlamak için ayarlanabilir.

source: **Default:** *Highest*
tr: **Varsayılan:** *En Yüksek*

source: Thumbnail update interval
tr: Küçük resim güncelleme aralığı

source: This setting determines the time interval in which the computer thumbnails in Veyon Master are updated. The shorter the interval, the higher the processor load on the master machine and the overall network load.
tr: Bu ayar, Veyon Master'daki bilgisayar küçük resimlerinin güncelleneceği zaman aralığını belirler. Aralık ne kadar kısa olursa, ana makinedeki işlemci yükü ve genel ağ yükü o kadar yüksek olur.

source: Thumbnail aspect ratio
tr: Küçük resim en boy oranı

source: Background color
tr: Arka plan rengi

source: This setting allows customizing the background color of the monitor view.
tr: Bu ayar, monitör görünümünün arka plan renginin özelleştirilmesine olanak tanır.

source: **Default:** *white*
tr: **Varsayılan:** *beyaz*

source: Text color
tr: Metin rengi

source: This setting allows customizing the color which is used for displaying the computer thumbnail caption in the monitor view.
tr: Bu ayar, bilgisayar küçük resminin monitör görünümünde görüntülenmesinde kullanılan rengin özelleştirilmesine olanak tanır.

source: **Default:** *black*
tr: **Varsayılan:** *siyah*

source: Computer thumbnail caption
tr: Bilgisayar küçük resminin açıklaması

source: This setting allows defining the caption for computer thumbnails in the monitor view. If the computer name is not important to users only the name of the logged on user can be displayed instead.
tr: Bu ayar, monitör görünümünde bilgisayar küçük resimleri için başlığın tanımlanmasına olanak tanır. Bilgisayar adı kullanıcılar için önemli değilse, bunun yerine yalnızca oturum açmış kullanıcının adı görüntülenebilir.

source: **Default:** *User and computer name*
tr: **Varsayılan:** *Kullanıcı ve bilgisayar adı*

source: Sort order
tr: Sıralama düzeni

source: This setting allows specifying the sort order for computers in the monitor view. If the caption is configured to display only user names it may make sense to change the sort order to *Only user name* as well.
tr: Bu ayar, monitör görünümündeki bilgisayarlar için sıralama düzenini belirtmeye olanak tanır. Başlık yalnızca kullanıcı adlarını görüntüleyecek şekilde yapılandırılmışsa, sıralama düzenini *Yalnızca kullanıcı adı* olarak değiştirmek de mantıklı olabilir.

source: **Default:** *Computer and user name*
tr: **Varsayılan:** *Bilgisayar ve kullanıcı adı*

source: Thumbnail spacing
tr: Küçük resim aralığı

source: Computer name source
tr: Bilgisayar adı kaynağı

source: Computer UID role
tr: Bilgisayar UID rolü

source: Behaviour
tr: Davranış

source: In the tab :guilabel:`Behaviour` settings are available to change the behaviour of Veyon Master regarding to *program start*, *computer locations* as well as *modes and features*.
tr: :guilabel:`Davranış` sekmesinde Veyon Master'ın *program başlangıcı*, *bilgisayar konumları* ve *modlar ve özellikler* ile ilgili davranışlarını değiştirmek için ayarlar mevcuttur.

source: **Program start**
tr: **Program Başlat**

source: Perform access control
tr: Erişim denetimi gerçekleştirin

source: You can use this option to define whether the possibly configured :ref:`ComputerAccessControl` should also be performed whenever the Veyon Master application is started. Even though access control is enforced client-side in every case, this additional option assures, that users without proper access rights can not even start Veyon Master, making security even more visible.
tr: Bu seçeneği, Veyon Master uygulaması başlatıldığında muhtemelen yapılandırılmış olan :ref:`ComputerAccessControl`'ün de gerçekleştirilip gerçekleştirilmeyeceğini tanımlamak için kullanabilirsiniz. Erişim denetimi her durumda istemci tarafında zorlansa da, bu ek seçenek, uygun erişim haklarına sahip olmayan kullanıcıların Veyon Master'ı bile başlatamamasını sağlayarak güvenliği daha da görünür hale getirir.

source: Automatically select current location
tr: Mevcut konumu otomatik olarak seç

source: By default all computers that have been selected the previous time are displayed after starting Veyon Master. If you want to display all computers at the master computer's location instead, this option can be enabled. Veyon Master will then try to determine the location of the local computer by using the configured :ref:`network object directory <RefNetworkObjectDirectory>`. All computers at the same location will then be selected and displayed. For this function to work properly, a correctly functioning DNS setup in the network is required so that both computer names can be resolved to IP addresses and reverse lookups for IP addresses return valid computer names.
tr: Varsayılan olarak, Veyon Master başlatıldıktan sonra önceki zamanda seçilen tüm bilgisayarlar görüntülenir. Bunun yerine ana bilgisayarın konumundaki tüm bilgisayarları görüntülemek istiyorsanız, bu seçenek etkinleştirilebilir. Veyon Master daha sonra yapılandırılmış :ref:`network object directory <RefNetworkObjectDirectory>`'i kullanarak yerel bilgisayarın konumunu belirlemeye çalışır. Aynı konumdaki tüm bilgisayarlar daha sonra seçilir ve görüntülenir. Bu işlevin düzgün çalışması için, her iki bilgisayar adının da IP adreslerine çözümlenebilmesi ve IP adresleri için ters aramaların geçerli bilgisayar adlarını döndürebilmesi için ağda düzgün çalışan bir DNS kurulumu gerekir.

source: Automatically adjust computer thumbnail size
tr: Bilgisayarın küçük resim boyutunu otomatik olarak ayarla

source: If the size of the computer thumbnails should be adjusted automatically upon starting Veyon Master (same effect as clicking the :guilabel:`Auto` button manually), this option can be enabled. The previously configured size will be ignored. This functionality is especially useful in conjunction with the :ref:`automatic location change <RefAutoSelectLocation>`.
tr: Bilgisayar küçük resimlerinin boyutu Veyon Master başlatıldığında otomatik olarak ayarlanacaksa (el ile :guilabel:`Auto` düğmesine tıklamakla aynı etki), bu seçenek etkinleştirilebilir. Önceden yapılandırılmış boyut göz ardı edilecektir. Bu işlevsellik özellikle :ref:`automatic location change<RefAutoSelectLocation>` ile birlikte kullanıldığında faydalıdır.

source: Automatically open computer select panel
tr: Bilgisayar seçme panelini otomatik olarak aç

source: You can use this option to define that the computer select panel is opened upon program start by default.
tr: Bu seçeneği kullanarak, program başlatıldığında bilgisayar seçim panelinin varsayılan olarak açılmasını sağlayabilirsiniz.

source: **Computer locations**
tr: **Bilgisayar konumları**

source: Show current location only
tr: Yalnızca geçerli konumu göster

source: Per default, the computer select panel lists all locations provided by the configured :ref:`network object directory <RefNetworkObjectDirectory>`. If this option is enabled only the location of the master computer will be displayed instead. This can make the user interface more clear especially in larger environments with many locations.
tr: Varsayılan olarak, bilgisayar seçim paneli yapılandırılmış :ref:`network object directory <RefNetworkObjectDirectory>` tarafından sağlanan tüm konumları listeler. Bu seçenek etkinleştirilirse bunun yerine yalnızca ana bilgisayarın konumu görüntülenir. Bu, özellikle birçok konumun bulunduğu daha büyük ortamlarda kullanıcı arayüzünü daha net hale getirebilir.

source: Allow adding hidden locations manually
tr: Gizli konumların manuel olarak eklenmesine izin ver

source: When the option :ref:`Show current location only <RefShowCurrentLocationOnly>` is enabled the user can still be allowed to add otherwise hidden locations manually. If this option is enabled an additional button :guilabel:`Add location` is shown in the computer select panel. This button opens a dialog with all available locations.
tr: :ref:`Show current location only <RefShowCurrentLocationOnly>` seçeneği etkinleştirildiğinde, kullanıcıya aksi takdirde gizli olan konumları manuel olarak ekleme izni verilebilir. Bu seçenek etkinleştirilirse, bilgisayar seçim panelinde ek bir düğme :guilabel:`Konum ekle` gösterilir. Bu düğme, tüm kullanılabilir konumların bulunduğu bir iletişim kutusu açar.

source: Hide local computer
tr: Yerel bilgisayarı gizle

source: In regular usage scenarios it often is not desired to display the own computer as this would start globally started features on the own computer as well (e.g. screen lock). Enabling this option will always hide the local computer to prevent such issues.
tr: Düzenli kullanım senaryolarında, genellikle kendi bilgisayarını görüntülemek istenmez çünkü bu, kendi bilgisayarında global olarak başlatılan özellikleri de başlatır (örn. ekran kilidi). Bu seçeneği etkinleştirmek, bu tür sorunları önlemek için her zaman yerel bilgisayarı gizler.

source: Hide own session
tr: Kendi oturumunu gizle

source: Similar to the :ref:`Hide local computer <RefAutoHideLocalComputer>` option, enabling this option hides the own session from the computer list. This is only relevant when using the :ref:`Multi session mode <RefMultiSessionMode>`.
tr: :ref:`Yerel bilgisayarı gizle <RefAutoHideLocalComputer>` seçeneğine benzer şekilde, bu seçeneği etkinleştirmek kendi oturumunu bilgisayar listesinden gizler. Bu yalnızca :ref:`Çoklu oturum modu <RefMultiSessionMode>` kullanıldığında geçerlidir.

source: Hide empty locations
tr: Boş konumları gizle

source: In some situations the :ref:`network object directory <RefNetworkObjectDirectory>` may contain locations without computers, for example due to specific LDAP filters. Such empty locations can be hidden automatically in the computer select panel by enabling this option.
tr: Bazı durumlarda :ref:`network object directory <RefNetworkObjectDirectory>` bilgisayarsız konumlar içerebilir, örneğin belirli LDAP filtreleri nedeniyle. Bu tür boş konumlar, bu seçeneği etkinleştirerek bilgisayar seçim panelinde otomatik olarak gizlenebilir.

source: Hide computer filter field
tr: Bilgisayar filtre alanını gizle

source: The filter field for searching computers can be hidden through this option. This allows keeping the user interface as simple as possible in small environments.
tr: Bu seçenekle bilgisayar arama filtre alanı gizlenebilir. Bu, küçük ortamlarda kullanıcı arayüzünün mümkün olduğunca basit tutulmasını sağlar.

source: Always expand all locations
tr: Her zaman tüm konumları genişlet

source: This option specifies whether all locations in the :guilabel:`Locations & computers` panel should be expanded automatically when starting Veyon Master or adding locations manually. It only makes sense to activate this option if you only have a few locations or have activated the :guilabel:`Show current location only` option.
tr: Bu seçenek, Veyon Master başlatılırken :guilabel:`Konumlar ve bilgisayarlar` panelindeki tüm konumların otomatik olarak genişletilip genişletilmeyeceğini veya konumların manuel olarak eklenip eklenmeyeceğini belirtir. Bu seçeneği yalnızca birkaç konumunuz varsa veya :guilabel:`Yalnızca geçerli konumu göster` seçeneğini etkinleştirdiyseniz etkinleştirmek mantıklıdır.

source: **Modes and features**
tr: **Modlar ve özellikler**

source: Enforce selected mode for client computers
tr: Seçilen modu istemci bilgisayarlar için uygula

source: Some of Veyon's features change the operating mode of a computer e.g. the demo mode or the screen lock mode. These modes are enabled only once and are not restored in case of a physical computer reboot. If this option is enabled, the mode will even be enforced after a connection has been closed.
tr: Veyon'un bazı özellikleri bir bilgisayarın çalışma modunu değiştirir, örneğin demo modu veya ekran kilidi modu. Bu modlar yalnızca bir kez etkinleştirilir ve fiziksel bir bilgisayar yeniden başlatıldığında geri yüklenmez. Bu seçenek etkinleştirilirse, mod bir bağlantı kapatıldıktan sonra bile uygulanır.

source: Show confirmation dialog for potentially unsafe actions
tr: Potansiyel olarak güvenli olmayan eylemler için onay iletişim kutusunu göster

source: Actions such as rebooting a computer or logging off users can have undesired side effects such as data loss due to unsaved documents. In order to prevent unintentional activation of such features a confirmation dialog can be enabled through this option.
tr: Bilgisayarı yeniden başlatma veya kullanıcıların oturumunu kapatma gibi eylemler, kaydedilmemiş belgeler nedeniyle veri kaybı gibi istenmeyen yan etkilere sahip olabilir. Bu tür özelliklerin yanlışlıkla etkinleştirilmesini önlemek için bu seçenek aracılığıyla bir onay iletişim kutusu etkinleştirilebilir.

source: Feature on double click
tr: Çift tıklamada özellik

source: This setting allows defining a feature to be triggered whenever a computer is double-clicked. In most cases it's desired to use the *remote control* or *remote view* feature here.
tr: Bu ayar, bir bilgisayara çift tıklandığında tetiklenecek bir özelliğin tanımlanmasına olanak tanır. Çoğu durumda burada *uzaktan kumanda* veya *uzaktan görüntüleme* özelliğinin kullanılması istenir.

source: **Default:** *no function*
tr: **Varsayılan:** *işlev yok*

source: Features
tr: Özellikler

source: The two lists in the :guilabel:`Features` allow to define which features are made available in Veyon Master. Single features can be disabled if necessary so that respective buttons and context menu entries are not displayed. This can help to simplify the user interface if certain features are never used anyway.
tr: :guilabel:`Özellikler`deki iki liste, Veyon Master'da hangi özelliklerin kullanılabilir hale getirileceğini tanımlamaya izin verir. Gerekirse tek tek özellikler devre dışı bırakılabilir, böylece ilgili düğmeler ve bağlam menüsü girişleri görüntülenmez. Bu, belirli özellikler hiçbir zaman kullanılmazsa kullanıcı arayüzünü basitleştirmeye yardımcı olabilir.

source: A feature can be moved from one list to the other by selecting it and clicking the respective button with the arrow icon. Alternatively a feature can simply be double-clicked to move it to the other list.
tr: Bir özellik, seçilip ok simgesi olan ilgili düğmeye tıklanarak bir listeden diğerine taşınabilir. Alternatif olarak, bir özellik diğer listeye taşınmak için basitçe çift tıklanabilir.

source: Grant access to every authenticated user (default)
tr: Kimliği doğrulanmış her kullanıcıya erişim izni ver (varsayılan)

source: If the selected authentication scheme is sufficient (e.g. when using a key file authentication with restricted access to the key files), this option can be enabled. In this mode no further access control is performed.
tr: Seçilen kimlik doğrulama şeması yeterliyse (örneğin, anahtar dosyalarına kısıtlı erişime sahip bir anahtar dosyası kimlik doğrulaması kullanıldığında), bu seçenek etkinleştirilebilir. Bu modda başka bir erişim denetimi yapılmaz.

source: Restrict access to members of specific user groups
tr: Belirli kullanıcı gruplarının üyelerine erişimi kısıtlayın

source: In this mode access to a computer is restricted to members of specific user groups. These authorized user groups can be configured in section :ref:`RefAuthorizedUserGroups`.
tr: Bu modda bir bilgisayara erişim belirli kullanıcı gruplarının üyeleriyle sınırlıdır. Bu yetkili kullanıcı grupları :ref:`RefAuthorizedUserGroups` bölümünde yapılandırılabilir.

source: Process access control rules
tr: İşlem erişim kontrol kuralları

source: This mode allows detailed access control based on user-defined access control rules and offers the greatest flexibility. However, its initial setup may be slightly more complicated and time-consuming, so you should choose one of the other two access control modes for initial testing.
tr: Bu mod, kullanıcı tanımlı erişim kontrol kurallarına dayalı ayrıntılı erişim kontrolüne izin verir ve en büyük esnekliği sunar. Ancak, ilk kurulumu biraz daha karmaşık ve zaman alıcı olabilir, bu nedenle ilk test için diğer iki erişim kontrol modundan birini seçmelisiniz.

source: User groups authorized for computer access
tr: Bilgisayar erişimi için yetkilendirilmiş kullanıcı grupları

source: Configuration of this access control mode is straightforward. The left list contains all user groups provided by the selected backend. By default these are all local user groups. If :ref:`LDAP/AD Integration <LDAP>` is configured, all LDAP user groups are displayed. You can now select one or more groups and move them to the right list using the corresponding buttons between the two lists. All members of each group in the right list can access the computer. Do not forget to transfer the configuration to all computers afterwards.
tr: Bu erişim kontrol modunun yapılandırması basittir. Sol liste, seçili arka uç tarafından sağlanan tüm kullanıcı gruplarını içerir. Varsayılan olarak bunların hepsi yerel kullanıcı gruplarıdır. :ref:`LDAP/AD Integration <LDAP>` yapılandırılırsa, tüm LDAP kullanıcı grupları görüntülenir. Şimdi bir veya daha fazla grup seçebilir ve iki liste arasındaki ilgili düğmeleri kullanarak bunları sağ listeye taşıyabilirsiniz. Sağ listedeki her grubun tüm üyeleri bilgisayara erişebilir. Daha sonra yapılandırmayı tüm bilgisayarlara aktarmayı unutmayın.

source: The :guilabel:`Test` button in the :guilabel:`Computer access control` section can be used to check whether a particular user is allowed to access a computer via the defined groups.
tr: :guilabel:`Bilgisayar erişim denetimi` bölümündeki :guilabel:`Test` butonu, belirli bir kullanıcının tanımlanmış gruplar aracılığıyla bir bilgisayara erişmesine izin verilip verilmediğini kontrol etmek için kullanılabilir.

source: The setup of a ruleset for access control including use cases is described in detail in chapter :ref:`AccessControlRules`.
tr: Erişim denetimi için kullanım durumları da dahil olmak üzere kurallar kümesinin kurulumu :ref:`AccessControlRules` bölümünde ayrıntılı olarak açıklanmıştır.

source: Authentication keys
tr: Kimlik doğrulama anahtarları

source: Key file directories
tr: Anahtar dosyası dizinleri

source: Path variables should be used for both base directories. All information on supported variables can be found in section :ref:`RefPathVariables`. On Windows `UNC paths <https://en.wikipedia.org/wiki/Uniform_Naming_Convention>`_ can be used instead of absolute paths.
tr: Yol değişkenleri her iki temel dizin için de kullanılmalıdır. Desteklenen değişkenlerle ilgili tüm bilgiler :ref:`RefPathVariables` bölümünde bulunabilir. Windows'ta `UNC yolları <https://en.wikipedia.org/wiki/Uniform_Naming_Convention>`_ mutlak yollar yerine kullanılabilir.

source: Public key file base directory
tr: Genel anahtar dosyası temel dizini

source: The specified base directory contains subdirectories for each key name (e.g. user role) with the actual public key file inside. This allows setting individual access permissions for the subdirectories. The public key files are placed in the corresponding subdirectory below the base directory on both creation and import. When loading the respective public key file for authentication the Veyon Server uses this base directory as well.
tr: Belirtilen temel dizin, her anahtar adı için (ör. kullanıcı rolü) alt dizinler içerir ve bunların içinde gerçek genel anahtar dosyası bulunur. Bu, alt dizinler için ayrı erişim izinleri ayarlamayı sağlar. Genel anahtar dosyaları, hem oluşturma hem de içe aktarma sırasında temel dizinin altındaki ilgili alt dizine yerleştirilir. Kimlik doğrulama için ilgili genel anahtar dosyasını yüklerken Veyon Server bu temel dizini de kullanır.

source: **Default:** *%GLOBALAPPDATA%/keys/public*
tr: **Varsayılan:** *%GLOBALAPPDATA%/keys/public*

source: Private key file base directory
tr: Özel anahtar dizin yolu

source: The specified base directory contains subdirectories for each key name (e.g. user role) with the actual private key file inside. This makes it possible to define individual access rights for the subdirectories. During creation and import, the private key files are placed in the corresponding subdirectory below the base directory. Veyon Master searches for accessible private key files under this base directory and uses the private key files to authenticate against the Veyon Server on client computers.
tr: Belirtilen temel dizin, her anahtar adı için (örneğin kullanıcı rolü) alt dizinler içerir ve gerçek özel anahtar dosyası da içindedir. Bu, alt dizinler için ayrı erişim haklarının tanımlanmasını mümkün kılar. Oluşturma ve içe aktarma sırasında, özel anahtar dosyaları temel dizinin altındaki ilgili alt dizine yerleştirilir. Veyon Master, bu temel dizin altında erişilebilir özel anahtar dosyalarını arar ve özel anahtar dosyalarını istemci bilgisayarlarda Veyon Server'a karşı kimlik doğrulaması yapmak için kullanır.

source: **Default:** *%GLOBALAPPDATA%/keys/private*
tr: **Varsayılan:** *%GLOBALAPPDATA%/keys/private*

source: In the configuration page for the demo server, you can make some fine tunings to improve the performance of the demo mode. These settings should only be changed if the performance is not satisfactory or if only a small network bandwidth is available for data transfer.
tr: Demo sunucusunun yapılandırma sayfasında, demo modunun performansını iyileştirmek için bazı ince ayarlar yapabilirsiniz. Bu ayarlar yalnızca performans tatmin edici değilse veya veri aktarımı için yalnızca küçük bir ağ bant genişliği mevcutsa değiştirilmelidir.

source: This option can be used to set the interval between two screen updates. The smaller the interval, the higher the refresh rate and the smoother the screen transfer. However, a lower value leads to a higher CPU load and increased network traffic.
tr: Bu seçenek iki ekran güncellemesi arasındaki aralığı ayarlamak için kullanılabilir. Aralık ne kadar küçükse, yenileme hızı o kadar yüksek ve ekran aktarımı o kadar akıcı olur. Ancak, daha düşük bir değer daha yüksek CPU yüküne ve artan ağ trafiğine yol açar.

source: **Default:** *100 ms*
tr: **Varsayılan:** *100 ms*

source: Key frame interval
tr: Anahtar kare aralığı
