Repository: veyon/docs
Catalog: locale/*/LC_MESSAGES/admin.po
Languages: tr

source: With **logon authentication** Veyon Master encrypts the username and password of the accessing user (e.g. teacher) and sends this data to the Veyon Service on the remote computer. The Veyon Service then initiates an internal user login on the local system using the decrypted credentials. If successful, the username and password are correct and the authenticity of the counterpart is ensured. If the login fails, the connection is closed. **This method requires identical user accounts to exist on all computers.** Therefore, the use of this method only makes sense in conjunction with a central (user) directory service such as ActiveDirectory or LDAP.
tr: **Oturum açma kimlik doğrulaması** ile Veyon Master, erişen kullanıcının (ör. öğretmen) kullanıcı adını ve parolasını şifreler ve bu verileri uzak bilgisayardaki Veyon Hizmetine gönderir. Veyon Hizmeti daha sonra şifresi çözülmüş kimlik bilgilerini kullanarak yerel sistemde dahili bir kullanıcı oturum açma işlemi başlatır. Başarılı olursa, kullanıcı adı ve parola doğrudur ve karşı tarafın kimliği doğrulanır. Oturum açma başarısız olursa, bağlantı kapatılır. **Bu yöntem, tüm bilgisayarlarda aynı kullanıcı hesaplarının bulunmasını gerektirir.** Bu nedenle, bu yöntemin kullanımı yalnızca ActiveDirectory veya LDAP gibi merkezi (kullanıcı) dizin hizmetiyle birlikte kullanıldığında mantıklıdır.

source: Both methods have advantages and disadvantages so the choice of the right method depends on the environment, security requirements and desire for user comfort.
tr: Her iki yöntemin de kendine göre avantaj ve dezavantajları bulunmaktadır, bu sebeple doğru yöntemin seçimi ortama, güvenlik gereksinimlerine ve kullanıcı konforuna bağlıdır.

source: **Key file authentication**
tr: **Anahtar dosyası kimlik doğrulaması**

source: Advantages
tr: Avantajları

source: Disadvantages
tr: Dezavantajları

source: no login with username and password required when starting Veyon Master
tr: Veyon Master'ı başlatırken kullanıcı adı ve şifre ile giriş yapılması gerekmiyor

source: access to computers can be handled centrally by access rights to the file containing the private key
tr: Bilgisayarlara erişim, özel anahtarı içeren dosyaya erişim haklarıyla merkezi olarak gerçekleştirilebilir

source: more effort for the setup
tr: kurulum için daha fazla çaba

source: user identity can not be assured even after successful signature check
tr: Başarılı imza kontrolünden sonra bile kullanıcı kimliği garanti edilemez

source: system-wide exchange of key files necessary if compromised
tr: Güvenliği ihlal edildiğinde anahtar dosyaların sistem çapında değişimi gerekli

source: **Logon authentication**
tr: **Oturum açma kimlik doğrulaması**

source: easy and effortless setup
tr: kolay ve zahmetsiz kurulum

source: identity of counterpart can be assured, allowing to use :ref:`AccessControlRules`
tr: Karşı tarafın kimliği güvence altına alınabilir, bu da :ref:`AccessControlRules` kullanımına izin verir

source: login with username and password necessary whenever Veyon Master is used
tr: Veyon Master kullanıldığında kullanıcı adı ve şifre ile giriş yapılması zorunludur

source: The respective authentication method can be chosen and configured as described in section :ref:`RefAuthentication` in the configuration reference.
tr: İlgili kimlik doğrulama yöntemi, yapılandırma referansındaki :ref:`RefAuthentication` bölümünde açıklandığı şekilde seçilebilir ve yapılandırılabilir.

source: Key management
tr: Anahtar yönetimi

source: In order to use the key file authentication, first a key pair consisting of a public and a private key has to be created. The configuration page :ref:`RefAuthenticationKeys` is available for this purpose. A new key pair is generated via the :guilabel:`Create key pair` button. A short, concise term such as ``teacher`` should be chosen as the name. Then an access group must be set for both private and public keys. Only users who are to be allowed to access computers using Veyon Master should be member of the access group set for private keys. The public key should be assigned to a global access group so that the key is readable for all users and the operating system.
tr: Anahtar dosyası kimlik doğrulamasını kullanmak için, öncelikle genel ve özel anahtardan oluşan bir anahtar çifti oluşturulmalıdır. Bu amaçla :ref:`RefAuthenticationKeys` yapılandırma sayfası kullanılabilir. :guilabel:`Anahtar çifti oluştur` düğmesi aracılığıyla yeni bir anahtar çifti oluşturulur. ``Öğretmen`` gibi kısa ve öz bir terim ad olarak seçilmelidir. Daha sonra hem özel hem de genel anahtarlar için bir erişim grubu ayarlanmalıdır. Yalnızca Veyon Master kullanarak bilgisayarlara erişmesine izin verilecek kullanıcılar, özel anahtarlar için ayarlanan erişim grubunun üyesi olmalıdır. Genel anahtar, anahtarın tüm kullanıcılar ve işletim sistemi tarafından okunabilir olması için genel bir erişim grubuna atanmalıdır.

source: Once key file authentication is set up and working with one client computer, the keys can also be transferred to a shared network drive and the :ref:`RefKeyFileDirectories` can be changed accordingly. On the client computers only the Veyon configuration has to be imported, while the key files do not have to be imported manually.
tr: Anahtar dosyası kimlik doğrulaması bir istemci bilgisayarıyla ayarlanıp çalıştırıldığında, anahtarlar paylaşılan bir ağ sürücüsüne de aktarılabilir ve :ref:`RefKeyFileDirectories` buna göre değiştirilebilir. İstemci bilgisayarlarda yalnızca Veyon yapılandırmasının içe aktarılması gerekirken, anahtar dosyalarının elle içe aktarılması gerekmez.

source: The private key file may only be accessible to users who should have access to other computers. If the file is stored on a network drive, it is therefore crucial to ensure that file access is restricted with using file ACLs or similar!
tr: Özel anahtar dosyasına yalnızca diğer bilgisayarlara erişimi olması gereken kullanıcılar erişebilir. Dosya bir ağ sürücüsünde saklanıyorsa, dosya erişiminin dosya ACL'leri veya benzerleri kullanılarak kısıtlandığından emin olmak çok önemlidir!

source: The access control module can be used to specify in detail which users may access certain computers. Access control is performed during connection initialization after a successful authentication. While authentication assures the authenticity of an accessing user, the access control functionality restricts computer access to authorized users such as teachers.
tr: Erişim kontrol modülü, hangi kullanıcıların belirli bilgisayarlara erişebileceğini ayrıntılı olarak belirtmek için kullanılabilir. Erişim kontrolü, başarılı bir kimlik doğrulamasından sonra bağlantı başlatma sırasında gerçekleştirilir. Kimlik doğrulama, erişen bir kullanıcının kimliğini doğrularken, erişim kontrol işlevi bilgisayar erişimini öğretmenler gibi yetkili kullanıcılarla sınırlar.

source: The setup is done on the :guilabel:`Access control` configuration page and is described in detail in the :ref:`configuration reference <ConfigurationReference>` as well as chapter :ref:`AccessControlRules`.
tr: Kurulum :guilabel:`Erişim denetimi` yapılandırma sayfasında yapılır ve :ref:`yapılandırma referansı <ConfigurationReference>`de ve :ref:`Erişim Denetimi Kuralları` bölümünde ayrıntılı olarak açıklanır.

source: Like all other settings the access control configuration is part of the local Veyon configuration. The configuration must therefore be :ref:`transferred to all other computers <ConfImportExport>` to work properly.
tr: Diğer tüm ayarlar gibi erişim kontrol yapılandırması da yerel Veyon yapılandırmasının bir parçasıdır. Bu nedenle yapılandırmanın düzgün çalışması için :ref:`diğer tüm bilgisayarlara <ConfImportExport>` aktarılması gerekir.

source: Locations & computers
tr: Konumlar ve bilgisayarlar

source: On the configuration page :guilabel:`Locations & computers` you can create the locations and computers displayed in the Veyon Master application when the :ref:`RefNetworkObjectDirectory` backend *Builtin* is used. Unlike backends such as :ref:`LDAP <LDAP>` this information is stored in the local configuration and must therefore be transferred to all computers.
tr: Yapılandırma sayfasında :guilabel:`Locations & computers` :ref:`RefNetworkObjectDirectory` arka ucu *Builtin* kullanıldığında Veyon Master uygulamasında görüntülenen konumları ve bilgisayarları oluşturabilirsiniz. :ref:`LDAP <LDAP>` gibi arka uçların aksine bu bilgi yerel yapılandırmada saklanır ve bu nedenle tüm bilgisayarlara aktarılmalıdır.

source: The configuration page consists of two lists. The left list contains all configured locations. Using the two buttons below the list, locations may be added or removed. Existing locations can be edited and renamed by double-clicking.
tr: Yapılandırma sayfası iki listeden oluşur. Soldaki liste tüm yapılandırılmış konumları içerir. Listenin altındaki iki düğmeyi kullanarak konumlar eklenebilir veya kaldırılabilir. Mevcut konumlar çift tıklanarak düzenlenebilir ve yeniden adlandırılabilir.

source: The list on the right contains all computers stored for the currently selected location. The two buttons below the list can be used to add or remove computers. The individual cells in the table can be edited by double-clicking them. A computer name and a hostname or IP address must be specified for each computer. To access Veyon Server instances other than the default (:ref:`Multi session mode <RefMultiSessionMode>`) the corresponding port numbers have to be appended, e.g. ``myhost.example.org:11101``. In case the `Wake-on-LAN <https://en.wikipedia.org/wiki/Wake-on-LAN>`_ feature is to be used, the corresponding MAC address must also be supplied. Otherwise this column can be left blank.
tr: Sağdaki liste, şu anda seçili konum için depolanan tüm bilgisayarları içerir. Listenin altındaki iki düğme, bilgisayar eklemek veya kaldırmak için kullanılabilir. Tablodaki bireysel hücreler, üzerlerine çift tıklanarak düzenlenebilir. Her bilgisayar için bir bilgisayar adı ve bir ana bilgisayar adı veya IP adresi belirtilmelidir. Varsayılan (:ref:`Çoklu oturum modu <RefMultiSessionMode>`) dışındaki Veyon Server örneklerine erişmek için, karşılık gelen bağlantı noktası numaralarının eklenmesi gerekir, örn. ``myhost.example.org:11101``. `Wake-on-LAN <https://en.wikipedia.org/wiki/Wake-on-LAN>`_ özelliğinin kullanılması durumunda, karşılık gelen MAC adresi de sağlanmalıdır. Aksi takdirde bu sütun boş bırakılabilir.

source: All information about connecting Veyon to an LDAP-compatible server such as *OpenLDAP* or *Active Directory* can be found in chapter :ref:`LDAP`.
tr: Veyon'u *OpenLDAP* veya *Active Directory* gibi LDAP uyumlu bir sunucuya bağlama hakkında tüm bilgiler :ref:`LDAP` bölümünde bulunabilir.

source: Importing/exporting a configuration
tr: Bir yapılandırmayı içe/dışa aktarma

source: An imported prerequisite for the use of Veyon is an identical configuration on all computers. Transferring the Veyon configuration to another computer can be done manually at first, but should be automated later. Different methods are available for both ways.
tr: Veyon'un kullanımı için ithal bir ön koşul, tüm bilgisayarlarda aynı yapılandırmanın olmasıdır. Veyon yapılandırmasını başka bir bilgisayara aktarmak ilk başta manuel olarak yapılabilir, ancak daha sonra otomatikleştirilmelidir. Her iki yol için de farklı yöntemler mevcuttur.

source: In the Veyon Configurator you can find the entry :guilabel:`Save settings to file` in the :guilabel:`File` menu. This entry allows exporting the current configuration to a file in JSON format. This file can be imported to another computer using the entry :guilabel:`Load settings from file` in the same menu. Please note, that the settings are loaded into the user interface during the import, but are applied and saved in the system only after the :guilabel:`Apply` button has been pressed.
tr: Veyon Yapılandırıcıda :guilabel:`Dosya` menüsünde :guilabel:`Ayarları dosyaya kaydet` girişini bulabilirsiniz. Bu giriş, geçerli yapılandırmayı JSON formatında bir dosyaya aktarmaya olanak tanır. Bu dosya, aynı menüdeki :guilabel:`Ayarları dosyadan yükle` girişi kullanılarak başka bir bilgisayara aktarılabilir. Lütfen ayarların içe aktarma sırasında kullanıcı arayüzüne yüklendiğini, ancak yalnızca :guilabel:`Uygula` düğmesine basıldıktan sonra sisteme uygulandığını ve kaydedildiğini unutmayın.

source: The :ref:`ConfigurationManagement` module of the :ref:`CommandLineInterface` can be used to automate/script configuration import and export.
tr: :ref:`CommandLineInterface`'in :ref:`ConfigurationManagement` modülü, yapılandırma içe ve dışa aktarımını otomatikleştirmek/komut dosyası olarak kullanmak için kullanılabilir.

source: Additionally, when performing an :ref:`automated installation <AutoInstall>` the configuration can be imported without requiring any further user interaction. In the example section an :ref:`example <InstallationConfigurationImport>` is given for the installer parameter ``/ApplyConfig``.
tr: Ek olarak, :ref:`otomatik kurulum <AutoInstall>` gerçekleştirirken yapılandırma herhangi bir kullanıcı etkileşimi gerektirmeden içe aktarılabilir. Örnek bölümünde yükleyici parametresi ``/ApplyConfig`` için bir :ref:`örnek <InstallationConfigurationImport>` verilmiştir.

source: Reset configuration
tr: Ayarları sıfırla

source: In some error situations it may be advisable to completely reset the Veyon configuration and then restart with the default values. For this purpose you can use the entry :guilabel:`Reset configuration` in the :guilabel:`File` menu in the Veyon Configurator.
tr: Bazı hata durumlarında Veyon yapılandırmasını tamamen sıfırlamak ve ardından varsayılan değerlerle yeniden başlatmak tavsiye edilebilir. Bu amaçla Veyon Configurator'daki :guilabel:`File` menüsündeki :guilabel:`Reset configuration` girişini kullanabilirsiniz.

source: Alternatively the configuration can also be reset using the :ref:`ConfigurationManagement` module of the :ref:`CommandLineInterface`.
tr: Alternatif olarak yapılandırma, :ref:`CommandLineInterface` modülünün :ref:`ConfigurationManagement` modülü kullanılarak da sıfırlanabilir.

source: Furthermore the saved configuration can be reset on operating system level. On Linux the file :file:`/etc/xdg/Veyon Solutions/Veyon.conf` has to be deleted, while on Windows the registry key :file:`HKLM\\Software\\Veyon Solutions` and all of its subkeys have to be deleted.
tr: Ayrıca kaydedilen yapılandırma işletim sistemi seviyesinde sıfırlanabilir. Linux'ta :file:`/etc/xdg/Veyon Solutions/Veyon.conf` dosyası silinmeli, Windows'ta ise :file:`HKLM\\Software\\Veyon Solutions` kayıt defteri anahtarı ve tüm alt anahtarları silinmelidir.

source: Quick start
tr: Hızlı başlangıç

source: Key file authentication
tr: Anahtar dosyası kimlik doğrulaması

source: Public key
tr: Genel anahtar

source: Private key
tr: Özel anahtar

source: Key file
tr: Anahtar dosyası

source: Logon authentication
tr: Oturum açma kimlik doğrulaması

source: Username
tr: Kullanıcı adı

source: Password
tr: Şifre

source: Key pair
tr: Anahtar çifti

source: Locations and computers
tr: Konumlar ve bilgisayarlar

source: Export configuration
tr: Yapılandırmayı dışa aktar

source: Import configuration
tr: Yapılandırmayı içe aktar

source: Load settings
tr: Ayarları yükle

source: Save settings
tr: Ayarları kaydet

source: Reset settings
tr: Ayarları sıfırla

source: Clear configuration
tr: Yapılandırmayı temizle

source: Delete configuration
tr: Yapılandırmayı sil

source: FAQ - Frequently Asked Questions
tr: SSS - Sıkça Sorulan Sorular

source: Does Veyon run under Chrome OS (ChromeBooks) or MacOS?
tr: Veyon Chrome OS (ChromeBooks) veya MacOS altında çalışıyor mu?

source: Currently Veyon is only available for Linux- and Windows-based environments. Support for other platforms is being worked on though. The Veyon project relies on the help of experienced software developers, especially for porting Veyon to macOS and Android.
tr: Şu anda Veyon yalnızca Linux ve Windows tabanlı ortamlar için kullanılabilir. Ancak diğer platformlar için destek üzerinde çalışılıyor. Veyon projesi, özellikle Veyon'u macOS ve Android'e taşımak için deneyimli yazılım geliştiricilerinin yardımına güveniyor.

source: How can I add computers in order to access them?
tr: Bilgisayarlara erişebilmek için onları nasıl ekleyebilirim?

source: If the default :ref:`RefNetworkObjectDirectory` is used, all you need to do is add the appropriate locations and computers on the :ref:`ConfLocationsAndComputers` configuration page. Afterwards the added resources are available in Veyon Master.
tr: Varsayılan :ref:`RefNetworkObjectDirectory` kullanılıyorsa, yapmanız gereken tek şey :ref:`ConfLocationsAndComputers` yapılandırma sayfasında uygun konumları ve bilgisayarları eklemektir. Daha sonra eklenen kaynaklar Veyon Master'da kullanılabilir.

source: If :ref:`LDAP` is configured the network object directory has to be changed to the appropriate LDAP backend so that the computers from the directory are displayed in the Veyon Master.
tr: :ref:`LDAP` yapılandırılmışsa, ağ nesnesi dizini uygun LDAP arka ucuna değiştirilmelidir, böylece dizindeki bilgisayarlar Veyon Master'da görüntülenebilir.

source: How can I migrate an existing iTALC installation to Veyon?
tr: Mevcut bir iTALC kurulumunu Veyon'a nasıl taşıyabilirim?

source: Although iTALC and Veyon are conceptually similar, a complete new installation and configuration is necessary to use Veyon, since configuration and file formats as well as their paths have changed and are not compatible. For a migration iTALC has to be uninstalled completely first. It is recommended to reboot the computer afterwards. Veyon can then be installed and configured in the same way as iTALC.
tr: iTALC ve Veyon kavramsal olarak benzer olsa da, yapılandırma ve dosya biçimleri ve yolları değiştiği ve uyumlu olmadığı için Veyon'u kullanmak için tamamen yeni bir kurulum ve yapılandırma gereklidir. Bir geçiş için iTALC'ın önce tamamen kaldırılması gerekir. Daha sonra bilgisayarı yeniden başlatmanız önerilir. Veyon daha sonra iTALC ile aynı şekilde kurulabilir ve yapılandırılabilir.

source: While the configuration of authentication methods is very similar, the configuration of locations and computers is done via the Veyon Configurator and no longer in the Master application. In this context you should check whether the new :ref:`LDAP` can be used to make locations and computers automatically available in Veyon.
tr: Kimlik doğrulama yöntemlerinin yapılandırması çok benzer olsa da, konumlar ve bilgisayarların yapılandırması Veyon Configurator üzerinden yapılır ve artık Master uygulamasında yapılmaz. Bu bağlamda, yeni :ref:`LDAP`'nin konumları ve bilgisayarları Veyon'da otomatik olarak kullanılabilir kılmak için kullanılıp kullanılamayacağını kontrol etmelisiniz.

source: Is it possible to use Veyon Master on more than one computer?
tr: Veyon Master'ı birden fazla bilgisayarda kullanmak mümkün mü?

source: The usage of Veyon Master on multiple computers is possible without any restrictions. For this to work an identical configuration has to be used on all master computers like it's required for client computers in general. If logon authentication is used no further steps are necessary. If key file authentication is used the same private key has to be distributed to all master computers.
tr: Veyon Master'ın birden fazla bilgisayarda kullanımı herhangi bir kısıtlama olmaksızın mümkündür. Bunun işe yaraması için, genel olarak istemci bilgisayarlar için gerekli olduğu gibi tüm ana bilgisayarlarda aynı yapılandırmanın kullanılması gerekir. Oturum açma kimlik doğrulaması kullanılırsa başka bir adım gerekmez. Anahtar dosyası kimlik doğrulaması kullanılırsa aynı özel anahtar tüm ana bilgisayarlara dağıtılmalıdır.

source: How can an existing VNC server be used in conjunction with Veyon?
tr: Mevcut bir VNC sunucusu Veyon ile birlikte nasıl kullanılabilir?

source: In some environments a VNC server is already installed (e. g. UltraVNC) or is provided by the system (e. g. VNC-based access to virtual desktops in VDI environments). This may result in degraded performance or conflicts with the Veyon-internal VNC server. In such cases it is recommended to configure Veyon to use the existing (external) VNC server instead of starting the internal VNC server. The configuration is done through the Veyon Configurator on the configuration page :ref:`RefService` in section :ref:`RefVNCServer`.
tr: Bazı ortamlarda bir VNC sunucusu zaten kuruludur (örn. UltraVNC) veya sistem tarafından sağlanır (örn. VDI ortamlarında sanal masaüstlerine VNC tabanlı erişim). Bu, performansın düşmesine veya Veyon-dahili VNC sunucusuyla çakışmalara neden olabilir. Bu gibi durumlarda, dahili VNC sunucusunu başlatmak yerine Veyon'un mevcut (harici) VNC sunucusunu kullanacak şekilde yapılandırılması önerilir. Yapılandırma, yapılandırma sayfasındaki :ref:`RefService` bölümündeki :ref:`RefVNCServer` Veyon Yapılandırıcısı aracılığıyla yapılır.

source: Can I import/use an existing or generated file with location and computer information?
tr: Konum ve bilgisayar bilgileri içeren mevcut veya oluşturulmuş bir dosyayı içe aktarabilir/kullanabilir miyim?

source: As of Veyon 4.1, there is a new :ref:`module for the command line interface <CLINetworkObjectDirectory>`. This module can be used to import locations and computers from any kind of text files (including CSV files) into the builtin network object directory.
tr: Veyon 4.1'den itibaren, komut satırı arayüzü <CLINetworkObjectDirectory> için yeni bir :ref:`modülü` bulunmaktadır. Bu modül, herhangi bir tür metin dosyasından (CSV dosyaları dahil) yerleşik ağ nesnesi dizinine konumları ve bilgisayarları içe aktarmak için kullanılabilir.

source: How can I view or control all monitors of a remote computer?
tr: Uzaktaki bir bilgisayarın tüm monitörlerini nasıl görüntüleyebilir veya kontrol edebilirim?

source: On Windows by default only the primary monitor of a computer is accessible with Veyon. You can however change this behaviour in the :ref:`RefVNCServer` configuration. Select the VNC server plugin :guilabel:`Builtin VNC server` and enable the option :guilabel:`Enable multi monitor support`.
tr: Windows'da varsayılan olarak yalnızca bilgisayarın birincil monitörü Veyon ile erişilebilir. Ancak bu davranışı :ref:`RefVNCServer` yapılandırmasında değiştirebilirsiniz. VNC sunucu eklentisini :guilabel:`Yerleşik VNC sunucusu` seçin ve :guilabel:`Çoklu monitör desteğini etkinleştir` seçeneğini etkinleştirin.

source: How can I import or export the selection of displayed computers?
tr: Görüntülenen bilgisayarların seçimini nasıl içe veya dışa aktarabilirim?
