Repository: veyon/docs
Catalog: locale/*/LC_MESSAGES/admin.po
Languages: tr

source: When using access control in combination with the default backend only the local system groups are available per default. By enabling this option all groups of the domain which a computer belongs to can be queried and used. This option is not enabled per default for performance reasons. In environments with a huge number of domain groups performing access control can take a long time. In such scenarios you should consider setting up the :ref:`LDAP/AD integration <LDAP>` and use one of the *LDAP* backends.
tr: Varsayılan arka uçla birlikte erişim denetimi kullanıldığında, varsayılan olarak yalnızca yerel sistem grupları kullanılabilir. Bu seçeneği etkinleştirerek, bir bilgisayarın ait olduğu etki alanının tüm grupları sorgulanabilir ve kullanılabilir. Bu seçenek, performans nedenleriyle varsayılan olarak etkinleştirilmemiştir. Çok sayıda etki alanı grubunun bulunduğu ortamlarda erişim denetimi gerçekleştirmek uzun zaman alabilir. Bu tür senaryolarda :ref:`LDAP/AD entegrasyonu <LDAP>`'i kurmayı ve *LDAP* arka uçlarından birini kullanmayı düşünmelisiniz.

source: Logging
tr: Günlük kaydı

source: Veyon can log various kinds of messages to component-specific log files or the logging system of the operating system. This information can be very helpful when troubleshooting issues with Veyon. The following logging settings allow to change the logging behaviour.
tr: Veyon, çeşitli türdeki mesajları bileşene özgü günlük dosyalarına veya işletim sisteminin günlük sistemine kaydedebilir. Bu bilgiler, Veyon ile ilgili sorunları giderirken çok yardımcı olabilir. Aşağıdaki günlük ayarları, günlük davranışını değiştirmenize olanak tanır.

source: Log file directory
tr: Günlük dosyası dizini

source: You can use this setting to specify which directory the log files will be written in. It's strongly recommended to use path variables here. All information on supported variables can be found in section :ref:`RefPathVariables`.
tr: Bu ayarı günlük dosyalarının hangi dizine yazılacağını belirtmek için kullanabilirsiniz. Burada yol değişkenlerini kullanmanız şiddetle önerilir. Desteklenen değişkenlerle ilgili tüm bilgiler :ref:`RefPathVariables` bölümünde bulunabilir.

source: **Default:** *%TEMP%*
tr: **Varsayılan:** *%TEMP%*

source: Log level
tr: Günlük seviyesi

source: The log level defines the minimum severity for which log messages are written. When analyzing program failures it may be useful to set the log level to :guilabel:`Debug messages and everything else`. This will generate a huge amount of log data and is not recommended for production environments. The default log level *Warnings and errors* or higher should be used instead.
tr: Günlük düzeyi, günlük iletilerinin yazıldığı minimum önem derecesini tanımlar. Program hatalarını analiz ederken günlük düzeyini :guilabel:`Hata ayıklama iletileri ve diğer her şey` olarak ayarlamak yararlı olabilir. Bu, çok miktarda günlük verisi üretecektir ve üretim ortamları için önerilmez. Bunun yerine varsayılan günlük düzeyi *Uyarılar ve hatalar* veya daha yüksek kullanılmalıdır.

source: **Default:** *Warnings and errors*
tr: **Varsayılan:** *Uyarılar ve hatalar*

source: Limit log file size
tr: Günlük dosya boyutunu sınırla

source: In order for log files not to become too large and occupy disk space unnecessarily their size can be limited through this setting. When enabled an upper limit for the size of a single log file can be configured.
tr: Günlük dosyalarının çok büyük olmaması ve gereksiz yere disk alanı kaplamaması için bu ayar aracılığıyla boyutları sınırlandırılabilir. Etkinleştirildiğinde, tek bir günlük dosyasının boyutu için bir üst sınır yapılandırılabilir.

source: **Default:** *disabled / 100 MB*
tr: **Varsayılan:** *devre dışı / 100 MB*

source: Rotate log files
tr: Günlük dosyalarını döndür

source: In conjunction with limiting the size of log files it additionally may be useful to rotate the log files. When enabled each log file is renamed to ``Veyon...log.0`` after exceeding the configured limit. Previously rotated files are renamed so that the number of the file suffix is increased by 1. If the configured number of rotations is reached the oldest file (i.e. the one with the highest number as a suffix) is deleted.
tr: Günlük dosyalarının boyutunu sınırlamakla birlikte, günlük dosyalarını döndürmek de yararlı olabilir. Etkinleştirildiğinde, yapılandırılan sınırı aştıktan sonra her günlük dosyası ``Veyon...log.0`` olarak yeniden adlandırılır. Daha önce döndürülen dosyalar, dosya eki numarası 1 artırılacak şekilde yeniden adlandırılır. Yapılandırılan döndürme sayısına ulaşıldığında en eski dosya (yani ek olarak en yüksek sayıya sahip olan) silinir.

source: **Default:** *disabled / 10x*
tr: **Varsayılan:** *devre dışı / 10x*

source: Log to standard error output
tr: Standart hata çıktısına günlükle

source: When program components of Veyon are executed from a command line window (shell), you can use this option to specify, whether logging messages shall be printed to ``stderr`` or ``stdout``. This setting primarily is relevant for scripting operations only.
tr: Veyon'un program bileşenleri bir komut satırı penceresinden (kabuk) çalıştırıldığında, günlük mesajlarının ``stderr`` veya ``stdout``'a yazdırılıp yazdırılmayacağını belirtmek için bu seçeneği kullanabilirsiniz. Bu ayar öncelikle yalnızca betik işlemleri için geçerlidir.

source: Write to logging system of operating system
tr: İşletim sisteminin günlükleme sistemine yaz

source: In some environments it may be desired to write log messages directly to the Windows event log e.g. in order to collect them afterwards. This option does not influence the normal recording of log files. On Linux, this option enables forwarding log messages from Veyon Server processes to the systemd journal of the ``veyon.service`` unit.
tr: Bazı ortamlarda, günlük mesajlarının doğrudan Windows olay günlüğüne yazılması istenebilir örneğin, daha sonra toplamak için. Bu seçenek, günlük dosyalarının normal kaydını etkilemez. Linux'ta, bu seçenek günlük mesajlarının Veyon Server işlemlerinden ``veyon.service`` biriminin systemd günlüğüne iletilmesini sağlar.

source: You can use the :guilabel:`Clear all log files` button to delete all Veyon log files in the log file directory of the current user as well as the ones of the system service. This will stop the Veyon Service temporarily.
tr: Geçerli kullanıcının günlük dosyası dizinindeki tüm Veyon günlük dosyalarını ve sistem hizmetinin günlük dosyalarını silmek için :guilabel:`Tüm günlük dosyalarını temizle` düğmesini kullanabilirsiniz. Bu, Veyon Hizmetini geçici olarak durduracaktır.

source: Service
tr: Hizmet

source: Hide tray icon
tr: Tepsi simgesini gizle

source: By default the Veyon Service displays a tray icon (also called *system control panel*, *info area* or similar) to indicate proper operation and provide basic information such as the program version and network port which the service is listening at. The tray icon can be hidden by enabling this option.
tr: Varsayılan olarak Veyon Hizmeti, düzgün çalışmayı belirtmek ve hizmetin dinlediği program sürümü ve ağ portu gibi temel bilgileri sağlamak için bir tepsi simgesi (ayrıca *sistem kontrol paneli*, *bilgi alanı* veya benzeri olarak da adlandırılır) görüntüler. Tepsi simgesi, bu seçeneği etkinleştirerek gizlenebilir.

source: Show notification when an unauthorized access is blocked
tr: Yetkisiz erişim engellendiğinde bildirim göster

source: This option specifies whether a notification should be displayed if the access to the local computer was blocked, either due to an authentication failure or access control denying the access. Especially during the deployment and setup of Veyon these notifications often indicate problems with the authentication settings. Typical failure reasons are invalid authentication keys or (when using logon authentication) invalid user credentials (username/password).
tr: Bu seçenek, yerel bilgisayara erişimin bir kimlik doğrulama hatası veya erişim denetiminin erişimi reddetmesi nedeniyle engellenmesi durumunda bir bildirim görüntülenip görüntülenmeyeceğini belirtir. Özellikle Veyon'un dağıtımı ve kurulumu sırasında bu bildirimler genellikle kimlik doğrulama ayarlarıyla ilgili sorunları gösterir. Tipik hata nedenleri geçersiz kimlik doğrulama anahtarları veya (oturum açma kimlik doğrulaması kullanılırken) geçersiz kullanıcı kimlik bilgileridir (kullanıcı adı/şifre).

source: Show notification on remote connection
tr: Uzak bağlantıda bildirim göster

source: In some environments it may be desired or even required to inform the user that his computer is being accessed remotely. This behaviour can be achieved by enabling this option. In case the user has to be asked for permission instead appropriate access control rules have to be configured. More information can be found in chapter :ref:`AccessControlRules`.
tr: Bazı ortamlarda, kullanıcının bilgisayarına uzaktan erişildiği bilgisinin kullanıcıya iletilmesi istenebilir veya hatta gerekli olabilir. Bu davranış, bu seçeneğin etkinleştirilmesiyle sağlanabilir. Kullanıcıdan izin istenmesi durumunda, uygun erişim kontrol kurallarının yapılandırılması gerekir. Daha fazla bilgi :ref:`AccessControlRules` bölümünde bulunabilir.

source: Autostart
tr: Otomatik Başlat

source: Upon the installation of Veyon the Veyon Service is registered as a system service in order to launch the Veyon Server automatically for user sessions. The start of the Veyon Service can be prevented by disabling this option. You'll then have to start the Veyon Server in user sessions manually. The logon screen will not be accessible in this case.
tr: Veyon kurulumu sırasında Veyon Hizmeti, Veyon Sunucusunu kullanıcı oturumları için otomatik olarak başlatmak amacıyla bir sistem hizmeti olarak kaydedilir. Veyon Hizmetinin başlatılması bu seçeneği devre dışı bırakarak önlenebilir. Daha sonra Veyon Sunucusunu kullanıcı oturumlarında manuel olarak başlatmanız gerekir. Bu durumda oturum açma ekranına erişilemez.

source: Local session mode (single server instance for primary local session)
tr: Yerel oturum modu (birincil yerel oturum için tek sunucu örneği)

source: Choose this option for single-user scenarios, i.e. each user is working locally on a dedicated computer. In this mode the Veyon Service will always start exactly one server instance for the primary session of the computer, e.g. the console session on Windows.
tr: Tek kullanıcı senaryoları için bu seçeneği seçin, yani her kullanıcı özel bir bilgisayarda yerel olarak çalışıyor. Bu modda Veyon Hizmeti her zaman bilgisayarın birincil oturumu için tam olarak bir sunucu örneği başlatacaktır, örn. Windows'daki konsol oturumu.

source: Active session mode (single server instance for active local or remote session)
tr: Etkin oturum modu (etkin yerel veya uzak oturum için tek sunucu örneği)

source: Choose this option if you always want to view or access the active session, no matter if it's a local or remote session or the session type changes in inbetween. If e.g. a local session is being taken over via Remote Desktop, the Veyon Server instance is restarted inside the remote session and switches back to the local session as soon as the remote session is terminated.
tr: Etkin oturumu her zaman görüntülemek veya erişmek istiyorsanız, bunun yerel veya uzak bir oturum olması veya arada oturum türünün değişmesi fark etmeksizin bu seçeneği seçin. Örneğin, yerel bir oturum Uzak Masaüstü aracılığıyla devralınıyorsa, Veyon Server örneği uzak oturumun içinde yeniden başlatılır ve uzak oturum sonlandırılır sonlandırılmaz yerel oturuma geri döner.

source: Multi session mode (for terminal and remote desktop servers)
tr: Çoklu oturum modu (terminal ve uzak masaüstü sunucuları için)

source: Enabling this option makes the Veyon Service launch a Veyon Server process for every user session on a computer. This includes both local and remote (RDP) sessions. Typically this is required to support terminal/remote desktop server scenarios. The server instances listen on individual network port numbers based on the :ref:`Veyon server port number <RefVeyonServerPort>` and the session ID. To access a session other than the default session, the corresponding port number has to be appended to the hostname in the :ref:`ConfLocationsAndComputers` configuration page. You can use e.g. ``myhost.example.org:11101`` to access the first RDP session on a computer. Alternatively consider using the `NetworkDiscovery add-on <https://veyon.io/addons/#networkdiscovery>`_ which scans computers for sessions and makes them available in Veyon Master automatically.
tr: Bu seçeneği etkinleştirmek, Veyon Hizmetinin bir bilgisayardaki her kullanıcı oturumu için bir Veyon Sunucusu işlemi başlatmasını sağlar. Buna hem yerel hem de uzak (RDP) oturumlar dahildir. Genellikle bu, terminal/uzak masaüstü sunucu senaryolarını desteklemek için gereklidir. Sunucu örnekleri, :ref:`Veyon sunucu bağlantı noktası numarası <RefVeyonServerPort>` ve oturum kimliğine göre ayrı ağ bağlantı noktası numaralarını dinler. Varsayılan oturumdan farklı bir oturuma erişmek için, karşılık gelen bağlantı noktası numarasının :ref:`ConfLocationsAndComputers` yapılandırma sayfasındaki ana bilgisayar adına eklenmesi gerekir. Örneğin, bir bilgisayardaki ilk RDP oturumuna erişmek için ``myhost.example.org:11101`` kullanabilirsiniz. Alternatif olarak, bilgisayarları oturumlar için tarayan ve bunları Veyon Master'da otomatik olarak kullanılabilir hale getiren `NetworkDiscovery eklentisini <https://veyon.io/addons/#networkdiscovery>`_ kullanmayı düşünün.

source: Maximum session count
tr: Maksimum oturum sayısı

source: In multi session mode the number of server instances can be limited through this setting. Per default up to 100 concurrent sessions are supported on a computer. When using numbers higher than 100, make sure to adjust the :ref:`server port numbers <RefNetworkPortNumbers>` to be more than 100 apart. Otherwise port numbers of different instances and server types would overlap and cause malfunctions.
tr: Çoklu oturum modunda sunucu örneklerinin sayısı bu ayar aracılığıyla sınırlandırılabilir. Varsayılan olarak bir bilgisayarda en fazla 100 eşzamanlı oturum desteklenir. 100'den büyük sayılar kullanırken, :ref:`sunucu bağlantı noktası numaraları <RefNetworkPortNumbers>`i 100'den fazla aralıklı olacak şekilde ayarladığınızdan emin olun. Aksi takdirde farklı örneklerin ve sunucu türlerinin bağlantı noktası numaraları çakışır ve arızalara neden olur.

source: **Default:** *100*
tr: **Varsayılan:** *100*

source: Network port numbers
tr: Ağ bağlantı noktası numaraları

source: Veyon server
tr: Veyon sunucusu

source: This setting allows you to specify the network port number on which the Veyon Server listens for incoming connections.
tr: Bu ayar, Veyon Sunucusunun gelen bağlantıları dinleyeceği ağ bağlantı noktası numarasını belirtmenize olanak tanır.

source: **Default:** *11100*
tr: **Varsayılan:** *11100*

source: Internal VNC server
tr: Dahili VNC sunucusu

source: This setting allows you to specify the network port number used by the internal VNC server. The internal VNC server only listens on ``localhost``, so it is never directly accessible from the network. Only the local Veyon server accesses the internal VNC server and forwards screen data and user input accordingly.
tr: Bu ayar, dahili VNC sunucusu tarafından kullanılan ağ bağlantı noktası numarasını belirtmenize olanak tanır. Dahili VNC sunucusu yalnızca ``localhost``'u dinler, bu nedenle ağdan doğrudan erişilebilir değildir. Yalnızca yerel Veyon sunucusu dahili VNC sunucusuna erişir ve ekran verilerini ve kullanıcı girişini buna göre iletir.

source: **Default:** *11200*
tr: **Varsayılan:** *11200*

source: Feature manager
tr: Özellik yöneticisi

source: This setting allows you to specify the network port number used by the feature manager. This internal component is part of the Veyon Server and listens at ``localhost`` only. It starts/stops processes to provide specific features. In contrast to the Veyon Service these processes in most cases have to run in the context of the logged on user and therefore have to communicate with the Veyon Server through this network port.
tr: Bu ayar, özellik yöneticisi tarafından kullanılan ağ bağlantı noktası numarasını belirtmenize olanak tanır. Bu dahili bileşen Veyon Sunucusunun bir parçasıdır ve yalnızca ``localhost``'u dinler. Belirli özellikler sağlamak için işlemleri başlatır/durdurur. Veyon Hizmetinin aksine, bu işlemler çoğu durumda oturum açmış kullanıcının bağlamında çalışmak zorundadır ve bu nedenle Veyon Sunucusuyla bu ağ bağlantı noktası üzerinden iletişim kurmak zorundadır.

source: **Default:** *11300*
tr: **Varsayılan:** *11300*

source: Demo server
tr: Gösteri sunucusu

source: This setting allows you to specify the network port number used by the demo server. The demo server is a special high-efficiency VNC server that makes the screen data of the demo computer available to all participating computers.
tr: Bu ayar, gösteri sunucusu tarafından kullanılan ağ bağlantı noktası numarasını belirtmenize olanak tanır. Demo sunucusu, demo bilgisayarının ekran verilerini tüm katılımcı bilgisayarlara sunan özel bir yüksek verimli VNC sunucusudur.

source: **Default:** *11400*
tr: **Varsayılan:** *11400*

source: Miscellaneous settings
tr: Çeşitli ayarlar

source: Enable firewall exception
tr: Güvenlik duvarı istisnasını etkinleştir

source: Depending on the system configuration it may be impossible to access listening ports such as the Veyon Server port from the network. On Windows the Windows firewall usually blocks any incoming connections. In order to allow access to the Veyon server port and the demo server port, exceptions for the Windows firewall must be configured. This is done automatically during the installation process. If this behavior is not desired and manual configuration is preferred, this option can be disabled.
tr: Sistem yapılandırmasına bağlı olarak, Veyon Server portu gibi dinleme portlarına ağdan erişim imkansız olabilir. Windows'ta Windows güvenlik duvarı genellikle gelen tüm bağlantıları engeller. Veyon server portuna ve demo server portuna erişime izin vermek için Windows güvenlik duvarı için istisnalar yapılandırılmalıdır. Bu, kurulum işlemi sırasında otomatik olarak yapılır. Bu davranış istenmiyorsa ve manuel yapılandırma tercih ediliyorsa, bu seçenek devre dışı bırakılabilir.

source: Allow connections from localhost only
tr: Yalnızca localhost'tan gelen bağlantılara izin ver

source: If you do not want the Veyon Server to be available to other computers in the network, you can use this option. This option must not be activated for normal computers that should be accessible from the Veyon Master application. However, this option can be useful for teacher computers to provide additional security beyond the access control functionality. Access to the demo server is not affected by this option.
tr: Veyon Server'ın ağdaki diğer bilgisayarlar tarafından erişilebilir olmasını istemiyorsanız, bu seçeneği kullanabilirsiniz. Bu seçenek, Veyon Master uygulamasından erişilebilir olması gereken normal bilgisayarlar için etkinleştirilmemelidir. Ancak, bu seçenek erişim kontrol işlevselliğinin ötesinde ek güvenlik sağlamak için öğretmen bilgisayarları için yararlı olabilir. Demo sunucusuna erişim bu seçenekten etkilenmez.

source: Disable clipboard synchronization
tr: Pano senkronizasyonunu devre dışı bırak

source: If you do not want the clipboard contents to be synchronized when remote controlling a computer, enable this option. This may also help to fix unspecific clipboard-related issues occurring while the Veyon Server is running.
tr: Bir bilgisayarı uzaktan kontrol ederken panonun içeriğinin senkronize edilmesini istemiyorsanız, bu seçeneği etkinleştirin. Bu ayrıca Veyon Server çalışırken oluşan belirsiz panoyla ilgili sorunları düzeltmeye de yardımcı olabilir.

source: VNC server
tr: VNC sunucusu

source: Plugin
tr: Eklenti

source: By default Veyon uses an internal platform-specific VNC server implementation to provide the screen data of a computer. In some cases, however, it may be desirable to use a plugin with a different implementation. If a separate VNC server is already running on the computer, this server instance can be used instead of the internal VNC server by choosing the plugin :guilabel:`External VNC server`. In this case the password and network port of the installed VNC server have to be supplied.
tr: Varsayılan olarak Veyon, bir bilgisayarın ekran verilerini sağlamak için dahili platforma özgü bir VNC sunucusu uygulaması kullanır. Ancak bazı durumlarda farklı bir uygulamaya sahip bir eklenti kullanmak istenebilir. Bilgisayarda ayrı bir VNC sunucusu zaten çalışıyorsa, bu sunucu örneği :guilabel:`Harici VNC sunucusu` eklentisi seçilerek dahili VNC sunucusu yerine kullanılabilir. Bu durumda, yüklü VNC sunucusunun parolası ve ağ bağlantı noktası sağlanmalıdır.

source: **Default:** *Builtin VNC server*
tr: **Varsayılan:** *Yerleşik VNC sunucusu*

source: Platform-specific information on how to configure the individual internal VNC server can be found in chapter :ref:`PlatformNotes`.
tr: Bireysel dahili VNC sunucusunun nasıl yapılandırılacağına ilişkin platforma özgü bilgiler :ref:`PlatformNotes` bölümünde bulunabilir.

source: Session metadata
tr: Oturum meta verileri

source: Content
tr: İçerik

source: Registry key
tr: Kayıt anahtarı

source: All settings on this page influence the appearance, behaviour and features of the Veyon Master application.
tr: Bu sayfadaki tüm ayarlar Veyon Master uygulamasının görünümünü, davranışını ve özelliklerini etkiler.

source: **Directories**
tr: **Dizinler**

source: In order to make a configuration generic and independent of the user, you should use path variables instead of absolute paths in the directory settings. All information on supported variables can be found in section :ref:`RefPathVariables`.
tr: Bir yapılandırmayı genel ve kullanıcıdan bağımsız hale getirmek için dizin ayarlarında mutlak yollar yerine yol değişkenleri kullanmalısınız. Desteklenen değişkenlerle ilgili tüm bilgiler :ref:`RefPathVariables` bölümünde bulunabilir.

source: User configuration
tr: Kullanıcı yapılandırması

source: The user specific configuration of Veyon Master is stored in this directory. The configuration contains settings for the user interface as well as the computer selection of the last session.
tr: Veyon Master'ın kullanıcıya özgü yapılandırması bu dizinde saklanır. Yapılandırma, kullanıcı arayüzünün ayarlarını ve son oturumun bilgisayar seçimini içerir.

source: **Default:** *%APPDATA%/Config*
tr: **Varsayılan:** *%APPDATA%/Config*

source: Screenshots
tr: Ekran görüntüleri

source: All image files that have been generated by using the screenshot feature are stored in this directory. In case you want to collect the files in a central folder, a different directory path can be supplied here.
tr: Ekran görüntüsü özelliği kullanılarak oluşturulan tüm resim dosyaları bu dizinde saklanır. Dosyaları merkezi bir klasörde toplamak isterseniz, burada farklı bir dizin yolu sağlanabilir.

source: **Default:** *%APPDATA%/Screenshots*
tr: **Varsayılan:** *%APPDATA%/Screenshots*

source: Configuration templates
tr: Yapılandırma şablonları

source: **User interface**
tr: **Kullanıcı arayüzü**

source: Image quality in monitoring mode
tr: İzleme modunda görüntü kalitesi
