Repository: veyon/docs
Catalog: locale/*/LC_MESSAGES/admin.po
Languages: tr

source: In addition to the computer name the MAC addresses of computers are stored in the LDAP directory in some environments, for example if the DHCP server also accesses the LDAP directory. If the Veyon feature is to be used to switch on computers via `Wake-on-LAN <https://en.wikipedia.org/wiki/Wake-on-LAN>`_, the corresponding attribute name must be entered here, since the MAC address is required for this functionality. Typical attribute names are ``hwAddress`` or ``dhcpAddress``.
tr: Bilgisayar adına ek olarak, bazı ortamlarda bilgisayarların MAC adresleri LDAP dizininde saklanır, örneğin DHCP sunucusu LDAP dizinine de erişiyorsa. Veyon özelliğinin `Wake-on-LAN <https://en.wikipedia.org/wiki/Wake-on-LAN>`_ üzerinden bilgisayarları açmak için kullanılması durumunda, bu işlevsellik için MAC adresi gerekli olduğundan, karşılık gelen öznitelik adı buraya girilmelidir. Tipik öznitelik adları ``hwAddress`` veya ``dhcpAddress``'tir.

source: In a standard Active Directory there is no attribute which stores MAC addresses. You must therefore populate MAC addresses manually in an existing unused attribute such as ``wwwHomepage`` or extend the AD schema. Additionally you can grant computers group write access to ``SELF`` and use a PowerShell script to make each computer automatically store the MAC address of its first physical LAN adapter when booting.
tr: Standart bir Active Directory'de MAC adreslerini depolayan bir öznitelik yoktur. Bu nedenle, ``wwwHomepage`` gibi mevcut kullanılmayan bir öznitelikte MAC adreslerini manuel olarak doldurmanız veya AD şemasını genişletmeniz gerekir. Ek olarak, bilgisayarlara ``SELF`` için grup yazma erişimi verebilir ve her bilgisayarın önyükleme sırasında ilk fiziksel LAN bağdaştırıcısının MAC adresini otomatik olarak depolamasını sağlamak için bir PowerShell betiği kullanabilirsiniz.

source: Computer location attribute
tr: Bilgisayar konum özniteliği

source: If the LDAP schema for computer objects provides a special attribute for the mapping to a location, this attribute name can be entered here. The :guilabel:`Test` button can be used to verify whether the computers at a location can be queried correctly using the configured attribute. In the advanced settings, you can then specify in section :ref:`LDAPComputerLocations` that the computer location attribute is used.
tr: Bilgisayar nesneleri için LDAP şeması bir konuma eşleme için özel bir öznitelik sağlıyorsa, bu öznitelik adı buraya girilebilir. :guilabel:`Test` düğmesi, yapılandırılmış öznitelik kullanılarak bir konumdaki bilgisayarların doğru şekilde sorgulanıp sorgulanamayacağını doğrulamak için kullanılabilir. Gelişmiş ayarlarda, daha sonra :ref:`LDAPComputerLocations` bölümünde bilgisayar konumu özniteliğinin kullanıldığını belirtebilirsiniz.

source: Location name attribute
tr: Konum adı özniteliği

source: When identifying computer locations via computer groups or computer containers, the value of a certain attribute can be displayed as the location name instead of the *Common Names* of these groups or objects. If, for example, computer groups have an attribute called ``name`` or ``description``, a meaningful location name can be stored in this attribute and the attribute name can be entered here.
tr: Bilgisayar grupları veya bilgisayar kapsayıcıları aracılığıyla bilgisayar konumlarını tanımlarken, belirli bir özniteliğin değeri, bu grupların veya nesnelerin *Ortak Adları* yerine konum adı olarak görüntülenebilir. Örneğin, bilgisayar gruplarının ``name`` veya ``description`` adlı bir özniteliği varsa, bu öznitelikte anlamlı bir konum adı saklanabilir ve öznitelik adı buraya girilebilir.

source: Advanced settings
tr: Gelişmiş ayarlar

source: With the advanced settings the LDAP integration and the use of the information from the LDAP directory can be customized to individual needs.
tr: Gelişmiş ayarlar sayesinde LDAP entegrasyonu ve LDAP dizininden gelen bilgilerin kullanımı bireysel ihtiyaçlara göre özelleştirilebilir.

source: Optional object filters
tr: İsteğe bağlı nesne filtreleri

source: With LDAP filters, the LDAP objects used by Veyon can be narrowed down if, for example, computer objects such as printers are not to be displayed in the Veyon Master. Next to each input field there is a button for checking the respective object filter.
tr: LDAP filtreleriyle, örneğin yazıcılar gibi bilgisayar nesnelerinin Veyon Master'da görüntülenmemesi gerekiyorsa, Veyon tarafından kullanılan LDAP nesneleri daraltılabilir. Her giriş alanının yanında, ilgili nesne filtresini kontrol etmek için bir düğme bulunur.

source: As of Veyon 4.1 the optional filters follow the well-known scheme for LDAP filters (see for example `RFC 2254 <https://www.ietf.org/rfc/rfc2254.txt>`_ or `Active Directory: LDAP Syntax Filters <https://social.technet.microsoft.com/wiki/contents/articles/5392.active-directory-ldap-syntax-filters.aspx>`_) such as ``(objectClass=XYZ)``.
tr: Veyon 4.1'den itibaren isteğe bağlı filtreler LDAP filtreleri için bilinen şemayı takip eder (örneğin `RFC 2254 <https://www.ietf.org/rfc/rfc2254.txt>`_ veya `Active Directory: LDAP Sözdizimi Filtreleri <https://social.technet.microsoft.com/wiki/contents/articles/5392.active-directory-ldap-syntax-filters.aspx>`_) örneğin ``(objectClass=XYZ)``.

source: Filter for users
tr: Kullanıcılar için filtre

source: You can define an LDAP filter for users here, e.g. ``(objectClass=person)`` or ``(&(objectClass=person)(objectClass=veyonUser))``.
tr: Burada kullanıcılar için bir LDAP filtresi tanımlayabilirsiniz, örneğin ``(objectClass=person)`` veya ``(&(objectClass=person)(objectClass=veyonUser))``.

source: Filter for user groups
tr: Kullanıcı grupları için filtre

source: You can define an LDAP filter for user groups here, e.g. ``(objectClass=group)`` or ``(|(cn=teachers)(cn=students)(cn=admins))``.
tr: Burada kullanıcı grupları için bir LDAP filtresi tanımlayabilirsiniz, örneğin ``(objectClass=group)`` veya ``(|(cn=teachers)(cn=students)(cn=admins))``.

source: Filter for computers
tr: Bilgisayarlar için filtre

source: You can define an LDAP filter for computers here, e.g. ``(objectClass=computer)`` or ``(&(!(cn=printer*))(!(cn=scanner*)))``.
tr: Burada bilgisayarlar için bir LDAP filtresi tanımlayabilirsiniz, örneğin ``(objectClass=computer)`` veya ``(&(!(cn=printer*))(!(cn=scanner*)))``.

source: Filter for computer groups
tr: Bilgisayar grupları için filtre

source: You can define an LDAP filter for computer groups here, e.g. ``(objectClass=room)`` or ``(cn=Room*)``. If computer groups are used as locations, you can filter the displayed locations this way.
tr: Burada bilgisayar grupları için bir LDAP filtresi tanımlayabilirsiniz, örneğin ``(objectClass=room)`` veya ``(cn=Room*)``. Bilgisayar grupları konum olarak kullanılıyorsa, görüntülenen konumları bu şekilde filtreleyebilirsiniz.

source: Filter for computer containers
tr: Bilgisayar kapsayıcıları için filtre

source: You can define an LDAP filter for computer containers here, e.g. ``(objectClass=container)`` or ``(objectClass=organizationalUnit)``. If containers/OUs are used as locations, you can filter the displayed locations this way.
tr: Burada bilgisayar kapsayıcıları için bir LDAP filtresi tanımlayabilirsiniz, örneğin ``(objectClass=container)`` veya ``(objectClass=organizationalUnit)``. Kapsayıcılar/OU'lar konum olarak kullanılıyorsa, görüntülenen konumları bu şekilde filtreleyebilirsiniz.

source: Query options
tr: Sorgu seçenekleri

source: Query nested user groups (supported by AD only)
tr: İç içe geçmiş kullanıcı gruplarını sorgula (yalnızca AD tarafından desteklenir)

source: If you have nested user groups (currently supported by Active Directory only), you can enable this option to make Veyon query all (even indirect) groups of a user. When enabled, you could for example create a group ``Veyon Users`` with the existing user groups ``Teachers`` and ``IT Staff`` as members. The ``Veyon Users`` group can then be used for :ref:`ConfAccessControl` purposes.
tr: İç içe kullanıcı gruplarınız varsa (şu anda yalnızca Active Directory tarafından desteklenmektedir), Veyon'un bir kullanıcının tüm (dolaylı bile olsa) gruplarını sorgulamasını sağlamak için bu seçeneği etkinleştirebilirsiniz. Etkinleştirildiğinde, örneğin üye olarak mevcut kullanıcı grupları ``Öğretmenler`` ve ``BT Personeli`` ile ``Veyon Kullanıcıları`` adlı bir grup oluşturabilirsiniz. ``Veyon Kullanıcıları`` grubu daha sonra :ref:`ConfAccessControl` amaçları için kullanılabilir.

source: Group member identification
tr: Grup üye tanımlaması

source: The content of the group membership attributes varies across different LDAP implementations. While in Active Directory the *distinguished name (DN)* of an object is stored in the member attribute, OpenLDAP usually stores the user login name (``uid`` or similar) or the computer name. In order for Veyon to use the correct value for querying groups of a user or computer, the appropriate setting must be chosen here.
tr: Grup üyeliği özniteliklerinin içeriği farklı LDAP uygulamaları arasında değişir. Active Directory'de bir nesnenin *ayırt edici adı (DN)* üye özniteliğinde saklanırken, OpenLDAP genellikle kullanıcı oturum açma adını (``uid`` veya benzeri) veya bilgisayar adını saklar. Veyon'un bir kullanıcı veya bilgisayarın gruplarını sorgulamak için doğru değeri kullanabilmesi için burada uygun ayarın seçilmesi gerekir.

source: Distinguished name (Samba/AD)
tr: Ayırt edici isim (Samba/AD)

source: This option has to be chosen, if the distinguished name (DN) of an object is stored in a member attribute of the group. Usually Samba and AD server use this scheme.
tr: Bir nesnenin ayırt edici adı (DN) grubun bir üye özniteliğinde saklanıyorsa, bu seçenek seçilmelidir. Genellikle Samba ve AD sunucusu bu şemayı kullanır.

source: Configured attribute for user login name or computer hostname (OpenLDAP)
tr: Kullanıcı oturum açma adı veya bilgisayar ana bilgisayar adı için yapılandırılmış öznitelik (OpenLDAP)

source: This option has to be chosen, if the login name of a user (username) or the hostname of a computer is stored in the member attributes of a group. Usually OpenLDAP server use this scheme.
tr: Bir kullanıcının oturum açma adı (username) veya bir bilgisayarın ana bilgisayar adı bir grubun üye niteliklerinde saklanıyorsa, bu seçenek seçilmelidir. Genellikle OpenLDAP sunucusu bu şemayı kullanır.

source: Computer locations
tr: Bilgisayar konumları

source: Veyon offers several methods to represent computer locations in an LDAP directory. In the simple case there is one computer group for every location (e.g. room). All computers at a specific location are members of the corresponding group. If computers instead are organized in containers or organizational units (OUs), these parent objects can be used as locations. Both procedures do not require any adaptation of the LDAP schema. As a third possibility, the location name can also be stored as a special attribute in each computer object.
tr: Veyon, bir LDAP dizinindeki bilgisayar konumlarını temsil etmek için çeşitli yöntemler sunar. Basit durumda her konum için bir bilgisayar grubu vardır (ör. oda). Belirli bir konumdaki tüm bilgisayarlar ilgili grubun üyeleridir. Bilgisayarlar bunun yerine kapsayıcılar veya organizasyon birimleri (OU'lar) halinde düzenlenirse, bu üst nesneler konum olarak kullanılabilir. Her iki prosedür de LDAP şemasının herhangi bir şekilde uyarlanmasını gerektirmez. Üçüncü bir olasılık olarak, konum adı her bilgisayar nesnesinde özel bir öznitelik olarak da saklanabilir.

source: Computer groups
tr: Bilgisayar grupları

source: This option specifies that computer locations are identified through computer groups. All computer groups are then displayed as locations in the Veyon Master. For each location all computers that are members of the corresponding group are displayed. If not all LDAP groups are to be displayed as locations, either a dedicated :ref:`computer group tree <LDAPComputerGroupTree>` must be configured or the computer groups must be restricted using a :ref:`computer group filter <LDAPComputerGroupsFilter>`.
tr: Bu seçenek, bilgisayar konumlarının bilgisayar grupları aracılığıyla tanımlandığını belirtir. Tüm bilgisayar grupları daha sonra Veyon Master'da konumlar olarak görüntülenir. Her konum için ilgili grubun üyesi olan tüm bilgisayarlar görüntülenir. Tüm LDAP grupları konumlar olarak görüntülenmeyecekse, özel bir :ref:`bilgisayar grubu ağacı <LDAPComputerGroupTree>` yapılandırılmalı veya bilgisayar grupları bir :ref:`bilgisayar grubu filtresi <LDAPComputerGroupsFilter>` kullanılarak kısıtlanmalıdır.

source: **Default:** *enabled*
tr: **Varsayılan:** *etkin*

source: Computer containers or OUs
tr: Bilgisayar konteynerleri veya OU'lar

source: This option specifies that the containers/OUs containing computer objects are used as computer locations. Containers are objects that are parents to computer objects in the LDAP tree. If not all containers are to be displayed as locations, a corresponding :ref:`computer container filter <LDAPComputerContainersFilter>` can be set up.
tr: Bu seçenek, bilgisayar nesnelerini içeren kapsayıcıların/OU'ların bilgisayar konumları olarak kullanıldığını belirtir. Kapsayıcılar, LDAP ağacındaki bilgisayar nesnelerinin üst öğeleri olan nesnelerdir. Tüm kapsayıcıların konum olarak görüntülenmesi istenmiyorsa, karşılık gelen bir :ref:`bilgisayar kapsayıcı filtresi <LDAPComputerContainersFilter>` ayarlanabilir.

source: Location attribute in computer objects
tr: Bilgisayar nesnelerindeki konum niteliği

source: If the LDAP schema for computer objects provides a special attribute for mapping computer objects to locations, this option can be enabled and the attribute name can be entered. The :guilabel:`Test` button can be used to check whether the members of a computer location can be queried correctly using the configured attribute.
tr: Bilgisayar nesneleri için LDAP şeması, bilgisayar nesnelerini konumlara eşlemek için özel bir öznitelik sağlıyorsa, bu seçenek etkinleştirilebilir ve öznitelik adı girilebilir. :guilabel:`Test` düğmesi, bir bilgisayar konumunun üyelerinin yapılandırılmış öznitelik kullanılarak doğru şekilde sorgulanıp sorgulanamayacağını kontrol etmek için kullanılabilir.

source: Integration tests
tr: Entegrasyon testleri

source: The integration tests can be used to check the LDAP integration as a whole. The buttons allow various tests to be performed. All tests should be successful and provide valid results before the LDAP connection is used in production.
tr: Entegrasyon testleri, LDAP entegrasyonunu bir bütün olarak kontrol etmek için kullanılabilir. Düğmeler çeşitli testlerin gerçekleştirilmesine olanak tanır. LDAP bağlantısı üretimde kullanılmadan önce tüm testler başarılı olmalı ve geçerli sonuçlar sağlamalıdır.

source: Using LDAP backends
tr: LDAP arka uçlarını kullanma

source: With the successful configuration and testing of the LDAP integration, the LDAP backends can now be activated. For this, the :ref:`network object directory <RefNetworkObjectDirectory>` and the user groups backend for the :ref:`computer access control <ComputerAccessControl>` must be adapted. Only after switching the network object directory to *LDAP* the location and computer information from the LDAP directory are used in the Veyon Master.
tr: LDAP entegrasyonunun başarılı bir şekilde yapılandırılması ve test edilmesiyle, LDAP arka uçları artık etkinleştirilebilir. Bunun için, :ref:`network object directory <RefNetworkObjectDirectory>` ve :ref:`computer access control <ComputerAccessControl>` için kullanıcı grupları arka ucu uyarlanmalıdır. Yalnızca network object dizini *LDAP* olarak değiştirildikten sonra LDAP dizininden gelen konum ve bilgisayar bilgileri Veyon Master'da kullanılır.

source: After changing the backend for the computer access control, all previously configured access rules should under all circumstances be checked, since group and location information change and in most cases access rules will no longer be valid or not be processed correctly.
tr: Bilgisayar erişim kontrolü için arka uç değiştirildikten sonra, daha önce yapılandırılmış tüm erişim kuralları her koşulda kontrol edilmelidir, çünkü grup ve konum bilgileri değişir ve çoğu durumda erişim kuralları artık geçerli olmayacaktır veya doğru şekilde işlenmeyecektir.

source: The :ref:`CommandLineInterface` of Veyon allows some LDAP-specific operations. All operations are available using the ``ldap`` module. A list of all supported commands is displayed via ``veyon-cli ldap help``, while command-specific help texts can be displayed via ``veyon-cli ldap help <command>``.
tr: Veyon'un :ref:`CommandLineInterface`'i bazı LDAP'ye özgü işlemlere izin verir. Tüm işlemler ``ldap`` modülü kullanılarak kullanılabilir. Desteklenen tüm komutların listesi ``veyon-cli ldap help`` aracılığıyla görüntülenirken, komuta özgü yardım metinleri ``veyon-cli ldap help <command>`` aracılığıyla görüntülenebilir.

source: This command can be used to automatically determine the used base DN and permanently write it to the configuration. An LDAP server URL and optionally a naming context attribute have to be supplied as parameters:
tr: Bu komut, kullanılan temel DN'yi otomatik olarak belirlemek ve bunu yapılandırmaya kalıcı olarak yazmak için kullanılabilir. Bir LDAP sunucusu URL'si ve isteğe bağlı olarak bir adlandırma bağlamı niteliği parametre olarak sağlanmalıdır:

source: Special characters such as ``@`` or ``:`` – especially in the password - can be specified by using `URL percent-encoding <https://en.wikipedia.org/wiki/Percent-encoding>`_.
tr: ``@`` veya ``:`` gibi özel karakterler (özellikle parolada) `URL yüzde kodlaması <https://en.wikipedia.org/wiki/Percent-encoding>`_ kullanılarak belirtilebilir.

source: This command allows querying LDAP objects (``locations``, ``computers``, ``groups``, ``users``) and is mainly used for testing. The function can also be used to develop scripts for system integration tasks.
tr: Bu komut LDAP nesnelerinin (``konumlar``, ``bilgisayarlar``, ``gruplar``, ``kullanıcılar``) sorgulanmasına izin verir ve esas olarak test için kullanılır. İşlev ayrıca sistem bütünleştirme görevleri için betikler geliştirmek için de kullanılabilir.

source: Directory service
tr: Dizin hizmeti

source: LDAP server
tr: LDAP sunucusu

source: Anonymous bind
tr: Kimliksiz bağla

source: Use bind credentials
tr: Bağlama yetkileri kullan

source: LDAP naming contexts
tr: LDAP adlandırma bağlamları

source: LDAP object trees
tr: LDAP nesne ağaçları

source: LDAP Common Names
tr: LDAP Genel Adları

source: LDAP Organizational Units
tr: LDAP Organizasyon Birimleri

source: Recursive search operations
tr: Tekrarlayan arama işlemleri

source: LDAP object attributes
tr: LDAP nesne öznitelikleri

source: LDAP user object
tr: LDAP kullanıcı nesnesi

source: LDAP computer object
tr: LDAP bilgisayar nesnesi

source: Fully qualified domain names
tr: Tam nitelikli alan adları

source: MAC address
tr: MAC adresi

source: Computer location
tr: Bilgisayar konumu

source: Object filters
tr: Nesne filtreleri

source: LDAP object filter
tr: LDAP nesne filtresi

source: LDAP filters
tr: LDAP filtreleri

source: LDAP integration tests
tr: LDAP entegrasyon testleri

source: LDAP backend
tr: LDAP arka ucu

source: Platform specific notes
tr: Platforma özgü notlar

source: This chapter contains notes on platform-specific configuration options and pecularities.
tr: Bu bölümde platforma özgü yapılandırma seçenekleri ve özellikleri hakkında notlar yer almaktadır.

source: Enable SAS generation by software (Ctrl+Alt+Del)
tr: Yazılım tarafından SAS oluşturulmasını etkinleştir (Ctrl+Alt+Del)

source: On Windows per default it's impossible for applications to generate the *Secure Attention Sequence* (Ctrl+Alt+Del) in order to simulate the press of these keys. When enabling this option a policy is written to the Windows registry which changes this behavior. It is recommended to leave this option enabled in order to be able to send :kbd:`Ctrl+Alt+Del` when remote controlling a computer. Otherwise it may be impossible to unlock a remotely controlled computer or logging on a user since in most cases the shortcut :kbd:`Ctrl+Alt+Del` has to be issued first.
tr: Windows'da varsayılan olarak uygulamaların bu tuşlara basmayı simüle etmek için *Güvenli Dikkat Dizisi* (Ctrl+Alt+Del) oluşturması imkansızdır. Bu seçeneği etkinleştirdiğinizde, bu davranışı değiştiren bir politika Windows kayıt defterine yazılır. Bir bilgisayarı uzaktan kontrol ederken :kbd:`Ctrl+Alt+Del` gönderebilmek için bu seçeneğin etkin bırakılması önerilir. Aksi takdirde, çoğu durumda önce :kbd:`Ctrl+Alt+Del` kısayolunun verilmesi gerektiğinden, uzaktan kontrol edilen bir bilgisayarın kilidini açmak veya bir kullanıcıya giriş yapmak imkansız olabilir.

source: User authentication
tr: Kullanıcı kimlik doğrulaması

source: Veyon implements two different mechanisms to authenticate a user (i.e. verify its username and password) on Windows when using :ref:`logon authentication <ConfLogonAuthentication>`. The default mechanism has been used successfully for many years. It is based on the `Security Support Provider Interface <https://en.wikipedia.org/wiki/Security_Support_Provider_Interface>`_ and works in almost every environment. To verify that the mechanism works properly in your environment you can change the :ref:`authentication method <RefAuthentication>` to :guilabel:`Logon authentication` and click the :guilabel:`Test` button.
tr: Veyon, Windows'ta :ref:`logon authentication <ConfLogonAuthentication>` kullanıldığında bir kullanıcıyı doğrulamak (yani kullanıcı adını ve parolasını doğrulamak) için iki farklı mekanizma uygular. Varsayılan mekanizma uzun yıllardır başarıyla kullanılmaktadır. `Security Support Provider Interface <https://tr.wikipedia.org/wiki/Security_Support_Provider_Interface>`_ temeline dayanır ve hemen hemen her ortamda çalışır. Mekanizmanın ortamınızda düzgün çalıştığını doğrulamak için :ref:`authentication method <RefAuthentication>`'yi :guilabel:`Logon authentication` olarak değiştirebilir ve :guilabel:`Test` düğmesine tıklayabilirsiniz.

source: Use alternative user authentication mechanism
tr: Alternatif kullanıcı kimlik doğrulama mekanizmasını kullanın

source: In case the default mechanism is not working in your environment you can try to use an alternative fallback mechanism. This mechanism utilizes a high level function in the operating system which performs a network user logon internally to verify the user credentials. This logon process can be slower than the simple authentication performed by the default mechanism. It should therefore only be used as a last resort.
tr: Varsayılan mekanizma ortamınızda çalışmıyorsa alternatif bir geri dönüş mekanizması kullanmayı deneyebilirsiniz. Bu mekanizma, kullanıcı kimlik bilgilerini doğrulamak için dahili olarak bir ağ kullanıcısı oturum açma işlemi gerçekleştiren işletim sistemindeki yüksek düzeyli bir işlevi kullanır. Bu oturum açma işlemi, varsayılan mekanizma tarafından gerçekleştirilen basit kimlik doğrulamasından daha yavaş olabilir. Bu nedenle yalnızca son çare olarak kullanılmalıdır.

source: User login
tr: Kullanıcı Girişi
