Repository: veyon/docs
Catalog: locale/*/LC_MESSAGES/index.po
Languages: pl, sv, tr

source: Veyon Documentation
pl: Dokumentacja Veyon
sv: Veyon dokumentation
tr: Veyon Belgeleri

source: Online documentation
pl: Dokumentacja online
sv: Dokumentation online
tr: Çevrimiçi belgeler

source: PDF download
pl: Pobierz plik PDF
sv: PDF-hämtning
tr: PDF indir

source: `Veyon Administrator Manual PDF <https://github.com/veyon/docs/releases/download/v4.9.5/veyon-admin-manual-en_4.9.5.pdf>`_
pl: `Podręcznik administratora Veyon PDF <https://github.com/veyon/docs/releases/download/v4.9.5/veyon-admin-manual-pl_4.9.5.pdf>`_
sv: `Veyon administratörshandbok PDF <https://github.com/veyon/docs/releases/download/v4.9.5/veyon-admin-manual-en_4.9.5.pdf>`_

source: `Veyon User Manual PDF <https://github.com/veyon/docs/releases/download/v4.9.5/veyon-user-manual-en_4.9.5.pdf>`_
pl: `Instrukcja obsługi Veyon PDF <https://github.com/veyon/docs/releases/download/v4.9.5/veyon-user-manual-pl_4.9.5.pdf>`_
sv: `Veyon användarmanual PDF <https://github.com/veyon/docs/releases/download/v4.9.5/veyon-user-manual-en_4.9.5.pdf>`_

source: Other languages
pl: Inne języki
sv: Andra språk
tr: Diğer diller

source: `Chinese <https://docs.veyon.io/zh/latest/>`_
pl: `Chiński <https://docs.veyon.io/zh/latest/>`_
sv: `Kinesiska <https://docs.veyon.io/zh/latest/>`_
tr: `Çince <https://docs.veyon.io/zh/latest/>`_

source: `Chinese (Taiwan) <https://docs.veyon.io/zh_TW/latest/>`_
pl: `Chiński (Tajwan)<https://docs.veyon.io/zh_TW/latest/>`_
sv: `Kinesiska (Taiwan) <https://docs.veyon.io/zh_TW/latest/>`_
tr: `Çince (Tayvan) <https://docs.veyon.io/zh_TW/latest/>`_

source: `Czech <https://docs.veyon.io/cs/latest/>`_
pl: `Czeski <https://docs.veyon.io/cs/latest/>`_
sv: `Tjeckiska <https://docs.veyon.io/cs/latest/>`_
tr: `Çekçe <https://docs.veyon.io/cs/latest/>`_

source: `Dutch <https://docs.veyon.io/nl/latest/>`_
pl: `Holenderski <https://docs.veyon.io/nl/latest/>`_
sv: `Holländska <https://docs.veyon.io/nl/latest/>`_
tr: `Hollandaca <https://docs.veyon.io/nl/latest/>`_

source: `Spanish <https://docs.veyon.io/es/latest/>`_
pl: `Hiszpańki <https://docs.veyon.io/es/latest/>`_
sv: `Spanska <https://docs.veyon.io/es/latest/>`_
tr: `İspanyolca <https://docs.veyon.io/es/latest/>`_

source: `Estonian <https://docs.veyon.io/et/latest/>`_
pl: `Estoński <https://docs.veyon.io/et/latest/>`_
sv: `Estniska <https://docs.veyon.io/et/latest/>`_
tr: `Estonyaca <https://docs.veyon.io/et/latest/>`_

source: `French <https://docs.veyon.io/fr/latest/>`_
pl: `Francuski <https://docs.veyon.io/fr/latest/>`_
sv: `Franska <https://docs.veyon.io/fr/latest/>`_
tr: `Fransızca <https://docs.veyon.io/fr/latest/>`_

source: `German <https://docs.veyon.io/de/latest/>`_
pl: `Niemiecki <https://docs.veyon.io/de/latest/>`_
sv: `Tyska <https://docs.veyon.io/de/latest/>`_
tr: `Almanca <https://docs.veyon.io/de/latest/>`_

source: `Hungarian <https://docs.veyon.io/hu/latest/>`_
pl: `Węgierski <https://docs.veyon.io/hu/latest/>`_
sv: `Ungerska <https://docs.veyon.io/hu/latest/>`_
tr: `Macarca <https://docs.veyon.io/hu/latest/>`_

source: `Italian <https://docs.veyon.io/it/latest/>`_
pl: `Włoski <https://docs.veyon.io/it/latest/>`_
sv: `Italienska <https://docs.veyon.io/it/latest/>`_
tr: `İtalyanca <https://docs.veyon.io/it/latest/>`_

source: `Lithuanian <https://docs.veyon.io/lt/latest/>`_
pl: `Litewski <https://docs.veyon.io/lt/latest/>`_
sv: `Litauiska <https://docs.veyon.io/lt/latest/>`_
tr: `Litvanca <https://docs.veyon.io/lt/latest/>`_

source: `Polish <https://docs.veyon.io/pl/latest/>`_
pl: `Polski <https://docs.veyon.io/pl/latest/>`_
sv: `Polska <https://docs.veyon.io/pl/latest/>`_
tr: `Lehçe <https://docs.veyon.io/pl/latest/>`_

source: `Russian <https://docs.veyon.io/ru/latest/>`_
pl: `Rosyjski <https://docs.veyon.io/ru/latest/>`_
sv: `Ryska <https://docs.veyon.io/ru/latest/>`_
tr: `Rusça <https://docs.veyon.io/ru/latest/>`_

source: `Slovenian <https://docs.veyon.io/sl/latest/>`_
pl: `Słoweński <https://docs.veyon.io/sl/latest/>`_
sv: `Slovenska <https://docs.veyon.io/sl/latest/>`_
tr: `Slovence <https://docs.veyon.io/sl/latest/>`_

source: `Serbian <https://docs.veyon.io/sr/latest/>`_
pl: `Serbski <https://docs.veyon.io/sr/latest/>`_
sv: `Serbiska <https://docs.veyon.io/sr/latest/>`_
tr: `Sırpça <https://docs.veyon.io/sr/latest/>`_

source: `Ukrainian <https://docs.veyon.io/uk/latest/>`_
pl: `Ukraiński <https://docs.veyon.io/uk/latest/>`_
sv: `Ukrainska <https://docs.veyon.io/uk/latest/>`_
tr: `Ukraynaca <https://docs.veyon.io/uk/latest/>`_

source: `Veyon Administrator Manual PDF <https://github.com/veyon/docs/releases/download/v4.9.7/veyon-admin-manual-en_4.9.7.pdf>`_
tr: `Veyon Yönetici Kılavuzu PDF'si <https://github.com/veyon/docs/releases/download/v4.9.7/veyon-admin-manual-en_4.9.7.pdf>`_

source: `Veyon User Manual PDF <https://github.com/veyon/docs/releases/download/v4.9.7/veyon-user-manual-en_4.9.7.pdf>`_
tr: `Veyon Kullanım Kılavuzu PDF'si <https://github.com/veyon/docs/releases/download/v4.9.7/veyon-user-manual-en_4.9.7.pdf>`_
